/* automatically generated by rust-bindgen 0.71.1 */

pub const _VCRT_COMPILER_PREPROCESSOR: u32 = 1;
pub const _SAL_VERSION: u32 = 20;
pub const __SAL_H_VERSION: u32 = 180000000;
pub const _USE_DECLSPECS_FOR_SAL: u32 = 0;
pub const _USE_ATTRIBUTES_FOR_SAL: u32 = 0;
pub const _CRT_PACKING: u32 = 8;
pub const _HAS_EXCEPTIONS: u32 = 1;
pub const _STL_LANG: u32 = 0;
pub const _HAS_CXX17: u32 = 0;
pub const _HAS_CXX20: u32 = 0;
pub const _HAS_CXX23: u32 = 0;
pub const _HAS_NODISCARD: u32 = 0;
pub const CHAR_BIT: u32 = 8;
pub const SCHAR_MIN: i32 = -128;
pub const SCHAR_MAX: u32 = 127;
pub const UCHAR_MAX: u32 = 255;
pub const CHAR_MIN: i32 = -128;
pub const CHAR_MAX: u32 = 127;
pub const MB_LEN_MAX: u32 = 5;
pub const SHRT_MIN: i32 = -32768;
pub const SHRT_MAX: u32 = 32767;
pub const USHRT_MAX: u32 = 65535;
pub const INT_MIN: i32 = -2147483648;
pub const INT_MAX: u32 = 2147483647;
pub const UINT_MAX: u32 = 4294967295;
pub const LONG_MIN: i32 = -2147483648;
pub const LONG_MAX: u32 = 2147483647;
pub const ULONG_MAX: u32 = 4294967295;
pub const _ARM_WINAPI_PARTITION_DESKTOP_SDK_AVAILABLE: u32 = 1;
pub const _CRT_BUILD_DESKTOP_APP: u32 = 1;
pub const _ARGMAX: u32 = 100;
pub const _CRT_INT_MAX: u32 = 2147483647;
pub const _CRT_FUNCTIONS_REQUIRED: u32 = 1;
pub const _CRT_HAS_CXX17: u32 = 0;
pub const _CRT_HAS_C11: u32 = 1;
pub const _CRT_INTERNAL_NONSTDC_NAMES: u32 = 1;
pub const __STDC_SECURE_LIB__: u32 = 200411;

pub const MATH_ERREXCEPT: u32 = 2;
pub const math_errhandling: u32 = 3;
pub const _FE_DIVBYZERO: u32 = 4;
pub const _FE_INEXACT: u32 = 32;
pub const _FE_INVALID: u32 = 1;
pub const _FE_OVERFLOW: u32 = 8;
pub const _FE_UNDERFLOW: u32 = 16;
pub const _D0_C: u32 = 3;
pub const _D1_C: u32 = 2;
pub const _D2_C: u32 = 1;
pub const _D3_C: u32 = 0;
pub const _DBIAS: u32 = 1022;
pub const _DOFF: u32 = 4;
pub const _F0_C: u32 = 1;
pub const _F1_C: u32 = 0;
pub const _FBIAS: u32 = 126;
pub const _FOFF: u32 = 7;
pub const _FRND: u32 = 1;
pub const _L0_C: u32 = 3;
pub const _L1_C: u32 = 2;
pub const _L2_C: u32 = 1;
pub const _L3_C: u32 = 0;
pub const _LBIAS: u32 = 1022;
pub const _LOFF: u32 = 4;
pub const _FP_LT: u32 = 1;
pub const _FP_EQ: u32 = 2;
pub const _FP_GT: u32 = 4;
pub const DOMAIN: u32 = 1;
pub const SING: u32 = 2;
pub const OVERFLOW: u32 = 3;
pub const UNDERFLOW: u32 = 4;
pub const TLOSS: u32 = 5;
pub const PLOSS: u32 = 6;
pub const _NLSCMPERROR: u32 = 2147483647;
pub const WCHAR_MIN: u32 = 0;
pub const WCHAR_MAX: u32 = 65535;
pub const WINT_MIN: u32 = 0;
pub const WINT_MAX: u32 = 65535;
pub const LIBRAW_DEFAULT_ADJUST_MAXIMUM_THRESHOLD: f64 = 0.75;
pub const LIBRAW_DEFAULT_AUTO_BRIGHTNESS_THRESHOLD: f64 = 0.01;
pub const LIBRAW_MAX_ALLOC_MB_DEFAULT: u32 = 2048;
pub const LIBRAW_MAX_PROFILE_SIZE_MB: u32 = 256;
pub const LIBRAW_MAX_NONDNG_RAW_FILE_SIZE: u32 = 2147483647;
pub const LIBRAW_MAX_DNG_RAW_FILE_SIZE: u32 = 2147483647;
pub const LIBRAW_MAX_THUMBNAIL_MB: u32 = 512;
pub const LIBRAW_MAX_METADATA_BLOCKS: u32 = 1024;
pub const LIBRAW_CBLACK_SIZE: u32 = 4104;
pub const LIBRAW_IFD_MAXCOUNT: u32 = 10;
pub const LIBRAW_THUMBNAIL_MAXCOUNT: u32 = 8;
pub const LIBRAW_CRXTRACKS_MAXCOUNT: u32 = 16;
pub const LIBRAW_AFDATA_MAXCOUNT: u32 = 4;
pub const LIBRAW_AHD_TILE: u32 = 512;
pub const LIBRAW_LENS_NOT_SET: i32 = -1;
pub const LIBRAW_XTRANS: u32 = 9;
pub const LIBRAW_PROGRESS_THUMB_MASK: u32 = 268435455;
pub const LIBRAW_MAJOR_VERSION: u32 = 0;
pub const LIBRAW_MINOR_VERSION: u32 = 21;
pub const LIBRAW_PATCH_VERSION: u32 = 3;
pub const LIBRAW_SHLIB_CURRENT: u32 = 23;
pub const LIBRAW_SHLIB_REVISION: u32 = 0;
pub const LIBRAW_SHLIB_AGE: u32 = 0;
pub const LibRawBigEndian: u32 = 0;
pub const LIBRAW_HISTOGRAM_SIZE: u32 = 8192;
pub type va_list = *mut libc::c_char;
pub type __vcrt_bool = bool;
pub type wchar_t = libc::c_ushort;
unsafe extern "C" {
    pub static mut __security_cookie: usize;
}
pub type __crt_bool = bool;
pub type errno_t = libc::c_int;
pub type wint_t = libc::c_ushort;
pub type wctype_t = libc::c_ushort;
pub type __time32_t = libc::c_long;
pub type __time64_t = libc::c_longlong;
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct __crt_locale_data_public {
    pub _locale_pctype: *const libc::c_ushort,
    pub _locale_mb_cur_max: libc::c_int,
    pub _locale_lc_codepage: libc::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __crt_locale_data_public"]
        [::core::mem::size_of::<__crt_locale_data_public>() - 16usize];
    ["Alignment of __crt_locale_data_public"]
        [::core::mem::align_of::<__crt_locale_data_public>() - 8usize];
    ["Offset of field: __crt_locale_data_public::_locale_pctype"]
        [::core::mem::offset_of!(__crt_locale_data_public, _locale_pctype) - 0usize];
    ["Offset of field: __crt_locale_data_public::_locale_mb_cur_max"]
        [::core::mem::offset_of!(__crt_locale_data_public, _locale_mb_cur_max) - 8usize];
    ["Offset of field: __crt_locale_data_public::_locale_lc_codepage"]
        [::core::mem::offset_of!(__crt_locale_data_public, _locale_lc_codepage) - 12usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct __crt_locale_pointers {
    pub locinfo: *mut __crt_locale_data,
    pub mbcinfo: *mut __crt_multibyte_data,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __crt_locale_pointers"][::core::mem::size_of::<__crt_locale_pointers>() - 16usize];
    ["Alignment of __crt_locale_pointers"]
        [::core::mem::align_of::<__crt_locale_pointers>() - 8usize];
    ["Offset of field: __crt_locale_pointers::locinfo"]
        [::core::mem::offset_of!(__crt_locale_pointers, locinfo) - 0usize];
    ["Offset of field: __crt_locale_pointers::mbcinfo"]
        [::core::mem::offset_of!(__crt_locale_pointers, mbcinfo) - 8usize];
};
pub type _locale_t = *mut __crt_locale_pointers;
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct _Mbstatet {
    pub _Wchar: libc::c_ulong,
    pub _Byte: libc::c_ushort,
    pub _State: libc::c_ushort,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _Mbstatet"][::core::mem::size_of::<_Mbstatet>() - 8usize];
    ["Alignment of _Mbstatet"][::core::mem::align_of::<_Mbstatet>() - 4usize];
    ["Offset of field: _Mbstatet::_Wchar"][::core::mem::offset_of!(_Mbstatet, _Wchar) - 0usize];
    ["Offset of field: _Mbstatet::_Byte"][::core::mem::offset_of!(_Mbstatet, _Byte) - 4usize];
    ["Offset of field: _Mbstatet::_State"][::core::mem::offset_of!(_Mbstatet, _State) - 6usize];
};
pub type mbstate_t = _Mbstatet;
pub type time_t = __time64_t;
pub type rsize_t = usize;
unsafe extern "C" {
    pub fn memchr(
        _Buf: *const libc::c_void,
        _Val: libc::c_int,
        _MaxCount: libc::c_ulonglong,
    ) -> *mut libc::c_void;
}
unsafe extern "C" {
    pub fn memcmp(
        _Buf1: *const libc::c_void,
        _Buf2: *const libc::c_void,
        _Size: libc::c_ulonglong,
    ) -> libc::c_int;
}
unsafe extern "C" {
    pub fn memcpy(
        _Dst: *mut libc::c_void,
        _Src: *const libc::c_void,
        _Size: libc::c_ulonglong,
    ) -> *mut libc::c_void;
}
unsafe extern "C" {
    pub fn memmove(
        _Dst: *mut libc::c_void,
        _Src: *const libc::c_void,
        _Size: libc::c_ulonglong,
    ) -> *mut libc::c_void;
}
unsafe extern "C" {
    pub fn memset(
        _Dst: *mut libc::c_void,
        _Val: libc::c_int,
        _Size: libc::c_ulonglong,
    ) -> *mut libc::c_void;
}
unsafe extern "C" {
    pub fn strchr(_Str: *const libc::c_char, _Val: libc::c_int) -> *mut libc::c_char;
}
unsafe extern "C" {
    pub fn strrchr(_Str: *const libc::c_char, _Ch: libc::c_int) -> *mut libc::c_char;
}
unsafe extern "C" {
    pub fn strstr(_Str: *const libc::c_char, _SubStr: *const libc::c_char) -> *mut libc::c_char;
}
unsafe extern "C" {
    pub fn wcschr(_Str: *const libc::c_ushort, _Ch: libc::c_ushort) -> *mut libc::c_ushort;
}
unsafe extern "C" {
    pub fn wcsrchr(_Str: *const wchar_t, _Ch: wchar_t) -> *mut wchar_t;
}
unsafe extern "C" {
    pub fn wcsstr(_Str: *const wchar_t, _SubStr: *const wchar_t) -> *mut wchar_t;
}
unsafe extern "C" {
    pub fn memccpy(
        _Dst: *mut libc::c_void,
        _Src: *const libc::c_void,
        _Val: libc::c_int,
        _Size: libc::c_ulonglong,
    ) -> *mut libc::c_void;
}
unsafe extern "C" {
    pub fn memicmp(
        _Buf1: *const libc::c_void,
        _Buf2: *const libc::c_void,
        _Size: usize,
    ) -> libc::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct _iobuf {
    pub _Placeholder: *mut libc::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _iobuf"][::core::mem::size_of::<_iobuf>() - 8usize];
    ["Alignment of _iobuf"][::core::mem::align_of::<_iobuf>() - 8usize];
    ["Offset of field: _iobuf::_Placeholder"]
        [::core::mem::offset_of!(_iobuf, _Placeholder) - 0usize];
};
pub type FILE = _iobuf;
unsafe extern "C" {
    pub fn fgetwc(_Stream: *mut FILE) -> wint_t;
}
unsafe extern "C" {
    pub fn fputwc(_Character: wchar_t, _Stream: *mut FILE) -> wint_t;
}
unsafe extern "C" {
    pub fn getwc(_Stream: *mut FILE) -> wint_t;
}
unsafe extern "C" {
    pub fn getwchar() -> wint_t;
}
unsafe extern "C" {
    pub fn fgetws(
        _Buffer: *mut wchar_t,
        _BufferCount: libc::c_int,
        _Stream: *mut FILE,
    ) -> *mut wchar_t;
}
unsafe extern "C" {
    pub fn fputws(_Buffer: *const wchar_t, _Stream: *mut FILE) -> libc::c_int;
}
unsafe extern "C" {
    pub fn putwc(_Character: wchar_t, _Stream: *mut FILE) -> wint_t;
}
unsafe extern "C" {
    pub fn putwchar(_Character: wchar_t) -> wint_t;
}
unsafe extern "C" {
    pub fn ungetwc(_Character: wint_t, _Stream: *mut FILE) -> wint_t;
}
pub type fpos_t = libc::c_longlong;
unsafe extern "C" {
    pub fn clearerr_s(_Stream: *mut FILE) -> errno_t;
}
unsafe extern "C" {
    pub fn fopen_s(
        _Stream: *mut *mut FILE,
        _FileName: *const libc::c_char,
        _Mode: *const libc::c_char,
    ) -> errno_t;
}
unsafe extern "C" {
    pub fn fread_s(
        _Buffer: *mut libc::c_void,
        _BufferSize: usize,
        _ElementSize: usize,
        _ElementCount: usize,
        _Stream: *mut FILE,
    ) -> usize;
}
unsafe extern "C" {
    pub fn freopen_s(
        _Stream: *mut *mut FILE,
        _FileName: *const libc::c_char,
        _Mode: *const libc::c_char,
        _OldStream: *mut FILE,
    ) -> errno_t;
}
unsafe extern "C" {
    pub fn gets_s(_Buffer: *mut libc::c_char, _Size: rsize_t) -> *mut libc::c_char;
}
unsafe extern "C" {
    pub fn tmpfile_s(_Stream: *mut *mut FILE) -> errno_t;
}
unsafe extern "C" {
    pub fn tmpnam_s(_Buffer: *mut libc::c_char, _Size: rsize_t) -> errno_t;
}
unsafe extern "C" {
    pub fn clearerr(_Stream: *mut FILE);
}
unsafe extern "C" {
    pub fn fclose(_Stream: *mut FILE) -> libc::c_int;
}
unsafe extern "C" {
    pub fn feof(_Stream: *mut FILE) -> libc::c_int;
}
unsafe extern "C" {
    pub fn ferror(_Stream: *mut FILE) -> libc::c_int;
}
unsafe extern "C" {
    pub fn fflush(_Stream: *mut FILE) -> libc::c_int;
}
unsafe extern "C" {
    pub fn fgetc(_Stream: *mut FILE) -> libc::c_int;
}
unsafe extern "C" {
    pub fn fgetpos(_Stream: *mut FILE, _Position: *mut fpos_t) -> libc::c_int;
}
unsafe extern "C" {
    pub fn fgets(
        _Buffer: *mut libc::c_char,
        _MaxCount: libc::c_int,
        _Stream: *mut FILE,
    ) -> *mut libc::c_char;
}
unsafe extern "C" {
    pub fn fopen(_FileName: *const libc::c_char, _Mode: *const libc::c_char) -> *mut FILE;
}
unsafe extern "C" {
    pub fn fputc(_Character: libc::c_int, _Stream: *mut FILE) -> libc::c_int;
}
unsafe extern "C" {
    pub fn fputs(_Buffer: *const libc::c_char, _Stream: *mut FILE) -> libc::c_int;
}
unsafe extern "C" {
    pub fn fread(
        _Buffer: *mut libc::c_void,
        _ElementSize: libc::c_ulonglong,
        _ElementCount: libc::c_ulonglong,
        _Stream: *mut FILE,
    ) -> libc::c_ulonglong;
}
unsafe extern "C" {
    pub fn freopen(
        _FileName: *const libc::c_char,
        _Mode: *const libc::c_char,
        _Stream: *mut FILE,
    ) -> *mut FILE;
}
unsafe extern "C" {
    pub fn fsetpos(_Stream: *mut FILE, _Position: *const fpos_t) -> libc::c_int;
}
unsafe extern "C" {
    pub fn fseek(_Stream: *mut FILE, _Offset: libc::c_long, _Origin: libc::c_int) -> libc::c_int;
}
unsafe extern "C" {
    pub fn ftell(_Stream: *mut FILE) -> libc::c_long;
}
unsafe extern "C" {
    pub fn fwrite(
        _Buffer: *const libc::c_void,
        _ElementSize: libc::c_ulonglong,
        _ElementCount: libc::c_ulonglong,
        _Stream: *mut FILE,
    ) -> libc::c_ulonglong;
}
unsafe extern "C" {
    pub fn getc(_Stream: *mut FILE) -> libc::c_int;
}
unsafe extern "C" {
    pub fn getchar() -> libc::c_int;
}
unsafe extern "C" {
    pub fn perror(_ErrorMessage: *const libc::c_char);
}
unsafe extern "C" {
    pub fn putc(_Character: libc::c_int, _Stream: *mut FILE) -> libc::c_int;
}
unsafe extern "C" {
    pub fn putchar(_Character: libc::c_int) -> libc::c_int;
}
unsafe extern "C" {
    pub fn puts(_Buffer: *const libc::c_char) -> libc::c_int;
}
unsafe extern "C" {
    pub fn remove(_FileName: *const libc::c_char) -> libc::c_int;
}
unsafe extern "C" {
    pub fn rename(
        _OldFileName: *const libc::c_char,
        _NewFileName: *const libc::c_char,
    ) -> libc::c_int;
}
unsafe extern "C" {
    pub fn unlink(_FileName: *const libc::c_char) -> libc::c_int;
}
unsafe extern "C" {
    pub fn rewind(_Stream: *mut FILE);
}
unsafe extern "C" {
    pub fn setbuf(_Stream: *mut FILE, _Buffer: *mut libc::c_char);
}
unsafe extern "C" {
    pub fn setvbuf(
        _Stream: *mut FILE,
        _Buffer: *mut libc::c_char,
        _Mode: libc::c_int,
        _Size: usize,
    ) -> libc::c_int;
}
unsafe extern "C" {
    pub fn tmpfile() -> *mut FILE;
}
unsafe extern "C" {
    pub fn tmpnam(_Buffer: *mut libc::c_char) -> *mut libc::c_char;
}
unsafe extern "C" {
    pub fn ungetc(_Character: libc::c_int, _Stream: *mut FILE) -> libc::c_int;
}
unsafe extern "C" {
    pub fn tempnam(
        _Directory: *const libc::c_char,
        _FilePrefix: *const libc::c_char,
    ) -> *mut libc::c_char;
}
unsafe extern "C" {
    pub fn fcloseall() -> libc::c_int;
}
unsafe extern "C" {
    pub fn fdopen(_FileHandle: libc::c_int, _Format: *const libc::c_char) -> *mut FILE;
}
unsafe extern "C" {
    pub fn fgetchar() -> libc::c_int;
}
unsafe extern "C" {
    pub fn fileno(_Stream: *mut FILE) -> libc::c_int;
}
unsafe extern "C" {
    pub fn flushall() -> libc::c_int;
}
unsafe extern "C" {
    pub fn fputchar(_Ch: libc::c_int) -> libc::c_int;
}
unsafe extern "C" {
    pub fn getw(_Stream: *mut FILE) -> libc::c_int;
}
unsafe extern "C" {
    pub fn putw(_Ch: libc::c_int, _Stream: *mut FILE) -> libc::c_int;
}
unsafe extern "C" {
    pub fn rmtmp() -> libc::c_int;
}
unsafe extern "C" {
    pub fn calloc(_Count: libc::c_ulonglong, _Size: libc::c_ulonglong) -> *mut libc::c_void;
}
unsafe extern "C" {
    pub fn free(_Block: *mut libc::c_void);
}
unsafe extern "C" {
    pub fn malloc(_Size: libc::c_ulonglong) -> *mut libc::c_void;
}
unsafe extern "C" {
    pub fn realloc(_Block: *mut libc::c_void, _Size: libc::c_ulonglong) -> *mut libc::c_void;
}
pub type _CoreCrtSecureSearchSortCompareFunction = ::core::option::Option<
    unsafe extern "C" fn(
        arg1: *mut libc::c_void,
        arg2: *const libc::c_void,
        arg3: *const libc::c_void,
    ) -> libc::c_int,
>;
pub type _CoreCrtNonSecureSearchSortCompareFunction = ::core::option::Option<
    unsafe extern "C" fn(arg1: *const libc::c_void, arg2: *const libc::c_void) -> libc::c_int,
>;
unsafe extern "C" {
    pub fn bsearch_s(
        _Key: *const libc::c_void,
        _Base: *const libc::c_void,
        _NumOfElements: rsize_t,
        _SizeOfElements: rsize_t,
        _CompareFunction: _CoreCrtSecureSearchSortCompareFunction,
        _Context: *mut libc::c_void,
    ) -> *mut libc::c_void;
}
unsafe extern "C" {
    pub fn qsort_s(
        _Base: *mut libc::c_void,
        _NumOfElements: rsize_t,
        _SizeOfElements: rsize_t,
        _CompareFunction: _CoreCrtSecureSearchSortCompareFunction,
        _Context: *mut libc::c_void,
    );
}
unsafe extern "C" {
    pub fn bsearch(
        _Key: *const libc::c_void,
        _Base: *const libc::c_void,
        _NumOfElements: usize,
        _SizeOfElements: usize,
        _CompareFunction: _CoreCrtNonSecureSearchSortCompareFunction,
    ) -> *mut libc::c_void;
}
unsafe extern "C" {
    pub fn qsort(
        _Base: *mut libc::c_void,
        _NumOfElements: usize,
        _SizeOfElements: usize,
        _CompareFunction: _CoreCrtNonSecureSearchSortCompareFunction,
    );
}
unsafe extern "C" {
    pub fn lfind(
        _Key: *const libc::c_void,
        _Base: *const libc::c_void,
        _NumOfElements: *mut libc::c_uint,
        _SizeOfElements: libc::c_uint,
        _CompareFunction: _CoreCrtNonSecureSearchSortCompareFunction,
    ) -> *mut libc::c_void;
}
unsafe extern "C" {
    pub fn lsearch(
        _Key: *const libc::c_void,
        _Base: *mut libc::c_void,
        _NumOfElements: *mut libc::c_uint,
        _SizeOfElements: libc::c_uint,
        _CompareFunction: _CoreCrtNonSecureSearchSortCompareFunction,
    ) -> *mut libc::c_void;
}
unsafe extern "C" {
    pub fn wcstod(_String: *const wchar_t, _EndPtr: *mut *mut wchar_t) -> f64;
}
unsafe extern "C" {
    pub fn wcstol(
        _String: *const wchar_t,
        _EndPtr: *mut *mut wchar_t,
        _Radix: libc::c_int,
    ) -> libc::c_long;
}
unsafe extern "C" {
    pub fn wcstoll(
        _String: *const wchar_t,
        _EndPtr: *mut *mut wchar_t,
        _Radix: libc::c_int,
    ) -> libc::c_longlong;
}
unsafe extern "C" {
    pub fn wcstoul(
        _String: *const wchar_t,
        _EndPtr: *mut *mut wchar_t,
        _Radix: libc::c_int,
    ) -> libc::c_ulong;
}
unsafe extern "C" {
    pub fn wcstoull(
        _String: *const wchar_t,
        _EndPtr: *mut *mut wchar_t,
        _Radix: libc::c_int,
    ) -> libc::c_ulonglong;
}
unsafe extern "C" {
    pub fn wcstold(_String: *const wchar_t, _EndPtr: *mut *mut wchar_t) -> f64;
}
unsafe extern "C" {
    pub fn wcstof(_String: *const wchar_t, _EndPtr: *mut *mut wchar_t) -> f32;
}
unsafe extern "C" {
    pub fn exit(_Code: libc::c_int) -> !;
}
unsafe extern "C" {
    pub fn quick_exit(_Code: libc::c_int) -> !;
}
unsafe extern "C" {
    pub fn abort() -> !;
}
pub type _onexit_t = ::core::option::Option<unsafe extern "C" fn() -> libc::c_int>;
unsafe extern "C" {
    pub fn atexit(arg1: ::core::option::Option<unsafe extern "C" fn()>) -> libc::c_int;
}
unsafe extern "C" {
    pub fn at_quick_exit(arg1: ::core::option::Option<unsafe extern "C" fn()>) -> libc::c_int;
}
pub type _purecall_handler = ::core::option::Option<unsafe extern "C" fn()>;
pub type _invalid_parameter_handler = ::core::option::Option<
    unsafe extern "C" fn(
        arg1: *const wchar_t,
        arg2: *const wchar_t,
        arg3: *const wchar_t,
        arg4: libc::c_uint,
        arg5: usize,
    ),
>;
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct _div_t {
    pub quot: libc::c_int,
    pub rem: libc::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _div_t"][::core::mem::size_of::<_div_t>() - 8usize];
    ["Alignment of _div_t"][::core::mem::align_of::<_div_t>() - 4usize];
    ["Offset of field: _div_t::quot"][::core::mem::offset_of!(_div_t, quot) - 0usize];
    ["Offset of field: _div_t::rem"][::core::mem::offset_of!(_div_t, rem) - 4usize];
};
pub type div_t = _div_t;
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct _ldiv_t {
    pub quot: libc::c_long,
    pub rem: libc::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _ldiv_t"][::core::mem::size_of::<_ldiv_t>() - 8usize];
    ["Alignment of _ldiv_t"][::core::mem::align_of::<_ldiv_t>() - 4usize];
    ["Offset of field: _ldiv_t::quot"][::core::mem::offset_of!(_ldiv_t, quot) - 0usize];
    ["Offset of field: _ldiv_t::rem"][::core::mem::offset_of!(_ldiv_t, rem) - 4usize];
};
pub type ldiv_t = _ldiv_t;
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct _lldiv_t {
    pub quot: libc::c_longlong,
    pub rem: libc::c_longlong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _lldiv_t"][::core::mem::size_of::<_lldiv_t>() - 16usize];
    ["Alignment of _lldiv_t"][::core::mem::align_of::<_lldiv_t>() - 8usize];
    ["Offset of field: _lldiv_t::quot"][::core::mem::offset_of!(_lldiv_t, quot) - 0usize];
    ["Offset of field: _lldiv_t::rem"][::core::mem::offset_of!(_lldiv_t, rem) - 8usize];
};
pub type lldiv_t = _lldiv_t;
unsafe extern "C" {
    pub fn abs(_Number: libc::c_int) -> libc::c_int;
}
unsafe extern "C" {
    pub fn labs(_Number: libc::c_long) -> libc::c_long;
}
unsafe extern "C" {
    pub fn llabs(_Number: libc::c_longlong) -> libc::c_longlong;
}
unsafe extern "C" {
    pub fn div(_Numerator: libc::c_int, _Denominator: libc::c_int) -> div_t;
}
unsafe extern "C" {
    pub fn ldiv(_Numerator: libc::c_long, _Denominator: libc::c_long) -> ldiv_t;
}
unsafe extern "C" {
    pub fn lldiv(_Numerator: libc::c_longlong, _Denominator: libc::c_longlong) -> lldiv_t;
}
unsafe extern "C" {
    pub fn srand(_Seed: libc::c_uint);
}
unsafe extern "C" {
    pub fn rand() -> libc::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct _LDOUBLE {
    pub ld: [libc::c_uchar; 10usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _LDOUBLE"][::core::mem::size_of::<_LDOUBLE>() - 10usize];
    ["Alignment of _LDOUBLE"][::core::mem::align_of::<_LDOUBLE>() - 1usize];
    ["Offset of field: _LDOUBLE::ld"][::core::mem::offset_of!(_LDOUBLE, ld) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq)]
pub struct _CRT_DOUBLE {
    pub x: f64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _CRT_DOUBLE"][::core::mem::size_of::<_CRT_DOUBLE>() - 8usize];
    ["Alignment of _CRT_DOUBLE"][::core::mem::align_of::<_CRT_DOUBLE>() - 8usize];
    ["Offset of field: _CRT_DOUBLE::x"][::core::mem::offset_of!(_CRT_DOUBLE, x) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq)]
pub struct _CRT_FLOAT {
    pub f: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _CRT_FLOAT"][::core::mem::size_of::<_CRT_FLOAT>() - 4usize];
    ["Alignment of _CRT_FLOAT"][::core::mem::align_of::<_CRT_FLOAT>() - 4usize];
    ["Offset of field: _CRT_FLOAT::f"][::core::mem::offset_of!(_CRT_FLOAT, f) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq)]
pub struct _LONGDOUBLE {
    pub x: f64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _LONGDOUBLE"][::core::mem::size_of::<_LONGDOUBLE>() - 8usize];
    ["Alignment of _LONGDOUBLE"][::core::mem::align_of::<_LONGDOUBLE>() - 8usize];
    ["Offset of field: _LONGDOUBLE::x"][::core::mem::offset_of!(_LONGDOUBLE, x) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct _LDBL12 {
    pub ld12: [libc::c_uchar; 12usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _LDBL12"][::core::mem::size_of::<_LDBL12>() - 12usize];
    ["Alignment of _LDBL12"][::core::mem::align_of::<_LDBL12>() - 1usize];
    ["Offset of field: _LDBL12::ld12"][::core::mem::offset_of!(_LDBL12, ld12) - 0usize];
};
unsafe extern "C" {
    pub fn atof(_String: *const libc::c_char) -> f64;
}
unsafe extern "C" {
    pub fn atoi(_String: *const libc::c_char) -> libc::c_int;
}
unsafe extern "C" {
    pub fn atol(_String: *const libc::c_char) -> libc::c_long;
}
unsafe extern "C" {
    pub fn atoll(_String: *const libc::c_char) -> libc::c_longlong;
}
unsafe extern "C" {
    pub fn strtof(_String: *const libc::c_char, _EndPtr: *mut *mut libc::c_char) -> f32;
}
unsafe extern "C" {
    pub fn strtod(_String: *const libc::c_char, _EndPtr: *mut *mut libc::c_char) -> f64;
}
unsafe extern "C" {
    pub fn strtol(
        _String: *const libc::c_char,
        _EndPtr: *mut *mut libc::c_char,
        _Radix: libc::c_int,
    ) -> libc::c_long;
}
unsafe extern "C" {
    pub fn strtoll(
        _String: *const libc::c_char,
        _EndPtr: *mut *mut libc::c_char,
        _Radix: libc::c_int,
    ) -> libc::c_longlong;
}
unsafe extern "C" {
    pub fn strtoul(
        _String: *const libc::c_char,
        _EndPtr: *mut *mut libc::c_char,
        _Radix: libc::c_int,
    ) -> libc::c_ulong;
}
unsafe extern "C" {
    pub fn strtoull(
        _String: *const libc::c_char,
        _EndPtr: *mut *mut libc::c_char,
        _Radix: libc::c_int,
    ) -> libc::c_ulonglong;
}
unsafe extern "C" {
    pub fn mblen(_Ch: *const libc::c_char, _MaxCount: usize) -> libc::c_int;
}
unsafe extern "C" {
    pub fn mbtowc(
        _DstCh: *mut wchar_t,
        _SrcCh: *const libc::c_char,
        _SrcSizeInBytes: usize,
    ) -> libc::c_int;
}
unsafe extern "C" {
    pub fn mbstowcs_s(
        _PtNumOfCharConverted: *mut usize,
        _DstBuf: *mut wchar_t,
        _SizeInWords: usize,
        _SrcBuf: *const libc::c_char,
        _MaxCount: usize,
    ) -> errno_t;
}
unsafe extern "C" {
    pub fn mbstowcs(_Dest: *mut wchar_t, _Source: *const libc::c_char, _MaxCount: usize) -> usize;
}
unsafe extern "C" {
    pub fn wctomb(_MbCh: *mut libc::c_char, _WCh: wchar_t) -> libc::c_int;
}
unsafe extern "C" {
    pub fn wctomb_s(
        _SizeConverted: *mut libc::c_int,
        _MbCh: *mut libc::c_char,
        _SizeInBytes: rsize_t,
        _WCh: wchar_t,
    ) -> errno_t;
}
unsafe extern "C" {
    pub fn wcstombs_s(
        _PtNumOfCharConverted: *mut usize,
        _Dst: *mut libc::c_char,
        _DstSizeInBytes: usize,
        _Src: *const wchar_t,
        _MaxCountInBytes: usize,
    ) -> errno_t;
}
unsafe extern "C" {
    pub fn wcstombs(_Dest: *mut libc::c_char, _Source: *const wchar_t, _MaxCount: usize) -> usize;
}
unsafe extern "C" {
    pub fn getenv_s(
        _RequiredCount: *mut usize,
        _Buffer: *mut libc::c_char,
        _BufferCount: rsize_t,
        _VarName: *const libc::c_char,
    ) -> errno_t;
}
unsafe extern "C" {
    pub fn getenv(_VarName: *const libc::c_char) -> *mut libc::c_char;
}
unsafe extern "C" {
    pub fn system(_Command: *const libc::c_char) -> libc::c_int;
}
unsafe extern "C" {
    pub fn ecvt(
        _Value: f64,
        _DigitCount: libc::c_int,
        _PtDec: *mut libc::c_int,
        _PtSign: *mut libc::c_int,
    ) -> *mut libc::c_char;
}
unsafe extern "C" {
    pub fn fcvt(
        _Value: f64,
        _FractionalDigitCount: libc::c_int,
        _PtDec: *mut libc::c_int,
        _PtSign: *mut libc::c_int,
    ) -> *mut libc::c_char;
}
unsafe extern "C" {
    pub fn gcvt(
        _Value: f64,
        _DigitCount: libc::c_int,
        _DstBuf: *mut libc::c_char,
    ) -> *mut libc::c_char;
}
unsafe extern "C" {
    pub fn itoa(
        _Value: libc::c_int,
        _Buffer: *mut libc::c_char,
        _Radix: libc::c_int,
    ) -> *mut libc::c_char;
}
unsafe extern "C" {
    pub fn ltoa(
        _Value: libc::c_long,
        _Buffer: *mut libc::c_char,
        _Radix: libc::c_int,
    ) -> *mut libc::c_char;
}
unsafe extern "C" {
    pub fn swab(_Buf1: *mut libc::c_char, _Buf2: *mut libc::c_char, _SizeInBytes: libc::c_int);
}
unsafe extern "C" {
    pub fn ultoa(
        _Value: libc::c_ulong,
        _Buffer: *mut libc::c_char,
        _Radix: libc::c_int,
    ) -> *mut libc::c_char;
}
unsafe extern "C" {
    pub fn putenv(_EnvString: *const libc::c_char) -> libc::c_int;
}
unsafe extern "C" {
    pub fn onexit(_Func: _onexit_t) -> _onexit_t;
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq)]
pub struct _exception {
    pub type_: libc::c_int,
    pub name: *mut libc::c_char,
    pub arg1: f64,
    pub arg2: f64,
    pub retval: f64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _exception"][::core::mem::size_of::<_exception>() - 40usize];
    ["Alignment of _exception"][::core::mem::align_of::<_exception>() - 8usize];
    ["Offset of field: _exception::type_"][::core::mem::offset_of!(_exception, type_) - 0usize];
    ["Offset of field: _exception::name"][::core::mem::offset_of!(_exception, name) - 8usize];
    ["Offset of field: _exception::arg1"][::core::mem::offset_of!(_exception, arg1) - 16usize];
    ["Offset of field: _exception::arg2"][::core::mem::offset_of!(_exception, arg2) - 24usize];
    ["Offset of field: _exception::retval"][::core::mem::offset_of!(_exception, retval) - 32usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq)]
pub struct _complex {
    pub x: f64,
    pub y: f64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _complex"][::core::mem::size_of::<_complex>() - 16usize];
    ["Alignment of _complex"][::core::mem::align_of::<_complex>() - 8usize];
    ["Offset of field: _complex::x"][::core::mem::offset_of!(_complex, x) - 0usize];
    ["Offset of field: _complex::y"][::core::mem::offset_of!(_complex, y) - 8usize];
};
pub type float_t = f32;
pub type double_t = f64;
unsafe extern "C" {
    pub static _HUGE: f64;
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _double_val {
    pub _Sh: [libc::c_ushort; 4usize],
    pub _Val: f64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _double_val"][::core::mem::size_of::<_double_val>() - 8usize];
    ["Alignment of _double_val"][::core::mem::align_of::<_double_val>() - 8usize];
    ["Offset of field: _double_val::_Sh"][::core::mem::offset_of!(_double_val, _Sh) - 0usize];
    ["Offset of field: _double_val::_Val"][::core::mem::offset_of!(_double_val, _Val) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union _float_val {
    pub _Sh: [libc::c_ushort; 2usize],
    pub _Val: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _float_val"][::core::mem::size_of::<_float_val>() - 4usize];
    ["Alignment of _float_val"][::core::mem::align_of::<_float_val>() - 4usize];
    ["Offset of field: _float_val::_Sh"][::core::mem::offset_of!(_float_val, _Sh) - 0usize];
    ["Offset of field: _float_val::_Val"][::core::mem::offset_of!(_float_val, _Val) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union _ldouble_val {
    pub _Sh: [libc::c_ushort; 4usize],
    pub _Val: f64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _ldouble_val"][::core::mem::size_of::<_ldouble_val>() - 8usize];
    ["Alignment of _ldouble_val"][::core::mem::align_of::<_ldouble_val>() - 8usize];
    ["Offset of field: _ldouble_val::_Sh"][::core::mem::offset_of!(_ldouble_val, _Sh) - 0usize];
    ["Offset of field: _ldouble_val::_Val"][::core::mem::offset_of!(_ldouble_val, _Val) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union _float_const {
    pub _Word: [libc::c_ushort; 4usize],
    pub _Float: f32,
    pub _Double: f64,
    pub _Long_double: f64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _float_const"][::core::mem::size_of::<_float_const>() - 8usize];
    ["Alignment of _float_const"][::core::mem::align_of::<_float_const>() - 8usize];
    ["Offset of field: _float_const::_Word"][::core::mem::offset_of!(_float_const, _Word) - 0usize];
    ["Offset of field: _float_const::_Float"]
        [::core::mem::offset_of!(_float_const, _Float) - 0usize];
    ["Offset of field: _float_const::_Double"]
        [::core::mem::offset_of!(_float_const, _Double) - 0usize];
    ["Offset of field: _float_const::_Long_double"]
        [::core::mem::offset_of!(_float_const, _Long_double) - 0usize];
};
unsafe extern "C" {
    pub static _Denorm_C: _float_const;
}
unsafe extern "C" {
    pub static _Inf_C: _float_const;
}
unsafe extern "C" {
    pub static _Nan_C: _float_const;
}
unsafe extern "C" {
    pub static _Snan_C: _float_const;
}
unsafe extern "C" {
    pub static _Hugeval_C: _float_const;
}
unsafe extern "C" {
    pub static _FDenorm_C: _float_const;
}
unsafe extern "C" {
    pub static _FInf_C: _float_const;
}
unsafe extern "C" {
    pub static _FNan_C: _float_const;
}
unsafe extern "C" {
    pub static _FSnan_C: _float_const;
}
unsafe extern "C" {
    pub static _LDenorm_C: _float_const;
}
unsafe extern "C" {
    pub static _LInf_C: _float_const;
}
unsafe extern "C" {
    pub static _LNan_C: _float_const;
}
unsafe extern "C" {
    pub static _LSnan_C: _float_const;
}
unsafe extern "C" {
    pub static _Eps_C: _float_const;
}
unsafe extern "C" {
    pub static _Rteps_C: _float_const;
}
unsafe extern "C" {
    pub static _FEps_C: _float_const;
}
unsafe extern "C" {
    pub static _FRteps_C: _float_const;
}
unsafe extern "C" {
    pub static _LEps_C: _float_const;
}
unsafe extern "C" {
    pub static _LRteps_C: _float_const;
}
unsafe extern "C" {
    pub static _Zero_C: f64;
}
unsafe extern "C" {
    pub static _Xbig_C: f64;
}
unsafe extern "C" {
    pub static _FZero_C: f32;
}
unsafe extern "C" {
    pub static _FXbig_C: f32;
}
unsafe extern "C" {
    pub static _LZero_C: f64;
}
unsafe extern "C" {
    pub static _LXbig_C: f64;
}
unsafe extern "C" {
    pub fn acos(_X: f64) -> f64;
}
unsafe extern "C" {
    pub fn asin(_X: f64) -> f64;
}
unsafe extern "C" {
    pub fn atan(_X: f64) -> f64;
}
unsafe extern "C" {
    pub fn atan2(_Y: f64, _X: f64) -> f64;
}
unsafe extern "C" {
    pub fn cos(_X: f64) -> f64;
}
unsafe extern "C" {
    pub fn cosh(_X: f64) -> f64;
}
unsafe extern "C" {
    pub fn exp(_X: f64) -> f64;
}
unsafe extern "C" {
    pub fn fabs(_X: f64) -> f64;
}
unsafe extern "C" {
    pub fn fmod(_X: f64, _Y: f64) -> f64;
}
unsafe extern "C" {
    pub fn log(_X: f64) -> f64;
}
unsafe extern "C" {
    pub fn log10(_X: f64) -> f64;
}
unsafe extern "C" {
    pub fn pow(_X: f64, _Y: f64) -> f64;
}
unsafe extern "C" {
    pub fn sin(_X: f64) -> f64;
}
unsafe extern "C" {
    pub fn sinh(_X: f64) -> f64;
}
unsafe extern "C" {
    pub fn sqrt(_X: f64) -> f64;
}
unsafe extern "C" {
    pub fn tan(_X: f64) -> f64;
}
unsafe extern "C" {
    pub fn tanh(_X: f64) -> f64;
}
unsafe extern "C" {
    pub fn acosh(_X: f64) -> f64;
}
unsafe extern "C" {
    pub fn asinh(_X: f64) -> f64;
}
unsafe extern "C" {
    pub fn atanh(_X: f64) -> f64;
}
unsafe extern "C" {
    pub fn cbrt(_X: f64) -> f64;
}
unsafe extern "C" {
    pub fn ceil(_X: f64) -> f64;
}
unsafe extern "C" {
    pub fn copysign(_Number: f64, _Sign: f64) -> f64;
}
unsafe extern "C" {
    pub fn erf(_X: f64) -> f64;
}
unsafe extern "C" {
    pub fn erfc(_X: f64) -> f64;
}
unsafe extern "C" {
    pub fn exp2(_X: f64) -> f64;
}
unsafe extern "C" {
    pub fn expm1(_X: f64) -> f64;
}
unsafe extern "C" {
    pub fn fdim(_X: f64, _Y: f64) -> f64;
}
unsafe extern "C" {
    pub fn floor(_X: f64) -> f64;
}
unsafe extern "C" {
    pub fn fma(_X: f64, _Y: f64, _Z: f64) -> f64;
}
unsafe extern "C" {
    pub fn fmax(_X: f64, _Y: f64) -> f64;
}
unsafe extern "C" {
    pub fn fmin(_X: f64, _Y: f64) -> f64;
}
unsafe extern "C" {
    pub fn frexp(_X: f64, _Y: *mut libc::c_int) -> f64;
}
unsafe extern "C" {
    pub fn hypot(_X: f64, _Y: f64) -> f64;
}
unsafe extern "C" {
    pub fn ilogb(_X: f64) -> libc::c_int;
}
unsafe extern "C" {
    pub fn ldexp(_X: f64, _Y: libc::c_int) -> f64;
}
unsafe extern "C" {
    pub fn lgamma(_X: f64) -> f64;
}
unsafe extern "C" {
    pub fn llrint(_X: f64) -> libc::c_longlong;
}
unsafe extern "C" {
    pub fn llround(_X: f64) -> libc::c_longlong;
}
unsafe extern "C" {
    pub fn log1p(_X: f64) -> f64;
}
unsafe extern "C" {
    pub fn log2(_X: f64) -> f64;
}
unsafe extern "C" {
    pub fn logb(_X: f64) -> f64;
}
unsafe extern "C" {
    pub fn lrint(_X: f64) -> libc::c_long;
}
unsafe extern "C" {
    pub fn lround(_X: f64) -> libc::c_long;
}
unsafe extern "C" {
    pub fn modf(_X: f64, _Y: *mut f64) -> f64;
}
unsafe extern "C" {
    pub fn nan(_X: *const libc::c_char) -> f64;
}
unsafe extern "C" {
    pub fn nearbyint(_X: f64) -> f64;
}
unsafe extern "C" {
    pub fn nextafter(_X: f64, _Y: f64) -> f64;
}
unsafe extern "C" {
    pub fn remainder(_X: f64, _Y: f64) -> f64;
}
unsafe extern "C" {
    pub fn remquo(_X: f64, _Y: f64, _Z: *mut libc::c_int) -> f64;
}
unsafe extern "C" {
    pub fn rint(_X: f64) -> f64;
}
unsafe extern "C" {
    pub fn round(_X: f64) -> f64;
}
unsafe extern "C" {
    pub fn scalbln(_X: f64, _Y: libc::c_long) -> f64;
}
unsafe extern "C" {
    pub fn scalbn(_X: f64, _Y: libc::c_int) -> f64;
}
unsafe extern "C" {
    pub fn tgamma(_X: f64) -> f64;
}
unsafe extern "C" {
    pub fn trunc(_X: f64) -> f64;
}
unsafe extern "C" {
    pub fn acoshf(_X: f32) -> f32;
}
unsafe extern "C" {
    pub fn asinhf(_X: f32) -> f32;
}
unsafe extern "C" {
    pub fn atanhf(_X: f32) -> f32;
}
unsafe extern "C" {
    pub fn cbrtf(_X: f32) -> f32;
}
unsafe extern "C" {
    pub fn copysignf(_Number: f32, _Sign: f32) -> f32;
}
unsafe extern "C" {
    pub fn erff(_X: f32) -> f32;
}
unsafe extern "C" {
    pub fn erfcf(_X: f32) -> f32;
}
unsafe extern "C" {
    pub fn expm1f(_X: f32) -> f32;
}
unsafe extern "C" {
    pub fn exp2f(_X: f32) -> f32;
}
unsafe extern "C" {
    pub fn fdimf(_X: f32, _Y: f32) -> f32;
}
unsafe extern "C" {
    pub fn fmaf(_X: f32, _Y: f32, _Z: f32) -> f32;
}
unsafe extern "C" {
    pub fn fmaxf(_X: f32, _Y: f32) -> f32;
}
unsafe extern "C" {
    pub fn fminf(_X: f32, _Y: f32) -> f32;
}
unsafe extern "C" {
    pub fn ilogbf(_X: f32) -> libc::c_int;
}
unsafe extern "C" {
    pub fn lgammaf(_X: f32) -> f32;
}
unsafe extern "C" {
    pub fn llrintf(_X: f32) -> libc::c_longlong;
}
unsafe extern "C" {
    pub fn llroundf(_X: f32) -> libc::c_longlong;
}
unsafe extern "C" {
    pub fn log1pf(_X: f32) -> f32;
}
unsafe extern "C" {
    pub fn log2f(_X: f32) -> f32;
}
unsafe extern "C" {
    pub fn logbf(_X: f32) -> f32;
}
unsafe extern "C" {
    pub fn lrintf(_X: f32) -> libc::c_long;
}
unsafe extern "C" {
    pub fn lroundf(_X: f32) -> libc::c_long;
}
unsafe extern "C" {
    pub fn nanf(_X: *const libc::c_char) -> f32;
}
unsafe extern "C" {
    pub fn nearbyintf(_X: f32) -> f32;
}
unsafe extern "C" {
    pub fn nextafterf(_X: f32, _Y: f32) -> f32;
}
unsafe extern "C" {
    pub fn remainderf(_X: f32, _Y: f32) -> f32;
}
unsafe extern "C" {
    pub fn remquof(_X: f32, _Y: f32, _Z: *mut libc::c_int) -> f32;
}
unsafe extern "C" {
    pub fn rintf(_X: f32) -> f32;
}
unsafe extern "C" {
    pub fn roundf(_X: f32) -> f32;
}
unsafe extern "C" {
    pub fn scalblnf(_X: f32, _Y: libc::c_long) -> f32;
}
unsafe extern "C" {
    pub fn scalbnf(_X: f32, _Y: libc::c_int) -> f32;
}
unsafe extern "C" {
    pub fn tgammaf(_X: f32) -> f32;
}
unsafe extern "C" {
    pub fn truncf(_X: f32) -> f32;
}
unsafe extern "C" {
    pub fn acosf(_X: f32) -> f32;
}
unsafe extern "C" {
    pub fn asinf(_X: f32) -> f32;
}
unsafe extern "C" {
    pub fn atan2f(_Y: f32, _X: f32) -> f32;
}
unsafe extern "C" {
    pub fn atanf(_X: f32) -> f32;
}
unsafe extern "C" {
    pub fn ceilf(_X: f32) -> f32;
}
unsafe extern "C" {
    pub fn cosf(_X: f32) -> f32;
}
unsafe extern "C" {
    pub fn coshf(_X: f32) -> f32;
}
unsafe extern "C" {
    pub fn expf(_X: f32) -> f32;
}
unsafe extern "C" {
    pub fn floorf(_X: f32) -> f32;
}
unsafe extern "C" {
    pub fn fmodf(_X: f32, _Y: f32) -> f32;
}
unsafe extern "C" {
    pub fn log10f(_X: f32) -> f32;
}
unsafe extern "C" {
    pub fn logf(_X: f32) -> f32;
}
unsafe extern "C" {
    pub fn modff(_X: f32, _Y: *mut f32) -> f32;
}
unsafe extern "C" {
    pub fn powf(_X: f32, _Y: f32) -> f32;
}
unsafe extern "C" {
    pub fn sinf(_X: f32) -> f32;
}
unsafe extern "C" {
    pub fn sinhf(_X: f32) -> f32;
}
unsafe extern "C" {
    pub fn sqrtf(_X: f32) -> f32;
}
unsafe extern "C" {
    pub fn tanf(_X: f32) -> f32;
}
unsafe extern "C" {
    pub fn tanhf(_X: f32) -> f32;
}
unsafe extern "C" {
    pub static mut HUGE: f64;
}
unsafe extern "C" {
    pub fn j0(_X: f64) -> f64;
}
unsafe extern "C" {
    pub fn j1(_X: f64) -> f64;
}
unsafe extern "C" {
    pub fn jn(_X: libc::c_int, _Y: f64) -> f64;
}
unsafe extern "C" {
    pub fn y0(_X: f64) -> f64;
}
unsafe extern "C" {
    pub fn y1(_X: f64) -> f64;
}
unsafe extern "C" {
    pub fn yn(_X: libc::c_int, _Y: f64) -> f64;
}
pub type _ino_t = libc::c_ushort;
pub type ino_t = _ino_t;
pub type _dev_t = libc::c_uint;
pub type dev_t = _dev_t;
pub type _off_t = libc::c_long;
pub type off_t = _off_t;
unsafe extern "C" {
    pub fn wcscat_s(
        _Destination: *mut wchar_t,
        _SizeInWords: rsize_t,
        _Source: *const wchar_t,
    ) -> errno_t;
}
unsafe extern "C" {
    pub fn wcscpy_s(
        _Destination: *mut wchar_t,
        _SizeInWords: rsize_t,
        _Source: *const wchar_t,
    ) -> errno_t;
}
unsafe extern "C" {
    pub fn wcsncat_s(
        _Destination: *mut wchar_t,
        _SizeInWords: rsize_t,
        _Source: *const wchar_t,
        _MaxCount: rsize_t,
    ) -> errno_t;
}
unsafe extern "C" {
    pub fn wcsncpy_s(
        _Destination: *mut wchar_t,
        _SizeInWords: rsize_t,
        _Source: *const wchar_t,
        _MaxCount: rsize_t,
    ) -> errno_t;
}
unsafe extern "C" {
    pub fn wcstok_s(
        _String: *mut wchar_t,
        _Delimiter: *const wchar_t,
        _Context: *mut *mut wchar_t,
    ) -> *mut wchar_t;
}
unsafe extern "C" {
    pub fn wcscat(_Destination: *mut wchar_t, _Source: *const wchar_t) -> *mut wchar_t;
}
unsafe extern "C" {
    pub fn wcscmp(_String1: *const libc::c_ushort, _String2: *const libc::c_ushort) -> libc::c_int;
}
unsafe extern "C" {
    pub fn wcscpy(_Destination: *mut wchar_t, _Source: *const wchar_t) -> *mut wchar_t;
}
unsafe extern "C" {
    pub fn wcscspn(_String: *const wchar_t, _Control: *const wchar_t) -> usize;
}
unsafe extern "C" {
    pub fn wcslen(_String: *const libc::c_ushort) -> libc::c_ulonglong;
}
unsafe extern "C" {
    pub fn wcsnlen(_Source: *const wchar_t, _MaxCount: usize) -> usize;
}
unsafe extern "C" {
    pub fn wcsncat(
        _Destination: *mut wchar_t,
        _Source: *const wchar_t,
        _Count: usize,
    ) -> *mut wchar_t;
}
unsafe extern "C" {
    pub fn wcsncmp(
        _String1: *const libc::c_ushort,
        _String2: *const libc::c_ushort,
        _MaxCount: libc::c_ulonglong,
    ) -> libc::c_int;
}
unsafe extern "C" {
    pub fn wcsncpy(
        _Destination: *mut wchar_t,
        _Source: *const wchar_t,
        _Count: usize,
    ) -> *mut wchar_t;
}
unsafe extern "C" {
    pub fn wcspbrk(_String: *const wchar_t, _Control: *const wchar_t) -> *mut wchar_t;
}
unsafe extern "C" {
    pub fn wcsspn(_String: *const wchar_t, _Control: *const wchar_t) -> usize;
}
unsafe extern "C" {
    pub fn wcstok(
        _String: *mut wchar_t,
        _Delimiter: *const wchar_t,
        _Context: *mut *mut wchar_t,
    ) -> *mut wchar_t;
}
unsafe extern "C" {
    pub fn wcsxfrm(_Destination: *mut wchar_t, _Source: *const wchar_t, _MaxCount: usize) -> usize;
}
unsafe extern "C" {
    pub fn wcscoll(_String1: *const wchar_t, _String2: *const wchar_t) -> libc::c_int;
}
unsafe extern "C" {
    pub fn wcsdup(_String: *const wchar_t) -> *mut wchar_t;
}
unsafe extern "C" {
    pub fn wcsicmp(_String1: *const wchar_t, _String2: *const wchar_t) -> libc::c_int;
}
unsafe extern "C" {
    pub fn wcsnicmp(
        _String1: *const wchar_t,
        _String2: *const wchar_t,
        _MaxCount: usize,
    ) -> libc::c_int;
}
unsafe extern "C" {
    pub fn wcsnset(_String: *mut wchar_t, _Value: wchar_t, _MaxCount: usize) -> *mut wchar_t;
}
unsafe extern "C" {
    pub fn wcsrev(_String: *mut wchar_t) -> *mut wchar_t;
}
unsafe extern "C" {
    pub fn wcsset(_String: *mut wchar_t, _Value: wchar_t) -> *mut wchar_t;
}
unsafe extern "C" {
    pub fn wcslwr(_String: *mut wchar_t) -> *mut wchar_t;
}
unsafe extern "C" {
    pub fn wcsupr(_String: *mut wchar_t) -> *mut wchar_t;
}
unsafe extern "C" {
    pub fn wcsicoll(_String1: *const wchar_t, _String2: *const wchar_t) -> libc::c_int;
}
unsafe extern "C" {
    pub fn strcpy_s(
        _Destination: *mut libc::c_char,
        _SizeInBytes: rsize_t,
        _Source: *const libc::c_char,
    ) -> errno_t;
}
unsafe extern "C" {
    pub fn strcat_s(
        _Destination: *mut libc::c_char,
        _SizeInBytes: rsize_t,
        _Source: *const libc::c_char,
    ) -> errno_t;
}
unsafe extern "C" {
    pub fn strerror_s(
        _Buffer: *mut libc::c_char,
        _SizeInBytes: usize,
        _ErrorNumber: libc::c_int,
    ) -> errno_t;
}
unsafe extern "C" {
    pub fn strncat_s(
        _Destination: *mut libc::c_char,
        _SizeInBytes: rsize_t,
        _Source: *const libc::c_char,
        _MaxCount: rsize_t,
    ) -> errno_t;
}
unsafe extern "C" {
    pub fn strncpy_s(
        _Destination: *mut libc::c_char,
        _SizeInBytes: rsize_t,
        _Source: *const libc::c_char,
        _MaxCount: rsize_t,
    ) -> errno_t;
}
unsafe extern "C" {
    pub fn strtok_s(
        _String: *mut libc::c_char,
        _Delimiter: *const libc::c_char,
        _Context: *mut *mut libc::c_char,
    ) -> *mut libc::c_char;
}
unsafe extern "C" {
    pub fn strcat(
        _Destination: *mut libc::c_char,
        _Source: *const libc::c_char,
    ) -> *mut libc::c_char;
}
unsafe extern "C" {
    pub fn strcmp(_Str1: *const libc::c_char, _Str2: *const libc::c_char) -> libc::c_int;
}
unsafe extern "C" {
    pub fn strcoll(_String1: *const libc::c_char, _String2: *const libc::c_char) -> libc::c_int;
}
unsafe extern "C" {
    pub fn strcpy(
        _Destination: *mut libc::c_char,
        _Source: *const libc::c_char,
    ) -> *mut libc::c_char;
}
unsafe extern "C" {
    pub fn strcspn(_Str: *const libc::c_char, _Control: *const libc::c_char) -> libc::c_ulonglong;
}
unsafe extern "C" {
    pub fn strerror(_ErrorMessage: libc::c_int) -> *mut libc::c_char;
}
unsafe extern "C" {
    pub fn strlen(_Str: *const libc::c_char) -> libc::c_ulonglong;
}
unsafe extern "C" {
    pub fn strncat(
        _Destination: *mut libc::c_char,
        _Source: *const libc::c_char,
        _Count: libc::c_ulonglong,
    ) -> *mut libc::c_char;
}
unsafe extern "C" {
    pub fn strncmp(
        _Str1: *const libc::c_char,
        _Str2: *const libc::c_char,
        _MaxCount: libc::c_ulonglong,
    ) -> libc::c_int;
}
unsafe extern "C" {
    pub fn strncpy(
        _Destination: *mut libc::c_char,
        _Source: *const libc::c_char,
        _Count: libc::c_ulonglong,
    ) -> *mut libc::c_char;
}
unsafe extern "C" {
    pub fn strnlen(_String: *const libc::c_char, _MaxCount: usize) -> usize;
}
unsafe extern "C" {
    pub fn strpbrk(_Str: *const libc::c_char, _Control: *const libc::c_char) -> *mut libc::c_char;
}
unsafe extern "C" {
    pub fn strspn(_Str: *const libc::c_char, _Control: *const libc::c_char) -> libc::c_ulonglong;
}
unsafe extern "C" {
    pub fn strtok(_String: *mut libc::c_char, _Delimiter: *const libc::c_char)
        -> *mut libc::c_char;
}
unsafe extern "C" {
    pub fn strxfrm(
        _Destination: *mut libc::c_char,
        _Source: *const libc::c_char,
        _MaxCount: libc::c_ulonglong,
    ) -> libc::c_ulonglong;
}
unsafe extern "C" {
    pub fn strdup(_String: *const libc::c_char) -> *mut libc::c_char;
}
unsafe extern "C" {
    pub fn strcmpi(_String1: *const libc::c_char, _String2: *const libc::c_char) -> libc::c_int;
}
unsafe extern "C" {
    pub fn stricmp(_String1: *const libc::c_char, _String2: *const libc::c_char) -> libc::c_int;
}
unsafe extern "C" {
    pub fn strlwr(_String: *mut libc::c_char) -> *mut libc::c_char;
}
unsafe extern "C" {
    pub fn strnicmp(
        _String1: *const libc::c_char,
        _String2: *const libc::c_char,
        _MaxCount: usize,
    ) -> libc::c_int;
}
unsafe extern "C" {
    pub fn strnset(
        _String: *mut libc::c_char,
        _Value: libc::c_int,
        _MaxCount: usize,
    ) -> *mut libc::c_char;
}
unsafe extern "C" {
    pub fn strrev(_String: *mut libc::c_char) -> *mut libc::c_char;
}
unsafe extern "C" {
    pub fn strset(_String: *mut libc::c_char, _Value: libc::c_int) -> *mut libc::c_char;
}
unsafe extern "C" {
    pub fn strupr(_String: *mut libc::c_char) -> *mut libc::c_char;
}
pub type int_least8_t = libc::c_schar;
pub type int_least16_t = libc::c_short;
pub type int_least32_t = libc::c_int;
pub type int_least64_t = libc::c_longlong;
pub type uint_least8_t = libc::c_uchar;
pub type uint_least16_t = libc::c_ushort;
pub type uint_least32_t = libc::c_uint;
pub type uint_least64_t = libc::c_ulonglong;
pub type int_fast8_t = libc::c_schar;
pub type int_fast16_t = libc::c_int;
pub type int_fast32_t = libc::c_int;
pub type int_fast64_t = libc::c_longlong;
pub type uint_fast8_t = libc::c_uchar;
pub type uint_fast16_t = libc::c_uint;
pub type uint_fast32_t = libc::c_uint;
pub type uint_fast64_t = libc::c_ulonglong;
pub type intmax_t = libc::c_longlong;
pub type uintmax_t = libc::c_ulonglong;
pub const LibRaw_openbayer_patterns_LIBRAW_OPENBAYER_RGGB: LibRaw_openbayer_patterns = 148;
pub const LibRaw_openbayer_patterns_LIBRAW_OPENBAYER_BGGR: LibRaw_openbayer_patterns = 22;
pub const LibRaw_openbayer_patterns_LIBRAW_OPENBAYER_GRBG: LibRaw_openbayer_patterns = 97;
pub const LibRaw_openbayer_patterns_LIBRAW_OPENBAYER_GBRG: LibRaw_openbayer_patterns = 73;
pub type LibRaw_openbayer_patterns = libc::c_int;
pub const LibRaw_dngfields_marks_LIBRAW_DNGFM_FORWARDMATRIX: LibRaw_dngfields_marks = 1;
pub const LibRaw_dngfields_marks_LIBRAW_DNGFM_ILLUMINANT: LibRaw_dngfields_marks = 2;
pub const LibRaw_dngfields_marks_LIBRAW_DNGFM_COLORMATRIX: LibRaw_dngfields_marks = 4;
pub const LibRaw_dngfields_marks_LIBRAW_DNGFM_CALIBRATION: LibRaw_dngfields_marks = 8;
pub const LibRaw_dngfields_marks_LIBRAW_DNGFM_ANALOGBALANCE: LibRaw_dngfields_marks = 16;
pub const LibRaw_dngfields_marks_LIBRAW_DNGFM_BLACK: LibRaw_dngfields_marks = 32;
pub const LibRaw_dngfields_marks_LIBRAW_DNGFM_WHITE: LibRaw_dngfields_marks = 64;
pub const LibRaw_dngfields_marks_LIBRAW_DNGFM_OPCODE2: LibRaw_dngfields_marks = 128;
pub const LibRaw_dngfields_marks_LIBRAW_DNGFM_LINTABLE: LibRaw_dngfields_marks = 256;
pub const LibRaw_dngfields_marks_LIBRAW_DNGFM_CROPORIGIN: LibRaw_dngfields_marks = 512;
pub const LibRaw_dngfields_marks_LIBRAW_DNGFM_CROPSIZE: LibRaw_dngfields_marks = 1024;
pub const LibRaw_dngfields_marks_LIBRAW_DNGFM_PREVIEWCS: LibRaw_dngfields_marks = 2048;
pub const LibRaw_dngfields_marks_LIBRAW_DNGFM_ASSHOTNEUTRAL: LibRaw_dngfields_marks = 4096;
pub const LibRaw_dngfields_marks_LIBRAW_DNGFM_BASELINEEXPOSURE: LibRaw_dngfields_marks = 8192;
pub const LibRaw_dngfields_marks_LIBRAW_DNGFM_LINEARRESPONSELIMIT: LibRaw_dngfields_marks = 16384;
pub const LibRaw_dngfields_marks_LIBRAW_DNGFM_USERCROP: LibRaw_dngfields_marks = 32768;
pub const LibRaw_dngfields_marks_LIBRAW_DNGFM_OPCODE1: LibRaw_dngfields_marks = 65536;
pub const LibRaw_dngfields_marks_LIBRAW_DNGFM_OPCODE3: LibRaw_dngfields_marks = 131072;
pub type LibRaw_dngfields_marks = libc::c_int;
pub const LibRaw_As_Shot_WB_Applied_codes_LIBRAW_ASWB_APPLIED: LibRaw_As_Shot_WB_Applied_codes = 1;
pub const LibRaw_As_Shot_WB_Applied_codes_LIBRAW_ASWB_CANON: LibRaw_As_Shot_WB_Applied_codes = 2;
pub const LibRaw_As_Shot_WB_Applied_codes_LIBRAW_ASWB_NIKON: LibRaw_As_Shot_WB_Applied_codes = 4;
pub const LibRaw_As_Shot_WB_Applied_codes_LIBRAW_ASWB_NIKON_SRAW: LibRaw_As_Shot_WB_Applied_codes =
    8;
pub const LibRaw_As_Shot_WB_Applied_codes_LIBRAW_ASWB_PENTAX: LibRaw_As_Shot_WB_Applied_codes = 16;
pub type LibRaw_As_Shot_WB_Applied_codes = libc::c_int;
pub const LibRaw_ExifTagTypes_LIBRAW_EXIFTAG_TYPE_UNKNOWN: LibRaw_ExifTagTypes = 0;
pub const LibRaw_ExifTagTypes_LIBRAW_EXIFTAG_TYPE_BYTE: LibRaw_ExifTagTypes = 1;
pub const LibRaw_ExifTagTypes_LIBRAW_EXIFTAG_TYPE_ASCII: LibRaw_ExifTagTypes = 2;
pub const LibRaw_ExifTagTypes_LIBRAW_EXIFTAG_TYPE_SHORT: LibRaw_ExifTagTypes = 3;
pub const LibRaw_ExifTagTypes_LIBRAW_EXIFTAG_TYPE_LONG: LibRaw_ExifTagTypes = 4;
pub const LibRaw_ExifTagTypes_LIBRAW_EXIFTAG_TYPE_RATIONAL: LibRaw_ExifTagTypes = 5;
pub const LibRaw_ExifTagTypes_LIBRAW_EXIFTAG_TYPE_SBYTE: LibRaw_ExifTagTypes = 6;
pub const LibRaw_ExifTagTypes_LIBRAW_EXIFTAG_TYPE_UNDEFINED: LibRaw_ExifTagTypes = 7;
pub const LibRaw_ExifTagTypes_LIBRAW_EXIFTAG_TYPE_SSHORT: LibRaw_ExifTagTypes = 8;
pub const LibRaw_ExifTagTypes_LIBRAW_EXIFTAG_TYPE_SLONG: LibRaw_ExifTagTypes = 9;
pub const LibRaw_ExifTagTypes_LIBRAW_EXIFTAG_TYPE_SRATIONAL: LibRaw_ExifTagTypes = 10;
pub const LibRaw_ExifTagTypes_LIBRAW_EXIFTAG_TYPE_FLOAT: LibRaw_ExifTagTypes = 11;
pub const LibRaw_ExifTagTypes_LIBRAW_EXIFTAG_TYPE_DOUBLE: LibRaw_ExifTagTypes = 12;
pub const LibRaw_ExifTagTypes_LIBRAW_EXIFTAG_TYPE_IFD: LibRaw_ExifTagTypes = 13;
pub const LibRaw_ExifTagTypes_LIBRAW_EXIFTAG_TYPE_UNICODE: LibRaw_ExifTagTypes = 14;
pub const LibRaw_ExifTagTypes_LIBRAW_EXIFTAG_TYPE_COMPLEX: LibRaw_ExifTagTypes = 15;
pub const LibRaw_ExifTagTypes_LIBRAW_EXIFTAG_TYPE_LONG8: LibRaw_ExifTagTypes = 16;
pub const LibRaw_ExifTagTypes_LIBRAW_EXIFTAG_TYPE_SLONG8: LibRaw_ExifTagTypes = 17;
pub const LibRaw_ExifTagTypes_LIBRAW_EXIFTAG_TYPE_IFD8: LibRaw_ExifTagTypes = 18;
pub type LibRaw_ExifTagTypes = libc::c_int;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_Unknown: LibRaw_whitebalance_code = 0;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_Daylight: LibRaw_whitebalance_code = 1;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_Fluorescent: LibRaw_whitebalance_code = 2;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_Tungsten: LibRaw_whitebalance_code = 3;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_Flash: LibRaw_whitebalance_code = 4;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_FineWeather: LibRaw_whitebalance_code = 9;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_Cloudy: LibRaw_whitebalance_code = 10;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_Shade: LibRaw_whitebalance_code = 11;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_FL_D: LibRaw_whitebalance_code = 12;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_FL_N: LibRaw_whitebalance_code = 13;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_FL_W: LibRaw_whitebalance_code = 14;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_FL_WW: LibRaw_whitebalance_code = 15;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_FL_L: LibRaw_whitebalance_code = 16;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_Ill_A: LibRaw_whitebalance_code = 17;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_Ill_B: LibRaw_whitebalance_code = 18;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_Ill_C: LibRaw_whitebalance_code = 19;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_D55: LibRaw_whitebalance_code = 20;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_D65: LibRaw_whitebalance_code = 21;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_D75: LibRaw_whitebalance_code = 22;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_D50: LibRaw_whitebalance_code = 23;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_StudioTungsten: LibRaw_whitebalance_code = 24;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_Sunset: LibRaw_whitebalance_code = 64;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_Underwater: LibRaw_whitebalance_code = 65;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_FluorescentHigh: LibRaw_whitebalance_code = 66;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_HT_Mercury: LibRaw_whitebalance_code = 67;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_AsShot: LibRaw_whitebalance_code = 81;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_Auto: LibRaw_whitebalance_code = 82;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_Custom: LibRaw_whitebalance_code = 83;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_Auto1: LibRaw_whitebalance_code = 85;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_Auto2: LibRaw_whitebalance_code = 86;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_Auto3: LibRaw_whitebalance_code = 87;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_Auto4: LibRaw_whitebalance_code = 88;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_Custom1: LibRaw_whitebalance_code = 90;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_Custom2: LibRaw_whitebalance_code = 91;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_Custom3: LibRaw_whitebalance_code = 92;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_Custom4: LibRaw_whitebalance_code = 93;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_Custom5: LibRaw_whitebalance_code = 94;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_Custom6: LibRaw_whitebalance_code = 95;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_PC_Set1: LibRaw_whitebalance_code = 96;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_PC_Set2: LibRaw_whitebalance_code = 97;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_PC_Set3: LibRaw_whitebalance_code = 98;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_PC_Set4: LibRaw_whitebalance_code = 99;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_PC_Set5: LibRaw_whitebalance_code = 100;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_Measured: LibRaw_whitebalance_code = 110;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_BW: LibRaw_whitebalance_code = 120;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_Kelvin: LibRaw_whitebalance_code = 254;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_Other: LibRaw_whitebalance_code = 255;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_None: LibRaw_whitebalance_code = 65535;
pub type LibRaw_whitebalance_code = libc::c_int;
pub const LibRaw_MultiExposure_related_LIBRAW_ME_NONE: LibRaw_MultiExposure_related = 0;
pub const LibRaw_MultiExposure_related_LIBRAW_ME_SIMPLE: LibRaw_MultiExposure_related = 1;
pub const LibRaw_MultiExposure_related_LIBRAW_ME_OVERLAY: LibRaw_MultiExposure_related = 2;
pub const LibRaw_MultiExposure_related_LIBRAW_ME_HDR: LibRaw_MultiExposure_related = 3;
pub type LibRaw_MultiExposure_related = libc::c_int;
pub const LibRaw_dng_processing_LIBRAW_DNG_NONE: LibRaw_dng_processing = 0;
pub const LibRaw_dng_processing_LIBRAW_DNG_FLOAT: LibRaw_dng_processing = 1;
pub const LibRaw_dng_processing_LIBRAW_DNG_LINEAR: LibRaw_dng_processing = 2;
pub const LibRaw_dng_processing_LIBRAW_DNG_DEFLATE: LibRaw_dng_processing = 4;
pub const LibRaw_dng_processing_LIBRAW_DNG_XTRANS: LibRaw_dng_processing = 8;
pub const LibRaw_dng_processing_LIBRAW_DNG_OTHER: LibRaw_dng_processing = 16;
pub const LibRaw_dng_processing_LIBRAW_DNG_8BIT: LibRaw_dng_processing = 32;
pub const LibRaw_dng_processing_LIBRAW_DNG_ALL: LibRaw_dng_processing = 63;
pub const LibRaw_dng_processing_LIBRAW_DNG_DEFAULT: LibRaw_dng_processing = 39;
pub type LibRaw_dng_processing = libc::c_int;
pub const LibRaw_output_flags_LIBRAW_OUTPUT_FLAGS_NONE: LibRaw_output_flags = 0;
pub const LibRaw_output_flags_LIBRAW_OUTPUT_FLAGS_PPMMETA: LibRaw_output_flags = 1;
pub type LibRaw_output_flags = libc::c_int;
pub const LibRaw_runtime_capabilities_LIBRAW_CAPS_RAWSPEED: LibRaw_runtime_capabilities = 1;
pub const LibRaw_runtime_capabilities_LIBRAW_CAPS_DNGSDK: LibRaw_runtime_capabilities = 2;
pub const LibRaw_runtime_capabilities_LIBRAW_CAPS_GPRSDK: LibRaw_runtime_capabilities = 4;
pub const LibRaw_runtime_capabilities_LIBRAW_CAPS_UNICODEPATHS: LibRaw_runtime_capabilities = 8;
pub const LibRaw_runtime_capabilities_LIBRAW_CAPS_X3FTOOLS: LibRaw_runtime_capabilities = 16;
pub const LibRaw_runtime_capabilities_LIBRAW_CAPS_RPI6BY9: LibRaw_runtime_capabilities = 32;
pub const LibRaw_runtime_capabilities_LIBRAW_CAPS_ZLIB: LibRaw_runtime_capabilities = 64;
pub const LibRaw_runtime_capabilities_LIBRAW_CAPS_JPEG: LibRaw_runtime_capabilities = 128;
pub const LibRaw_runtime_capabilities_LIBRAW_CAPS_RAWSPEED3: LibRaw_runtime_capabilities = 256;
pub const LibRaw_runtime_capabilities_LIBRAW_CAPS_RAWSPEED_BITS: LibRaw_runtime_capabilities = 512;
pub type LibRaw_runtime_capabilities = libc::c_int;
pub const LibRaw_colorspace_LIBRAW_COLORSPACE_NotFound: LibRaw_colorspace = 0;
pub const LibRaw_colorspace_LIBRAW_COLORSPACE_sRGB: LibRaw_colorspace = 1;
pub const LibRaw_colorspace_LIBRAW_COLORSPACE_AdobeRGB: LibRaw_colorspace = 2;
pub const LibRaw_colorspace_LIBRAW_COLORSPACE_WideGamutRGB: LibRaw_colorspace = 3;
pub const LibRaw_colorspace_LIBRAW_COLORSPACE_ProPhotoRGB: LibRaw_colorspace = 4;
pub const LibRaw_colorspace_LIBRAW_COLORSPACE_ICC: LibRaw_colorspace = 5;
pub const LibRaw_colorspace_LIBRAW_COLORSPACE_Uncalibrated: LibRaw_colorspace = 6;
pub const LibRaw_colorspace_LIBRAW_COLORSPACE_CameraLinearUniWB: LibRaw_colorspace = 7;
pub const LibRaw_colorspace_LIBRAW_COLORSPACE_CameraLinear: LibRaw_colorspace = 8;
pub const LibRaw_colorspace_LIBRAW_COLORSPACE_CameraGammaUniWB: LibRaw_colorspace = 9;
pub const LibRaw_colorspace_LIBRAW_COLORSPACE_CameraGamma: LibRaw_colorspace = 10;
pub const LibRaw_colorspace_LIBRAW_COLORSPACE_MonochromeLinear: LibRaw_colorspace = 11;
pub const LibRaw_colorspace_LIBRAW_COLORSPACE_MonochromeGamma: LibRaw_colorspace = 12;
pub const LibRaw_colorspace_LIBRAW_COLORSPACE_Unknown: LibRaw_colorspace = 255;
pub type LibRaw_colorspace = libc::c_int;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Unknown: LibRaw_cameramaker_index = 0;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Agfa: LibRaw_cameramaker_index = 1;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Alcatel: LibRaw_cameramaker_index = 2;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Apple: LibRaw_cameramaker_index = 3;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Aptina: LibRaw_cameramaker_index = 4;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_AVT: LibRaw_cameramaker_index = 5;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Baumer: LibRaw_cameramaker_index = 6;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Broadcom: LibRaw_cameramaker_index = 7;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Canon: LibRaw_cameramaker_index = 8;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Casio: LibRaw_cameramaker_index = 9;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_CINE: LibRaw_cameramaker_index = 10;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Clauss: LibRaw_cameramaker_index = 11;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Contax: LibRaw_cameramaker_index = 12;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Creative: LibRaw_cameramaker_index = 13;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_DJI: LibRaw_cameramaker_index = 14;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_DXO: LibRaw_cameramaker_index = 15;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Epson: LibRaw_cameramaker_index = 16;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Foculus: LibRaw_cameramaker_index = 17;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Fujifilm: LibRaw_cameramaker_index = 18;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Generic: LibRaw_cameramaker_index = 19;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Gione: LibRaw_cameramaker_index = 20;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_GITUP: LibRaw_cameramaker_index = 21;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Google: LibRaw_cameramaker_index = 22;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_GoPro: LibRaw_cameramaker_index = 23;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Hasselblad: LibRaw_cameramaker_index = 24;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_HTC: LibRaw_cameramaker_index = 25;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_I_Mobile: LibRaw_cameramaker_index = 26;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Imacon: LibRaw_cameramaker_index = 27;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_JK_Imaging: LibRaw_cameramaker_index = 28;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Kodak: LibRaw_cameramaker_index = 29;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Konica: LibRaw_cameramaker_index = 30;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Leaf: LibRaw_cameramaker_index = 31;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Leica: LibRaw_cameramaker_index = 32;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Lenovo: LibRaw_cameramaker_index = 33;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_LG: LibRaw_cameramaker_index = 34;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Logitech: LibRaw_cameramaker_index = 35;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Mamiya: LibRaw_cameramaker_index = 36;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Matrix: LibRaw_cameramaker_index = 37;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Meizu: LibRaw_cameramaker_index = 38;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Micron: LibRaw_cameramaker_index = 39;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Minolta: LibRaw_cameramaker_index = 40;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Motorola: LibRaw_cameramaker_index = 41;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_NGM: LibRaw_cameramaker_index = 42;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Nikon: LibRaw_cameramaker_index = 43;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Nokia: LibRaw_cameramaker_index = 44;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Olympus: LibRaw_cameramaker_index = 45;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_OmniVison: LibRaw_cameramaker_index = 46;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Panasonic: LibRaw_cameramaker_index = 47;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Parrot: LibRaw_cameramaker_index = 48;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Pentax: LibRaw_cameramaker_index = 49;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_PhaseOne: LibRaw_cameramaker_index = 50;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_PhotoControl: LibRaw_cameramaker_index = 51;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Photron: LibRaw_cameramaker_index = 52;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Pixelink: LibRaw_cameramaker_index = 53;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Polaroid: LibRaw_cameramaker_index = 54;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_RED: LibRaw_cameramaker_index = 55;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Ricoh: LibRaw_cameramaker_index = 56;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Rollei: LibRaw_cameramaker_index = 57;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_RoverShot: LibRaw_cameramaker_index = 58;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Samsung: LibRaw_cameramaker_index = 59;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Sigma: LibRaw_cameramaker_index = 60;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Sinar: LibRaw_cameramaker_index = 61;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_SMaL: LibRaw_cameramaker_index = 62;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Sony: LibRaw_cameramaker_index = 63;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_ST_Micro: LibRaw_cameramaker_index = 64;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_THL: LibRaw_cameramaker_index = 65;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_VLUU: LibRaw_cameramaker_index = 66;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Xiaomi: LibRaw_cameramaker_index = 67;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_XIAOYI: LibRaw_cameramaker_index = 68;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_YI: LibRaw_cameramaker_index = 69;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Yuneec: LibRaw_cameramaker_index = 70;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Zeiss: LibRaw_cameramaker_index = 71;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_OnePlus: LibRaw_cameramaker_index = 72;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_ISG: LibRaw_cameramaker_index = 73;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_VIVO: LibRaw_cameramaker_index = 74;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_HMD_Global: LibRaw_cameramaker_index = 75;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_HUAWEI: LibRaw_cameramaker_index = 76;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_RaspberryPi: LibRaw_cameramaker_index = 77;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_OmDigital: LibRaw_cameramaker_index = 78;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_TheLastOne: LibRaw_cameramaker_index = 79;
pub type LibRaw_cameramaker_index = libc::c_int;
pub const LibRaw_camera_mounts_LIBRAW_MOUNT_Unknown: LibRaw_camera_mounts = 0;
pub const LibRaw_camera_mounts_LIBRAW_MOUNT_Alpa: LibRaw_camera_mounts = 1;
pub const LibRaw_camera_mounts_LIBRAW_MOUNT_C: LibRaw_camera_mounts = 2;
pub const LibRaw_camera_mounts_LIBRAW_MOUNT_Canon_EF_M: LibRaw_camera_mounts = 3;
pub const LibRaw_camera_mounts_LIBRAW_MOUNT_Canon_EF_S: LibRaw_camera_mounts = 4;
pub const LibRaw_camera_mounts_LIBRAW_MOUNT_Canon_EF: LibRaw_camera_mounts = 5;
pub const LibRaw_camera_mounts_LIBRAW_MOUNT_Canon_RF: LibRaw_camera_mounts = 6;
pub const LibRaw_camera_mounts_LIBRAW_MOUNT_Contax_N: LibRaw_camera_mounts = 7;
pub const LibRaw_camera_mounts_LIBRAW_MOUNT_Contax645: LibRaw_camera_mounts = 8;
pub const LibRaw_camera_mounts_LIBRAW_MOUNT_FT: LibRaw_camera_mounts = 9;
pub const LibRaw_camera_mounts_LIBRAW_MOUNT_mFT: LibRaw_camera_mounts = 10;
pub const LibRaw_camera_mounts_LIBRAW_MOUNT_Fuji_GF: LibRaw_camera_mounts = 11;
pub const LibRaw_camera_mounts_LIBRAW_MOUNT_Fuji_GX: LibRaw_camera_mounts = 12;
pub const LibRaw_camera_mounts_LIBRAW_MOUNT_Fuji_X: LibRaw_camera_mounts = 13;
pub const LibRaw_camera_mounts_LIBRAW_MOUNT_Hasselblad_H: LibRaw_camera_mounts = 14;
pub const LibRaw_camera_mounts_LIBRAW_MOUNT_Hasselblad_V: LibRaw_camera_mounts = 15;
pub const LibRaw_camera_mounts_LIBRAW_MOUNT_Hasselblad_XCD: LibRaw_camera_mounts = 16;
pub const LibRaw_camera_mounts_LIBRAW_MOUNT_Leica_M: LibRaw_camera_mounts = 17;
pub const LibRaw_camera_mounts_LIBRAW_MOUNT_Leica_R: LibRaw_camera_mounts = 18;
pub const LibRaw_camera_mounts_LIBRAW_MOUNT_Leica_S: LibRaw_camera_mounts = 19;
pub const LibRaw_camera_mounts_LIBRAW_MOUNT_Leica_SL: LibRaw_camera_mounts = 20;
pub const LibRaw_camera_mounts_LIBRAW_MOUNT_Leica_TL: LibRaw_camera_mounts = 21;
pub const LibRaw_camera_mounts_LIBRAW_MOUNT_LPS_L: LibRaw_camera_mounts = 22;
pub const LibRaw_camera_mounts_LIBRAW_MOUNT_Mamiya67: LibRaw_camera_mounts = 23;
pub const LibRaw_camera_mounts_LIBRAW_MOUNT_Mamiya645: LibRaw_camera_mounts = 24;
pub const LibRaw_camera_mounts_LIBRAW_MOUNT_Minolta_A: LibRaw_camera_mounts = 25;
pub const LibRaw_camera_mounts_LIBRAW_MOUNT_Nikon_CX: LibRaw_camera_mounts = 26;
pub const LibRaw_camera_mounts_LIBRAW_MOUNT_Nikon_F: LibRaw_camera_mounts = 27;
pub const LibRaw_camera_mounts_LIBRAW_MOUNT_Nikon_Z: LibRaw_camera_mounts = 28;
pub const LibRaw_camera_mounts_LIBRAW_MOUNT_PhaseOne_iXM_MV: LibRaw_camera_mounts = 29;
pub const LibRaw_camera_mounts_LIBRAW_MOUNT_PhaseOne_iXM_RS: LibRaw_camera_mounts = 30;
pub const LibRaw_camera_mounts_LIBRAW_MOUNT_PhaseOne_iXM: LibRaw_camera_mounts = 31;
pub const LibRaw_camera_mounts_LIBRAW_MOUNT_Pentax_645: LibRaw_camera_mounts = 32;
pub const LibRaw_camera_mounts_LIBRAW_MOUNT_Pentax_K: LibRaw_camera_mounts = 33;
pub const LibRaw_camera_mounts_LIBRAW_MOUNT_Pentax_Q: LibRaw_camera_mounts = 34;
pub const LibRaw_camera_mounts_LIBRAW_MOUNT_RicohModule: LibRaw_camera_mounts = 35;
pub const LibRaw_camera_mounts_LIBRAW_MOUNT_Rollei_bayonet: LibRaw_camera_mounts = 36;
pub const LibRaw_camera_mounts_LIBRAW_MOUNT_Samsung_NX_M: LibRaw_camera_mounts = 37;
pub const LibRaw_camera_mounts_LIBRAW_MOUNT_Samsung_NX: LibRaw_camera_mounts = 38;
pub const LibRaw_camera_mounts_LIBRAW_MOUNT_Sigma_X3F: LibRaw_camera_mounts = 39;
pub const LibRaw_camera_mounts_LIBRAW_MOUNT_Sony_E: LibRaw_camera_mounts = 40;
pub const LibRaw_camera_mounts_LIBRAW_MOUNT_LF: LibRaw_camera_mounts = 41;
pub const LibRaw_camera_mounts_LIBRAW_MOUNT_DigitalBack: LibRaw_camera_mounts = 42;
pub const LibRaw_camera_mounts_LIBRAW_MOUNT_FixedLens: LibRaw_camera_mounts = 43;
pub const LibRaw_camera_mounts_LIBRAW_MOUNT_IL_UM: LibRaw_camera_mounts = 44;
pub const LibRaw_camera_mounts_LIBRAW_MOUNT_TheLastOne: LibRaw_camera_mounts = 45;
pub type LibRaw_camera_mounts = libc::c_int;
pub const LibRaw_camera_formats_LIBRAW_FORMAT_Unknown: LibRaw_camera_formats = 0;
pub const LibRaw_camera_formats_LIBRAW_FORMAT_APSC: LibRaw_camera_formats = 1;
pub const LibRaw_camera_formats_LIBRAW_FORMAT_FF: LibRaw_camera_formats = 2;
pub const LibRaw_camera_formats_LIBRAW_FORMAT_MF: LibRaw_camera_formats = 3;
pub const LibRaw_camera_formats_LIBRAW_FORMAT_APSH: LibRaw_camera_formats = 4;
pub const LibRaw_camera_formats_LIBRAW_FORMAT_1INCH: LibRaw_camera_formats = 5;
pub const LibRaw_camera_formats_LIBRAW_FORMAT_1div2p3INCH: LibRaw_camera_formats = 6;
pub const LibRaw_camera_formats_LIBRAW_FORMAT_1div1p7INCH: LibRaw_camera_formats = 7;
pub const LibRaw_camera_formats_LIBRAW_FORMAT_FT: LibRaw_camera_formats = 8;
pub const LibRaw_camera_formats_LIBRAW_FORMAT_CROP645: LibRaw_camera_formats = 9;
pub const LibRaw_camera_formats_LIBRAW_FORMAT_LeicaS: LibRaw_camera_formats = 10;
pub const LibRaw_camera_formats_LIBRAW_FORMAT_645: LibRaw_camera_formats = 11;
pub const LibRaw_camera_formats_LIBRAW_FORMAT_66: LibRaw_camera_formats = 12;
pub const LibRaw_camera_formats_LIBRAW_FORMAT_69: LibRaw_camera_formats = 13;
pub const LibRaw_camera_formats_LIBRAW_FORMAT_LF: LibRaw_camera_formats = 14;
pub const LibRaw_camera_formats_LIBRAW_FORMAT_Leica_DMR: LibRaw_camera_formats = 15;
pub const LibRaw_camera_formats_LIBRAW_FORMAT_67: LibRaw_camera_formats = 16;
pub const LibRaw_camera_formats_LIBRAW_FORMAT_SigmaAPSC: LibRaw_camera_formats = 17;
pub const LibRaw_camera_formats_LIBRAW_FORMAT_SigmaMerrill: LibRaw_camera_formats = 18;
pub const LibRaw_camera_formats_LIBRAW_FORMAT_SigmaAPSH: LibRaw_camera_formats = 19;
pub const LibRaw_camera_formats_LIBRAW_FORMAT_3648: LibRaw_camera_formats = 20;
pub const LibRaw_camera_formats_LIBRAW_FORMAT_68: LibRaw_camera_formats = 21;
pub const LibRaw_camera_formats_LIBRAW_FORMAT_TheLastOne: LibRaw_camera_formats = 22;
pub type LibRaw_camera_formats = libc::c_int;
pub const LibRawImageAspects_LIBRAW_IMAGE_ASPECT_UNKNOWN: LibRawImageAspects = 0;
pub const LibRawImageAspects_LIBRAW_IMAGE_ASPECT_OTHER: LibRawImageAspects = 1;
pub const LibRawImageAspects_LIBRAW_IMAGE_ASPECT_MINIMAL_REAL_ASPECT_VALUE: LibRawImageAspects = 99;
pub const LibRawImageAspects_LIBRAW_IMAGE_ASPECT_MAXIMAL_REAL_ASPECT_VALUE: LibRawImageAspects =
    10000;
pub const LibRawImageAspects_LIBRAW_IMAGE_ASPECT_3to2: LibRawImageAspects = 1500;
pub const LibRawImageAspects_LIBRAW_IMAGE_ASPECT_1to1: LibRawImageAspects = 1000;
pub const LibRawImageAspects_LIBRAW_IMAGE_ASPECT_4to3: LibRawImageAspects = 1333;
pub const LibRawImageAspects_LIBRAW_IMAGE_ASPECT_16to9: LibRawImageAspects = 1777;
pub const LibRawImageAspects_LIBRAW_IMAGE_ASPECT_5to4: LibRawImageAspects = 1250;
pub const LibRawImageAspects_LIBRAW_IMAGE_ASPECT_7to6: LibRawImageAspects = 1166;
pub const LibRawImageAspects_LIBRAW_IMAGE_ASPECT_6to5: LibRawImageAspects = 1200;
pub const LibRawImageAspects_LIBRAW_IMAGE_ASPECT_7to5: LibRawImageAspects = 1400;
pub type LibRawImageAspects = libc::c_int;
pub const LibRaw_lens_focal_types_LIBRAW_FT_UNDEFINED: LibRaw_lens_focal_types = 0;
pub const LibRaw_lens_focal_types_LIBRAW_FT_PRIME_LENS: LibRaw_lens_focal_types = 1;
pub const LibRaw_lens_focal_types_LIBRAW_FT_ZOOM_LENS: LibRaw_lens_focal_types = 2;
pub const LibRaw_lens_focal_types_LIBRAW_FT_ZOOM_LENS_CONSTANT_APERTURE: LibRaw_lens_focal_types =
    3;
pub const LibRaw_lens_focal_types_LIBRAW_FT_ZOOM_LENS_VARIABLE_APERTURE: LibRaw_lens_focal_types =
    4;
pub type LibRaw_lens_focal_types = libc::c_int;
pub const LibRaw_Canon_RecordModes_LIBRAW_Canon_RecordMode_UNDEFINED: LibRaw_Canon_RecordModes = 0;
pub const LibRaw_Canon_RecordModes_LIBRAW_Canon_RecordMode_JPEG: LibRaw_Canon_RecordModes = 1;
pub const LibRaw_Canon_RecordModes_LIBRAW_Canon_RecordMode_CRW_THM: LibRaw_Canon_RecordModes = 2;
pub const LibRaw_Canon_RecordModes_LIBRAW_Canon_RecordMode_AVI_THM: LibRaw_Canon_RecordModes = 3;
pub const LibRaw_Canon_RecordModes_LIBRAW_Canon_RecordMode_TIF: LibRaw_Canon_RecordModes = 4;
pub const LibRaw_Canon_RecordModes_LIBRAW_Canon_RecordMode_TIF_JPEG: LibRaw_Canon_RecordModes = 5;
pub const LibRaw_Canon_RecordModes_LIBRAW_Canon_RecordMode_CR2: LibRaw_Canon_RecordModes = 6;
pub const LibRaw_Canon_RecordModes_LIBRAW_Canon_RecordMode_CR2_JPEG: LibRaw_Canon_RecordModes = 7;
pub const LibRaw_Canon_RecordModes_LIBRAW_Canon_RecordMode_UNKNOWN: LibRaw_Canon_RecordModes = 8;
pub const LibRaw_Canon_RecordModes_LIBRAW_Canon_RecordMode_MOV: LibRaw_Canon_RecordModes = 9;
pub const LibRaw_Canon_RecordModes_LIBRAW_Canon_RecordMode_MP4: LibRaw_Canon_RecordModes = 10;
pub const LibRaw_Canon_RecordModes_LIBRAW_Canon_RecordMode_CRM: LibRaw_Canon_RecordModes = 11;
pub const LibRaw_Canon_RecordModes_LIBRAW_Canon_RecordMode_CR3: LibRaw_Canon_RecordModes = 12;
pub const LibRaw_Canon_RecordModes_LIBRAW_Canon_RecordMode_CR3_JPEG: LibRaw_Canon_RecordModes = 13;
pub const LibRaw_Canon_RecordModes_LIBRAW_Canon_RecordMode_HEIF: LibRaw_Canon_RecordModes = 14;
pub const LibRaw_Canon_RecordModes_LIBRAW_Canon_RecordMode_CR3_HEIF: LibRaw_Canon_RecordModes = 15;
pub const LibRaw_Canon_RecordModes_LIBRAW_Canon_RecordMode_TheLastOne: LibRaw_Canon_RecordModes =
    16;
pub type LibRaw_Canon_RecordModes = libc::c_int;
pub const LibRaw_minolta_storagemethods_LIBRAW_MINOLTA_UNPACKED: LibRaw_minolta_storagemethods = 82;
pub const LibRaw_minolta_storagemethods_LIBRAW_MINOLTA_PACKED: LibRaw_minolta_storagemethods = 89;
pub type LibRaw_minolta_storagemethods = libc::c_int;
pub const LibRaw_minolta_bayerpatterns_LIBRAW_MINOLTA_RGGB: LibRaw_minolta_bayerpatterns = 1;
pub const LibRaw_minolta_bayerpatterns_LIBRAW_MINOLTA_G2BRG1: LibRaw_minolta_bayerpatterns = 4;
pub type LibRaw_minolta_bayerpatterns = libc::c_int;
pub const LibRaw_sony_cameratypes_LIBRAW_SONY_DSC: LibRaw_sony_cameratypes = 1;
pub const LibRaw_sony_cameratypes_LIBRAW_SONY_DSLR: LibRaw_sony_cameratypes = 2;
pub const LibRaw_sony_cameratypes_LIBRAW_SONY_NEX: LibRaw_sony_cameratypes = 3;
pub const LibRaw_sony_cameratypes_LIBRAW_SONY_SLT: LibRaw_sony_cameratypes = 4;
pub const LibRaw_sony_cameratypes_LIBRAW_SONY_ILCE: LibRaw_sony_cameratypes = 5;
pub const LibRaw_sony_cameratypes_LIBRAW_SONY_ILCA: LibRaw_sony_cameratypes = 6;
pub const LibRaw_sony_cameratypes_LIBRAW_SONY_CameraType_UNKNOWN: LibRaw_sony_cameratypes = 65535;
pub type LibRaw_sony_cameratypes = libc::c_int;
pub const LibRaw_Sony_0x2010_Type_LIBRAW_SONY_Tag2010None: LibRaw_Sony_0x2010_Type = 0;
pub const LibRaw_Sony_0x2010_Type_LIBRAW_SONY_Tag2010a: LibRaw_Sony_0x2010_Type = 1;
pub const LibRaw_Sony_0x2010_Type_LIBRAW_SONY_Tag2010b: LibRaw_Sony_0x2010_Type = 2;
pub const LibRaw_Sony_0x2010_Type_LIBRAW_SONY_Tag2010c: LibRaw_Sony_0x2010_Type = 3;
pub const LibRaw_Sony_0x2010_Type_LIBRAW_SONY_Tag2010d: LibRaw_Sony_0x2010_Type = 4;
pub const LibRaw_Sony_0x2010_Type_LIBRAW_SONY_Tag2010e: LibRaw_Sony_0x2010_Type = 5;
pub const LibRaw_Sony_0x2010_Type_LIBRAW_SONY_Tag2010f: LibRaw_Sony_0x2010_Type = 6;
pub const LibRaw_Sony_0x2010_Type_LIBRAW_SONY_Tag2010g: LibRaw_Sony_0x2010_Type = 7;
pub const LibRaw_Sony_0x2010_Type_LIBRAW_SONY_Tag2010h: LibRaw_Sony_0x2010_Type = 8;
pub const LibRaw_Sony_0x2010_Type_LIBRAW_SONY_Tag2010i: LibRaw_Sony_0x2010_Type = 9;
pub type LibRaw_Sony_0x2010_Type = libc::c_int;
pub const LibRaw_Sony_0x9050_Type_LIBRAW_SONY_Tag9050None: LibRaw_Sony_0x9050_Type = 0;
pub const LibRaw_Sony_0x9050_Type_LIBRAW_SONY_Tag9050a: LibRaw_Sony_0x9050_Type = 1;
pub const LibRaw_Sony_0x9050_Type_LIBRAW_SONY_Tag9050b: LibRaw_Sony_0x9050_Type = 2;
pub const LibRaw_Sony_0x9050_Type_LIBRAW_SONY_Tag9050c: LibRaw_Sony_0x9050_Type = 3;
pub type LibRaw_Sony_0x9050_Type = libc::c_int;
pub const LIBRAW_SONY_FOCUSMODEmodes_LIBRAW_SONY_FOCUSMODE_MF: LIBRAW_SONY_FOCUSMODEmodes = 0;
pub const LIBRAW_SONY_FOCUSMODEmodes_LIBRAW_SONY_FOCUSMODE_AF_S: LIBRAW_SONY_FOCUSMODEmodes = 2;
pub const LIBRAW_SONY_FOCUSMODEmodes_LIBRAW_SONY_FOCUSMODE_AF_C: LIBRAW_SONY_FOCUSMODEmodes = 3;
pub const LIBRAW_SONY_FOCUSMODEmodes_LIBRAW_SONY_FOCUSMODE_AF_A: LIBRAW_SONY_FOCUSMODEmodes = 4;
pub const LIBRAW_SONY_FOCUSMODEmodes_LIBRAW_SONY_FOCUSMODE_DMF: LIBRAW_SONY_FOCUSMODEmodes = 6;
pub const LIBRAW_SONY_FOCUSMODEmodes_LIBRAW_SONY_FOCUSMODE_AF_D: LIBRAW_SONY_FOCUSMODEmodes = 7;
pub const LIBRAW_SONY_FOCUSMODEmodes_LIBRAW_SONY_FOCUSMODE_AF: LIBRAW_SONY_FOCUSMODEmodes = 101;
pub const LIBRAW_SONY_FOCUSMODEmodes_LIBRAW_SONY_FOCUSMODE_PERMANENT_AF:
    LIBRAW_SONY_FOCUSMODEmodes = 104;
pub const LIBRAW_SONY_FOCUSMODEmodes_LIBRAW_SONY_FOCUSMODE_SEMI_MF: LIBRAW_SONY_FOCUSMODEmodes =
    105;
pub const LIBRAW_SONY_FOCUSMODEmodes_LIBRAW_SONY_FOCUSMODE_UNKNOWN: LIBRAW_SONY_FOCUSMODEmodes = -1;
pub type LIBRAW_SONY_FOCUSMODEmodes = libc::c_int;
pub const LibRaw_KodakSensors_LIBRAW_Kodak_UnknownSensor: LibRaw_KodakSensors = 0;
pub const LibRaw_KodakSensors_LIBRAW_Kodak_M1: LibRaw_KodakSensors = 1;
pub const LibRaw_KodakSensors_LIBRAW_Kodak_M15: LibRaw_KodakSensors = 2;
pub const LibRaw_KodakSensors_LIBRAW_Kodak_M16: LibRaw_KodakSensors = 3;
pub const LibRaw_KodakSensors_LIBRAW_Kodak_M17: LibRaw_KodakSensors = 4;
pub const LibRaw_KodakSensors_LIBRAW_Kodak_M2: LibRaw_KodakSensors = 5;
pub const LibRaw_KodakSensors_LIBRAW_Kodak_M23: LibRaw_KodakSensors = 6;
pub const LibRaw_KodakSensors_LIBRAW_Kodak_M24: LibRaw_KodakSensors = 7;
pub const LibRaw_KodakSensors_LIBRAW_Kodak_M3: LibRaw_KodakSensors = 8;
pub const LibRaw_KodakSensors_LIBRAW_Kodak_M5: LibRaw_KodakSensors = 9;
pub const LibRaw_KodakSensors_LIBRAW_Kodak_M6: LibRaw_KodakSensors = 10;
pub const LibRaw_KodakSensors_LIBRAW_Kodak_C14: LibRaw_KodakSensors = 11;
pub const LibRaw_KodakSensors_LIBRAW_Kodak_X14: LibRaw_KodakSensors = 12;
pub const LibRaw_KodakSensors_LIBRAW_Kodak_M11: LibRaw_KodakSensors = 13;
pub type LibRaw_KodakSensors = libc::c_int;
pub const LibRaw_HasselbladFormatCodes_LIBRAW_HF_Unknown: LibRaw_HasselbladFormatCodes = 0;
pub const LibRaw_HasselbladFormatCodes_LIBRAW_HF_3FR: LibRaw_HasselbladFormatCodes = 1;
pub const LibRaw_HasselbladFormatCodes_LIBRAW_HF_FFF: LibRaw_HasselbladFormatCodes = 2;
pub const LibRaw_HasselbladFormatCodes_LIBRAW_HF_Imacon: LibRaw_HasselbladFormatCodes = 3;
pub const LibRaw_HasselbladFormatCodes_LIBRAW_HF_HasselbladDNG: LibRaw_HasselbladFormatCodes = 4;
pub const LibRaw_HasselbladFormatCodes_LIBRAW_HF_AdobeDNG: LibRaw_HasselbladFormatCodes = 5;
pub const LibRaw_HasselbladFormatCodes_LIBRAW_HF_AdobeDNG_fromPhocusDNG:
    LibRaw_HasselbladFormatCodes = 6;
pub type LibRaw_HasselbladFormatCodes = libc::c_int;
pub const LibRaw_rawspecial_t_LIBRAW_RAWSPECIAL_SONYARW2_NONE: LibRaw_rawspecial_t = 0;
pub const LibRaw_rawspecial_t_LIBRAW_RAWSPECIAL_SONYARW2_BASEONLY: LibRaw_rawspecial_t = 1;
pub const LibRaw_rawspecial_t_LIBRAW_RAWSPECIAL_SONYARW2_DELTAONLY: LibRaw_rawspecial_t = 2;
pub const LibRaw_rawspecial_t_LIBRAW_RAWSPECIAL_SONYARW2_DELTAZEROBASE: LibRaw_rawspecial_t = 4;
pub const LibRaw_rawspecial_t_LIBRAW_RAWSPECIAL_SONYARW2_DELTATOVALUE: LibRaw_rawspecial_t = 8;
pub const LibRaw_rawspecial_t_LIBRAW_RAWSPECIAL_SONYARW2_ALLFLAGS: LibRaw_rawspecial_t = 15;
pub const LibRaw_rawspecial_t_LIBRAW_RAWSPECIAL_NODP2Q_INTERPOLATERG: LibRaw_rawspecial_t = 16;
pub const LibRaw_rawspecial_t_LIBRAW_RAWSPECIAL_NODP2Q_INTERPOLATEAF: LibRaw_rawspecial_t = 32;
pub const LibRaw_rawspecial_t_LIBRAW_RAWSPECIAL_SRAW_NO_RGB: LibRaw_rawspecial_t = 64;
pub const LibRaw_rawspecial_t_LIBRAW_RAWSPECIAL_SRAW_NO_INTERPOLATE: LibRaw_rawspecial_t = 128;
pub type LibRaw_rawspecial_t = libc::c_int;
pub const LibRaw_rawspeed_bits_t_LIBRAW_RAWSPEEDV1_USE: LibRaw_rawspeed_bits_t = 1;
pub const LibRaw_rawspeed_bits_t_LIBRAW_RAWSPEEDV1_FAILONUNKNOWN: LibRaw_rawspeed_bits_t = 2;
pub const LibRaw_rawspeed_bits_t_LIBRAW_RAWSPEEDV1_IGNOREERRORS: LibRaw_rawspeed_bits_t = 4;
pub const LibRaw_rawspeed_bits_t_LIBRAW_RAWSPEEDV3_USE: LibRaw_rawspeed_bits_t = 256;
pub const LibRaw_rawspeed_bits_t_LIBRAW_RAWSPEEDV3_FAILONUNKNOWN: LibRaw_rawspeed_bits_t = 512;
pub const LibRaw_rawspeed_bits_t_LIBRAW_RAWSPEEDV3_IGNOREERRORS: LibRaw_rawspeed_bits_t = 1024;
pub type LibRaw_rawspeed_bits_t = libc::c_int;
pub const LibRaw_processing_options_LIBRAW_RAWOPTIONS_PENTAX_PS_ALLFRAMES:
    LibRaw_processing_options = 1;
pub const LibRaw_processing_options_LIBRAW_RAWOPTIONS_CONVERTFLOAT_TO_INT:
    LibRaw_processing_options = 2;
pub const LibRaw_processing_options_LIBRAW_RAWOPTIONS_ARQ_SKIP_CHANNEL_SWAP:
    LibRaw_processing_options = 4;
pub const LibRaw_processing_options_LIBRAW_RAWOPTIONS_NO_ROTATE_FOR_KODAK_THUMBNAILS:
    LibRaw_processing_options = 8;
pub const LibRaw_processing_options_LIBRAW_RAWOPTIONS_USE_PPM16_THUMBS: LibRaw_processing_options =
    32;
pub const LibRaw_processing_options_LIBRAW_RAWOPTIONS_DONT_CHECK_DNG_ILLUMINANT:
    LibRaw_processing_options = 64;
pub const LibRaw_processing_options_LIBRAW_RAWOPTIONS_DNGSDK_ZEROCOPY: LibRaw_processing_options =
    128;
pub const LibRaw_processing_options_LIBRAW_RAWOPTIONS_ZEROFILTERS_FOR_MONOCHROMETIFFS:
    LibRaw_processing_options = 256;
pub const LibRaw_processing_options_LIBRAW_RAWOPTIONS_DNG_ADD_ENHANCED: LibRaw_processing_options =
    512;
pub const LibRaw_processing_options_LIBRAW_RAWOPTIONS_DNG_ADD_PREVIEWS: LibRaw_processing_options =
    1024;
pub const LibRaw_processing_options_LIBRAW_RAWOPTIONS_DNG_PREFER_LARGEST_IMAGE:
    LibRaw_processing_options = 2048;
pub const LibRaw_processing_options_LIBRAW_RAWOPTIONS_DNG_STAGE2: LibRaw_processing_options = 4096;
pub const LibRaw_processing_options_LIBRAW_RAWOPTIONS_DNG_STAGE3: LibRaw_processing_options = 8192;
pub const LibRaw_processing_options_LIBRAW_RAWOPTIONS_DNG_ALLOWSIZECHANGE:
    LibRaw_processing_options = 16384;
pub const LibRaw_processing_options_LIBRAW_RAWOPTIONS_DNG_DISABLEWBADJUST:
    LibRaw_processing_options = 32768;
pub const LibRaw_processing_options_LIBRAW_RAWOPTIONS_PROVIDE_NONSTANDARD_WB:
    LibRaw_processing_options = 65536;
pub const LibRaw_processing_options_LIBRAW_RAWOPTIONS_CAMERAWB_FALLBACK_TO_DAYLIGHT:
    LibRaw_processing_options = 131072;
pub const LibRaw_processing_options_LIBRAW_RAWOPTIONS_CHECK_THUMBNAILS_KNOWN_VENDORS:
    LibRaw_processing_options = 262144;
pub const LibRaw_processing_options_LIBRAW_RAWOPTIONS_CHECK_THUMBNAILS_ALL_VENDORS:
    LibRaw_processing_options = 524288;
pub const LibRaw_processing_options_LIBRAW_RAWOPTIONS_DNG_STAGE2_IFPRESENT:
    LibRaw_processing_options = 1048576;
pub const LibRaw_processing_options_LIBRAW_RAWOPTIONS_DNG_STAGE3_IFPRESENT:
    LibRaw_processing_options = 2097152;
pub const LibRaw_processing_options_LIBRAW_RAWOPTIONS_DNG_ADD_MASKS: LibRaw_processing_options =
    4194304;
pub const LibRaw_processing_options_LIBRAW_RAWOPTIONS_CANON_IGNORE_MAKERNOTES_ROTATION:
    LibRaw_processing_options = 8388608;
pub type LibRaw_processing_options = libc::c_int;
pub const LibRaw_decoder_flags_LIBRAW_DECODER_HASCURVE: LibRaw_decoder_flags = 16;
pub const LibRaw_decoder_flags_LIBRAW_DECODER_SONYARW2: LibRaw_decoder_flags = 32;
pub const LibRaw_decoder_flags_LIBRAW_DECODER_TRYRAWSPEED: LibRaw_decoder_flags = 64;
pub const LibRaw_decoder_flags_LIBRAW_DECODER_OWNALLOC: LibRaw_decoder_flags = 128;
pub const LibRaw_decoder_flags_LIBRAW_DECODER_FIXEDMAXC: LibRaw_decoder_flags = 256;
pub const LibRaw_decoder_flags_LIBRAW_DECODER_ADOBECOPYPIXEL: LibRaw_decoder_flags = 512;
pub const LibRaw_decoder_flags_LIBRAW_DECODER_LEGACY_WITH_MARGINS: LibRaw_decoder_flags = 1024;
pub const LibRaw_decoder_flags_LIBRAW_DECODER_3CHANNEL: LibRaw_decoder_flags = 2048;
pub const LibRaw_decoder_flags_LIBRAW_DECODER_SINAR4SHOT: LibRaw_decoder_flags = 2048;
pub const LibRaw_decoder_flags_LIBRAW_DECODER_FLATDATA: LibRaw_decoder_flags = 4096;
pub const LibRaw_decoder_flags_LIBRAW_DECODER_FLAT_BG2_SWAPPED: LibRaw_decoder_flags = 8192;
pub const LibRaw_decoder_flags_LIBRAW_DECODER_UNSUPPORTED_FORMAT: LibRaw_decoder_flags = 16384;
pub const LibRaw_decoder_flags_LIBRAW_DECODER_NOTSET: LibRaw_decoder_flags = 32768;
pub const LibRaw_decoder_flags_LIBRAW_DECODER_TRYRAWSPEED3: LibRaw_decoder_flags = 65536;
pub type LibRaw_decoder_flags = libc::c_int;
pub const LibRaw_constructor_flags_LIBRAW_OPTIONS_NONE: LibRaw_constructor_flags = 0;
pub const LibRaw_constructor_flags_LIBRAW_OPTIONS_NO_DATAERR_CALLBACK: LibRaw_constructor_flags = 2;
pub const LibRaw_constructor_flags_LIBRAW_OPIONS_NO_DATAERR_CALLBACK: LibRaw_constructor_flags = 2;
pub type LibRaw_constructor_flags = libc::c_int;
pub const LibRaw_warnings_LIBRAW_WARN_NONE: LibRaw_warnings = 0;
pub const LibRaw_warnings_LIBRAW_WARN_BAD_CAMERA_WB: LibRaw_warnings = 4;
pub const LibRaw_warnings_LIBRAW_WARN_NO_METADATA: LibRaw_warnings = 8;
pub const LibRaw_warnings_LIBRAW_WARN_NO_JPEGLIB: LibRaw_warnings = 16;
pub const LibRaw_warnings_LIBRAW_WARN_NO_EMBEDDED_PROFILE: LibRaw_warnings = 32;
pub const LibRaw_warnings_LIBRAW_WARN_NO_INPUT_PROFILE: LibRaw_warnings = 64;
pub const LibRaw_warnings_LIBRAW_WARN_BAD_OUTPUT_PROFILE: LibRaw_warnings = 128;
pub const LibRaw_warnings_LIBRAW_WARN_NO_BADPIXELMAP: LibRaw_warnings = 256;
pub const LibRaw_warnings_LIBRAW_WARN_BAD_DARKFRAME_FILE: LibRaw_warnings = 512;
pub const LibRaw_warnings_LIBRAW_WARN_BAD_DARKFRAME_DIM: LibRaw_warnings = 1024;
pub const LibRaw_warnings_LIBRAW_WARN_RAWSPEED_PROBLEM: LibRaw_warnings = 4096;
pub const LibRaw_warnings_LIBRAW_WARN_RAWSPEED_UNSUPPORTED: LibRaw_warnings = 8192;
pub const LibRaw_warnings_LIBRAW_WARN_RAWSPEED_PROCESSED: LibRaw_warnings = 16384;
pub const LibRaw_warnings_LIBRAW_WARN_FALLBACK_TO_AHD: LibRaw_warnings = 32768;
pub const LibRaw_warnings_LIBRAW_WARN_PARSEFUJI_PROCESSED: LibRaw_warnings = 65536;
pub const LibRaw_warnings_LIBRAW_WARN_DNGSDK_PROCESSED: LibRaw_warnings = 131072;
pub const LibRaw_warnings_LIBRAW_WARN_DNG_IMAGES_REORDERED: LibRaw_warnings = 262144;
pub const LibRaw_warnings_LIBRAW_WARN_DNG_STAGE2_APPLIED: LibRaw_warnings = 524288;
pub const LibRaw_warnings_LIBRAW_WARN_DNG_STAGE3_APPLIED: LibRaw_warnings = 1048576;
pub const LibRaw_warnings_LIBRAW_WARN_RAWSPEED3_PROBLEM: LibRaw_warnings = 2097152;
pub const LibRaw_warnings_LIBRAW_WARN_RAWSPEED3_UNSUPPORTED: LibRaw_warnings = 4194304;
pub const LibRaw_warnings_LIBRAW_WARN_RAWSPEED3_PROCESSED: LibRaw_warnings = 8388608;
pub const LibRaw_warnings_LIBRAW_WARN_RAWSPEED3_NOTLISTED: LibRaw_warnings = 16777216;
pub type LibRaw_warnings = libc::c_int;
pub const LibRaw_exceptions_LIBRAW_EXCEPTION_NONE: LibRaw_exceptions = 0;
pub const LibRaw_exceptions_LIBRAW_EXCEPTION_ALLOC: LibRaw_exceptions = 1;
pub const LibRaw_exceptions_LIBRAW_EXCEPTION_DECODE_RAW: LibRaw_exceptions = 2;
pub const LibRaw_exceptions_LIBRAW_EXCEPTION_DECODE_JPEG: LibRaw_exceptions = 3;
pub const LibRaw_exceptions_LIBRAW_EXCEPTION_IO_EOF: LibRaw_exceptions = 4;
pub const LibRaw_exceptions_LIBRAW_EXCEPTION_IO_CORRUPT: LibRaw_exceptions = 5;
pub const LibRaw_exceptions_LIBRAW_EXCEPTION_CANCELLED_BY_CALLBACK: LibRaw_exceptions = 6;
pub const LibRaw_exceptions_LIBRAW_EXCEPTION_BAD_CROP: LibRaw_exceptions = 7;
pub const LibRaw_exceptions_LIBRAW_EXCEPTION_IO_BADFILE: LibRaw_exceptions = 8;
pub const LibRaw_exceptions_LIBRAW_EXCEPTION_DECODE_JPEG2000: LibRaw_exceptions = 9;
pub const LibRaw_exceptions_LIBRAW_EXCEPTION_TOOBIG: LibRaw_exceptions = 10;
pub const LibRaw_exceptions_LIBRAW_EXCEPTION_MEMPOOL: LibRaw_exceptions = 11;
pub const LibRaw_exceptions_LIBRAW_EXCEPTION_UNSUPPORTED_FORMAT: LibRaw_exceptions = 12;
pub type LibRaw_exceptions = libc::c_int;
pub const LibRaw_progress_LIBRAW_PROGRESS_START: LibRaw_progress = 0;
pub const LibRaw_progress_LIBRAW_PROGRESS_OPEN: LibRaw_progress = 1;
pub const LibRaw_progress_LIBRAW_PROGRESS_IDENTIFY: LibRaw_progress = 2;
pub const LibRaw_progress_LIBRAW_PROGRESS_SIZE_ADJUST: LibRaw_progress = 4;
pub const LibRaw_progress_LIBRAW_PROGRESS_LOAD_RAW: LibRaw_progress = 8;
pub const LibRaw_progress_LIBRAW_PROGRESS_RAW2_IMAGE: LibRaw_progress = 16;
pub const LibRaw_progress_LIBRAW_PROGRESS_REMOVE_ZEROES: LibRaw_progress = 32;
pub const LibRaw_progress_LIBRAW_PROGRESS_BAD_PIXELS: LibRaw_progress = 64;
pub const LibRaw_progress_LIBRAW_PROGRESS_DARK_FRAME: LibRaw_progress = 128;
pub const LibRaw_progress_LIBRAW_PROGRESS_FOVEON_INTERPOLATE: LibRaw_progress = 256;
pub const LibRaw_progress_LIBRAW_PROGRESS_SCALE_COLORS: LibRaw_progress = 512;
pub const LibRaw_progress_LIBRAW_PROGRESS_PRE_INTERPOLATE: LibRaw_progress = 1024;
pub const LibRaw_progress_LIBRAW_PROGRESS_INTERPOLATE: LibRaw_progress = 2048;
pub const LibRaw_progress_LIBRAW_PROGRESS_MIX_GREEN: LibRaw_progress = 4096;
pub const LibRaw_progress_LIBRAW_PROGRESS_MEDIAN_FILTER: LibRaw_progress = 8192;
pub const LibRaw_progress_LIBRAW_PROGRESS_HIGHLIGHTS: LibRaw_progress = 16384;
pub const LibRaw_progress_LIBRAW_PROGRESS_FUJI_ROTATE: LibRaw_progress = 32768;
pub const LibRaw_progress_LIBRAW_PROGRESS_FLIP: LibRaw_progress = 65536;
pub const LibRaw_progress_LIBRAW_PROGRESS_APPLY_PROFILE: LibRaw_progress = 131072;
pub const LibRaw_progress_LIBRAW_PROGRESS_CONVERT_RGB: LibRaw_progress = 262144;
pub const LibRaw_progress_LIBRAW_PROGRESS_STRETCH: LibRaw_progress = 524288;
pub const LibRaw_progress_LIBRAW_PROGRESS_STAGE20: LibRaw_progress = 1048576;
pub const LibRaw_progress_LIBRAW_PROGRESS_STAGE21: LibRaw_progress = 2097152;
pub const LibRaw_progress_LIBRAW_PROGRESS_STAGE22: LibRaw_progress = 4194304;
pub const LibRaw_progress_LIBRAW_PROGRESS_STAGE23: LibRaw_progress = 8388608;
pub const LibRaw_progress_LIBRAW_PROGRESS_STAGE24: LibRaw_progress = 16777216;
pub const LibRaw_progress_LIBRAW_PROGRESS_STAGE25: LibRaw_progress = 33554432;
pub const LibRaw_progress_LIBRAW_PROGRESS_STAGE26: LibRaw_progress = 67108864;
pub const LibRaw_progress_LIBRAW_PROGRESS_STAGE27: LibRaw_progress = 134217728;
pub const LibRaw_progress_LIBRAW_PROGRESS_THUMB_LOAD: LibRaw_progress = 268435456;
pub const LibRaw_progress_LIBRAW_PROGRESS_TRESERVED1: LibRaw_progress = 536870912;
pub const LibRaw_progress_LIBRAW_PROGRESS_TRESERVED2: LibRaw_progress = 1073741824;
pub type LibRaw_progress = libc::c_int;
pub const LibRaw_errors_LIBRAW_SUCCESS: LibRaw_errors = 0;
pub const LibRaw_errors_LIBRAW_UNSPECIFIED_ERROR: LibRaw_errors = -1;
pub const LibRaw_errors_LIBRAW_FILE_UNSUPPORTED: LibRaw_errors = -2;
pub const LibRaw_errors_LIBRAW_REQUEST_FOR_NONEXISTENT_IMAGE: LibRaw_errors = -3;
pub const LibRaw_errors_LIBRAW_OUT_OF_ORDER_CALL: LibRaw_errors = -4;
pub const LibRaw_errors_LIBRAW_NO_THUMBNAIL: LibRaw_errors = -5;
pub const LibRaw_errors_LIBRAW_UNSUPPORTED_THUMBNAIL: LibRaw_errors = -6;
pub const LibRaw_errors_LIBRAW_INPUT_CLOSED: LibRaw_errors = -7;
pub const LibRaw_errors_LIBRAW_NOT_IMPLEMENTED: LibRaw_errors = -8;
pub const LibRaw_errors_LIBRAW_REQUEST_FOR_NONEXISTENT_THUMBNAIL: LibRaw_errors = -9;
pub const LibRaw_errors_LIBRAW_UNSUFFICIENT_MEMORY: LibRaw_errors = -100007;
pub const LibRaw_errors_LIBRAW_DATA_ERROR: LibRaw_errors = -100008;
pub const LibRaw_errors_LIBRAW_IO_ERROR: LibRaw_errors = -100009;
pub const LibRaw_errors_LIBRAW_CANCELLED_BY_CALLBACK: LibRaw_errors = -100010;
pub const LibRaw_errors_LIBRAW_BAD_CROP: LibRaw_errors = -100011;
pub const LibRaw_errors_LIBRAW_TOO_BIG: LibRaw_errors = -100012;
pub const LibRaw_errors_LIBRAW_MEMPOOL_OVERFLOW: LibRaw_errors = -100013;
pub type LibRaw_errors = libc::c_int;
pub const LibRaw_internal_thumbnail_formats_LIBRAW_INTERNAL_THUMBNAIL_UNKNOWN:
    LibRaw_internal_thumbnail_formats = 0;
pub const LibRaw_internal_thumbnail_formats_LIBRAW_INTERNAL_THUMBNAIL_KODAK_THUMB:
    LibRaw_internal_thumbnail_formats = 1;
pub const LibRaw_internal_thumbnail_formats_LIBRAW_INTERNAL_THUMBNAIL_KODAK_YCBCR:
    LibRaw_internal_thumbnail_formats = 2;
pub const LibRaw_internal_thumbnail_formats_LIBRAW_INTERNAL_THUMBNAIL_KODAK_RGB:
    LibRaw_internal_thumbnail_formats = 3;
pub const LibRaw_internal_thumbnail_formats_LIBRAW_INTERNAL_THUMBNAIL_JPEG:
    LibRaw_internal_thumbnail_formats = 4;
pub const LibRaw_internal_thumbnail_formats_LIBRAW_INTERNAL_THUMBNAIL_LAYER:
    LibRaw_internal_thumbnail_formats = 5;
pub const LibRaw_internal_thumbnail_formats_LIBRAW_INTERNAL_THUMBNAIL_ROLLEI:
    LibRaw_internal_thumbnail_formats = 6;
pub const LibRaw_internal_thumbnail_formats_LIBRAW_INTERNAL_THUMBNAIL_PPM:
    LibRaw_internal_thumbnail_formats = 7;
pub const LibRaw_internal_thumbnail_formats_LIBRAW_INTERNAL_THUMBNAIL_PPM16:
    LibRaw_internal_thumbnail_formats = 8;
pub const LibRaw_internal_thumbnail_formats_LIBRAW_INTERNAL_THUMBNAIL_X3F:
    LibRaw_internal_thumbnail_formats = 9;
pub type LibRaw_internal_thumbnail_formats = libc::c_int;
pub const LibRaw_thumbnail_formats_LIBRAW_THUMBNAIL_UNKNOWN: LibRaw_thumbnail_formats = 0;
pub const LibRaw_thumbnail_formats_LIBRAW_THUMBNAIL_JPEG: LibRaw_thumbnail_formats = 1;
pub const LibRaw_thumbnail_formats_LIBRAW_THUMBNAIL_BITMAP: LibRaw_thumbnail_formats = 2;
pub const LibRaw_thumbnail_formats_LIBRAW_THUMBNAIL_BITMAP16: LibRaw_thumbnail_formats = 3;
pub const LibRaw_thumbnail_formats_LIBRAW_THUMBNAIL_LAYER: LibRaw_thumbnail_formats = 4;
pub const LibRaw_thumbnail_formats_LIBRAW_THUMBNAIL_ROLLEI: LibRaw_thumbnail_formats = 5;
pub const LibRaw_thumbnail_formats_LIBRAW_THUMBNAIL_H265: LibRaw_thumbnail_formats = 6;
pub type LibRaw_thumbnail_formats = libc::c_int;
pub const LibRaw_image_formats_LIBRAW_IMAGE_JPEG: LibRaw_image_formats = 1;
pub const LibRaw_image_formats_LIBRAW_IMAGE_BITMAP: LibRaw_image_formats = 2;
pub type LibRaw_image_formats = libc::c_int;
pub type INT64 = libc::c_longlong;
pub type UINT64 = libc::c_ulonglong;
pub type uchar = libc::c_uchar;
pub type ushort = libc::c_ushort;
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct libraw_decoder_info_t {
    pub decoder_name: *const libc::c_char,
    pub decoder_flags: libc::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of libraw_decoder_info_t"][::core::mem::size_of::<libraw_decoder_info_t>() - 16usize];
    ["Alignment of libraw_decoder_info_t"]
        [::core::mem::align_of::<libraw_decoder_info_t>() - 8usize];
    ["Offset of field: libraw_decoder_info_t::decoder_name"]
        [::core::mem::offset_of!(libraw_decoder_info_t, decoder_name) - 0usize];
    ["Offset of field: libraw_decoder_info_t::decoder_flags"]
        [::core::mem::offset_of!(libraw_decoder_info_t, decoder_flags) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct libraw_internal_output_params_t {
    pub mix_green: libc::c_uint,
    pub raw_color: libc::c_uint,
    pub zero_is_bad: libc::c_uint,
    pub shrink: ushort,
    pub fuji_width: ushort,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of libraw_internal_output_params_t"]
        [::core::mem::size_of::<libraw_internal_output_params_t>() - 16usize];
    ["Alignment of libraw_internal_output_params_t"]
        [::core::mem::align_of::<libraw_internal_output_params_t>() - 4usize];
    ["Offset of field: libraw_internal_output_params_t::mix_green"]
        [::core::mem::offset_of!(libraw_internal_output_params_t, mix_green) - 0usize];
    ["Offset of field: libraw_internal_output_params_t::raw_color"]
        [::core::mem::offset_of!(libraw_internal_output_params_t, raw_color) - 4usize];
    ["Offset of field: libraw_internal_output_params_t::zero_is_bad"]
        [::core::mem::offset_of!(libraw_internal_output_params_t, zero_is_bad) - 8usize];
    ["Offset of field: libraw_internal_output_params_t::shrink"]
        [::core::mem::offset_of!(libraw_internal_output_params_t, shrink) - 12usize];
    ["Offset of field: libraw_internal_output_params_t::fuji_width"]
        [::core::mem::offset_of!(libraw_internal_output_params_t, fuji_width) - 14usize];
};
pub type memory_callback = ::core::option::Option<
    unsafe extern "C" fn(
        data: *mut libc::c_void,
        file: *const libc::c_char,
        where_: *const libc::c_char,
    ),
>;
pub type exif_parser_callback = ::core::option::Option<
    unsafe extern "C" fn(
        context: *mut libc::c_void,
        tag: libc::c_int,
        type_: libc::c_int,
        len: libc::c_int,
        ord: libc::c_uint,
        ifp: *mut libc::c_void,
        base: INT64,
    ),
>;
pub type data_callback = ::core::option::Option<
    unsafe extern "C" fn(data: *mut libc::c_void, file: *const libc::c_char, offset: libc::c_int),
>;
unsafe extern "C" {
    pub fn default_data_callback(
        data: *mut libc::c_void,
        file: *const libc::c_char,
        offset: libc::c_int,
    );
}
pub type progress_callback = ::core::option::Option<
    unsafe extern "C" fn(
        data: *mut libc::c_void,
        stage: LibRaw_progress,
        iteration: libc::c_int,
        expected: libc::c_int,
    ) -> libc::c_int,
>;
pub type pre_identify_callback =
    ::core::option::Option<unsafe extern "C" fn(ctx: *mut libc::c_void) -> libc::c_int>;
pub type post_identify_callback =
    ::core::option::Option<unsafe extern "C" fn(ctx: *mut libc::c_void)>;
pub type process_step_callback =
    ::core::option::Option<unsafe extern "C" fn(ctx: *mut libc::c_void)>;
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct libraw_callbacks_t {
    pub data_cb: data_callback,
    pub datacb_data: *mut libc::c_void,
    pub progress_cb: progress_callback,
    pub progresscb_data: *mut libc::c_void,
    pub exif_cb: exif_parser_callback,
    pub exifparser_data: *mut libc::c_void,
    pub pre_identify_cb: pre_identify_callback,
    pub post_identify_cb: post_identify_callback,
    pub pre_subtractblack_cb: process_step_callback,
    pub pre_scalecolors_cb: process_step_callback,
    pub pre_preinterpolate_cb: process_step_callback,
    pub pre_interpolate_cb: process_step_callback,
    pub interpolate_bayer_cb: process_step_callback,
    pub interpolate_xtrans_cb: process_step_callback,
    pub post_interpolate_cb: process_step_callback,
    pub pre_converttorgb_cb: process_step_callback,
    pub post_converttorgb_cb: process_step_callback,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of libraw_callbacks_t"][::core::mem::size_of::<libraw_callbacks_t>() - 136usize];
    ["Alignment of libraw_callbacks_t"][::core::mem::align_of::<libraw_callbacks_t>() - 8usize];
    ["Offset of field: libraw_callbacks_t::data_cb"]
        [::core::mem::offset_of!(libraw_callbacks_t, data_cb) - 0usize];
    ["Offset of field: libraw_callbacks_t::datacb_data"]
        [::core::mem::offset_of!(libraw_callbacks_t, datacb_data) - 8usize];
    ["Offset of field: libraw_callbacks_t::progress_cb"]
        [::core::mem::offset_of!(libraw_callbacks_t, progress_cb) - 16usize];
    ["Offset of field: libraw_callbacks_t::progresscb_data"]
        [::core::mem::offset_of!(libraw_callbacks_t, progresscb_data) - 24usize];
    ["Offset of field: libraw_callbacks_t::exif_cb"]
        [::core::mem::offset_of!(libraw_callbacks_t, exif_cb) - 32usize];
    ["Offset of field: libraw_callbacks_t::exifparser_data"]
        [::core::mem::offset_of!(libraw_callbacks_t, exifparser_data) - 40usize];
    ["Offset of field: libraw_callbacks_t::pre_identify_cb"]
        [::core::mem::offset_of!(libraw_callbacks_t, pre_identify_cb) - 48usize];
    ["Offset of field: libraw_callbacks_t::post_identify_cb"]
        [::core::mem::offset_of!(libraw_callbacks_t, post_identify_cb) - 56usize];
    ["Offset of field: libraw_callbacks_t::pre_subtractblack_cb"]
        [::core::mem::offset_of!(libraw_callbacks_t, pre_subtractblack_cb) - 64usize];
    ["Offset of field: libraw_callbacks_t::pre_scalecolors_cb"]
        [::core::mem::offset_of!(libraw_callbacks_t, pre_scalecolors_cb) - 72usize];
    ["Offset of field: libraw_callbacks_t::pre_preinterpolate_cb"]
        [::core::mem::offset_of!(libraw_callbacks_t, pre_preinterpolate_cb) - 80usize];
    ["Offset of field: libraw_callbacks_t::pre_interpolate_cb"]
        [::core::mem::offset_of!(libraw_callbacks_t, pre_interpolate_cb) - 88usize];
    ["Offset of field: libraw_callbacks_t::interpolate_bayer_cb"]
        [::core::mem::offset_of!(libraw_callbacks_t, interpolate_bayer_cb) - 96usize];
    ["Offset of field: libraw_callbacks_t::interpolate_xtrans_cb"]
        [::core::mem::offset_of!(libraw_callbacks_t, interpolate_xtrans_cb) - 104usize];
    ["Offset of field: libraw_callbacks_t::post_interpolate_cb"]
        [::core::mem::offset_of!(libraw_callbacks_t, post_interpolate_cb) - 112usize];
    ["Offset of field: libraw_callbacks_t::pre_converttorgb_cb"]
        [::core::mem::offset_of!(libraw_callbacks_t, pre_converttorgb_cb) - 120usize];
    ["Offset of field: libraw_callbacks_t::post_converttorgb_cb"]
        [::core::mem::offset_of!(libraw_callbacks_t, post_converttorgb_cb) - 128usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct libraw_processed_image_t {
    pub type_: LibRaw_image_formats,
    pub height: ushort,
    pub width: ushort,
    pub colors: ushort,
    pub bits: ushort,
    pub data_size: libc::c_uint,
    pub data: [libc::c_uchar; 1usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of libraw_processed_image_t"]
        [::core::mem::size_of::<libraw_processed_image_t>() - 20usize];
    ["Alignment of libraw_processed_image_t"]
        [::core::mem::align_of::<libraw_processed_image_t>() - 4usize];
    ["Offset of field: libraw_processed_image_t::type_"]
        [::core::mem::offset_of!(libraw_processed_image_t, type_) - 0usize];
    ["Offset of field: libraw_processed_image_t::height"]
        [::core::mem::offset_of!(libraw_processed_image_t, height) - 4usize];
    ["Offset of field: libraw_processed_image_t::width"]
        [::core::mem::offset_of!(libraw_processed_image_t, width) - 6usize];
    ["Offset of field: libraw_processed_image_t::colors"]
        [::core::mem::offset_of!(libraw_processed_image_t, colors) - 8usize];
    ["Offset of field: libraw_processed_image_t::bits"]
        [::core::mem::offset_of!(libraw_processed_image_t, bits) - 10usize];
    ["Offset of field: libraw_processed_image_t::data_size"]
        [::core::mem::offset_of!(libraw_processed_image_t, data_size) - 12usize];
    ["Offset of field: libraw_processed_image_t::data"]
        [::core::mem::offset_of!(libraw_processed_image_t, data) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct libraw_iparams_t {
    pub guard: [libc::c_char; 4usize],
    pub make: [libc::c_char; 64usize],
    pub model: [libc::c_char; 64usize],
    pub software: [libc::c_char; 64usize],
    pub normalized_make: [libc::c_char; 64usize],
    pub normalized_model: [libc::c_char; 64usize],
    pub maker_index: libc::c_uint,
    pub raw_count: libc::c_uint,
    pub dng_version: libc::c_uint,
    pub is_foveon: libc::c_uint,
    pub colors: libc::c_int,
    pub filters: libc::c_uint,
    pub xtrans: [[libc::c_char; 6usize]; 6usize],
    pub xtrans_abs: [[libc::c_char; 6usize]; 6usize],
    pub cdesc: [libc::c_char; 5usize],
    pub xmplen: libc::c_uint,
    pub xmpdata: *mut libc::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of libraw_iparams_t"][::core::mem::size_of::<libraw_iparams_t>() - 440usize];
    ["Alignment of libraw_iparams_t"][::core::mem::align_of::<libraw_iparams_t>() - 8usize];
    ["Offset of field: libraw_iparams_t::guard"]
        [::core::mem::offset_of!(libraw_iparams_t, guard) - 0usize];
    ["Offset of field: libraw_iparams_t::make"]
        [::core::mem::offset_of!(libraw_iparams_t, make) - 4usize];
    ["Offset of field: libraw_iparams_t::model"]
        [::core::mem::offset_of!(libraw_iparams_t, model) - 68usize];
    ["Offset of field: libraw_iparams_t::software"]
        [::core::mem::offset_of!(libraw_iparams_t, software) - 132usize];
    ["Offset of field: libraw_iparams_t::normalized_make"]
        [::core::mem::offset_of!(libraw_iparams_t, normalized_make) - 196usize];
    ["Offset of field: libraw_iparams_t::normalized_model"]
        [::core::mem::offset_of!(libraw_iparams_t, normalized_model) - 260usize];
    ["Offset of field: libraw_iparams_t::maker_index"]
        [::core::mem::offset_of!(libraw_iparams_t, maker_index) - 324usize];
    ["Offset of field: libraw_iparams_t::raw_count"]
        [::core::mem::offset_of!(libraw_iparams_t, raw_count) - 328usize];
    ["Offset of field: libraw_iparams_t::dng_version"]
        [::core::mem::offset_of!(libraw_iparams_t, dng_version) - 332usize];
    ["Offset of field: libraw_iparams_t::is_foveon"]
        [::core::mem::offset_of!(libraw_iparams_t, is_foveon) - 336usize];
    ["Offset of field: libraw_iparams_t::colors"]
        [::core::mem::offset_of!(libraw_iparams_t, colors) - 340usize];
    ["Offset of field: libraw_iparams_t::filters"]
        [::core::mem::offset_of!(libraw_iparams_t, filters) - 344usize];
    ["Offset of field: libraw_iparams_t::xtrans"]
        [::core::mem::offset_of!(libraw_iparams_t, xtrans) - 348usize];
    ["Offset of field: libraw_iparams_t::xtrans_abs"]
        [::core::mem::offset_of!(libraw_iparams_t, xtrans_abs) - 384usize];
    ["Offset of field: libraw_iparams_t::cdesc"]
        [::core::mem::offset_of!(libraw_iparams_t, cdesc) - 420usize];
    ["Offset of field: libraw_iparams_t::xmplen"]
        [::core::mem::offset_of!(libraw_iparams_t, xmplen) - 428usize];
    ["Offset of field: libraw_iparams_t::xmpdata"]
        [::core::mem::offset_of!(libraw_iparams_t, xmpdata) - 432usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct libraw_raw_inset_crop_t {
    pub cleft: ushort,
    pub ctop: ushort,
    pub cwidth: ushort,
    pub cheight: ushort,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of libraw_raw_inset_crop_t"][::core::mem::size_of::<libraw_raw_inset_crop_t>() - 8usize];
    ["Alignment of libraw_raw_inset_crop_t"]
        [::core::mem::align_of::<libraw_raw_inset_crop_t>() - 2usize];
    ["Offset of field: libraw_raw_inset_crop_t::cleft"]
        [::core::mem::offset_of!(libraw_raw_inset_crop_t, cleft) - 0usize];
    ["Offset of field: libraw_raw_inset_crop_t::ctop"]
        [::core::mem::offset_of!(libraw_raw_inset_crop_t, ctop) - 2usize];
    ["Offset of field: libraw_raw_inset_crop_t::cwidth"]
        [::core::mem::offset_of!(libraw_raw_inset_crop_t, cwidth) - 4usize];
    ["Offset of field: libraw_raw_inset_crop_t::cheight"]
        [::core::mem::offset_of!(libraw_raw_inset_crop_t, cheight) - 6usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq)]
pub struct libraw_image_sizes_t {
    pub raw_height: ushort,
    pub raw_width: ushort,
    pub height: ushort,
    pub width: ushort,
    pub top_margin: ushort,
    pub left_margin: ushort,
    pub iheight: ushort,
    pub iwidth: ushort,
    pub raw_pitch: libc::c_uint,
    pub pixel_aspect: f64,
    pub flip: libc::c_int,
    pub mask: [[libc::c_int; 4usize]; 8usize],
    pub raw_aspect: ushort,
    pub raw_inset_crops: [libraw_raw_inset_crop_t; 2usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of libraw_image_sizes_t"][::core::mem::size_of::<libraw_image_sizes_t>() - 184usize];
    ["Alignment of libraw_image_sizes_t"][::core::mem::align_of::<libraw_image_sizes_t>() - 8usize];
    ["Offset of field: libraw_image_sizes_t::raw_height"]
        [::core::mem::offset_of!(libraw_image_sizes_t, raw_height) - 0usize];
    ["Offset of field: libraw_image_sizes_t::raw_width"]
        [::core::mem::offset_of!(libraw_image_sizes_t, raw_width) - 2usize];
    ["Offset of field: libraw_image_sizes_t::height"]
        [::core::mem::offset_of!(libraw_image_sizes_t, height) - 4usize];
    ["Offset of field: libraw_image_sizes_t::width"]
        [::core::mem::offset_of!(libraw_image_sizes_t, width) - 6usize];
    ["Offset of field: libraw_image_sizes_t::top_margin"]
        [::core::mem::offset_of!(libraw_image_sizes_t, top_margin) - 8usize];
    ["Offset of field: libraw_image_sizes_t::left_margin"]
        [::core::mem::offset_of!(libraw_image_sizes_t, left_margin) - 10usize];
    ["Offset of field: libraw_image_sizes_t::iheight"]
        [::core::mem::offset_of!(libraw_image_sizes_t, iheight) - 12usize];
    ["Offset of field: libraw_image_sizes_t::iwidth"]
        [::core::mem::offset_of!(libraw_image_sizes_t, iwidth) - 14usize];
    ["Offset of field: libraw_image_sizes_t::raw_pitch"]
        [::core::mem::offset_of!(libraw_image_sizes_t, raw_pitch) - 16usize];
    ["Offset of field: libraw_image_sizes_t::pixel_aspect"]
        [::core::mem::offset_of!(libraw_image_sizes_t, pixel_aspect) - 24usize];
    ["Offset of field: libraw_image_sizes_t::flip"]
        [::core::mem::offset_of!(libraw_image_sizes_t, flip) - 32usize];
    ["Offset of field: libraw_image_sizes_t::mask"]
        [::core::mem::offset_of!(libraw_image_sizes_t, mask) - 36usize];
    ["Offset of field: libraw_image_sizes_t::raw_aspect"]
        [::core::mem::offset_of!(libraw_image_sizes_t, raw_aspect) - 164usize];
    ["Offset of field: libraw_image_sizes_t::raw_inset_crops"]
        [::core::mem::offset_of!(libraw_image_sizes_t, raw_inset_crops) - 166usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct libraw_area_t {
    pub t: libc::c_short,
    pub l: libc::c_short,
    pub b: libc::c_short,
    pub r: libc::c_short,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of libraw_area_t"][::core::mem::size_of::<libraw_area_t>() - 8usize];
    ["Alignment of libraw_area_t"][::core::mem::align_of::<libraw_area_t>() - 2usize];
    ["Offset of field: libraw_area_t::t"][::core::mem::offset_of!(libraw_area_t, t) - 0usize];
    ["Offset of field: libraw_area_t::l"][::core::mem::offset_of!(libraw_area_t, l) - 2usize];
    ["Offset of field: libraw_area_t::b"][::core::mem::offset_of!(libraw_area_t, b) - 4usize];
    ["Offset of field: libraw_area_t::r"][::core::mem::offset_of!(libraw_area_t, r) - 6usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq)]
pub struct ph1_t {
    pub format: libc::c_int,
    pub key_off: libc::c_int,
    pub tag_21a: libc::c_int,
    pub t_black: libc::c_int,
    pub split_col: libc::c_int,
    pub black_col: libc::c_int,
    pub split_row: libc::c_int,
    pub black_row: libc::c_int,
    pub tag_210: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ph1_t"][::core::mem::size_of::<ph1_t>() - 36usize];
    ["Alignment of ph1_t"][::core::mem::align_of::<ph1_t>() - 4usize];
    ["Offset of field: ph1_t::format"][::core::mem::offset_of!(ph1_t, format) - 0usize];
    ["Offset of field: ph1_t::key_off"][::core::mem::offset_of!(ph1_t, key_off) - 4usize];
    ["Offset of field: ph1_t::tag_21a"][::core::mem::offset_of!(ph1_t, tag_21a) - 8usize];
    ["Offset of field: ph1_t::t_black"][::core::mem::offset_of!(ph1_t, t_black) - 12usize];
    ["Offset of field: ph1_t::split_col"][::core::mem::offset_of!(ph1_t, split_col) - 16usize];
    ["Offset of field: ph1_t::black_col"][::core::mem::offset_of!(ph1_t, black_col) - 20usize];
    ["Offset of field: ph1_t::split_row"][::core::mem::offset_of!(ph1_t, split_row) - 24usize];
    ["Offset of field: ph1_t::black_row"][::core::mem::offset_of!(ph1_t, black_row) - 28usize];
    ["Offset of field: ph1_t::tag_210"][::core::mem::offset_of!(ph1_t, tag_210) - 32usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq)]
pub struct libraw_dng_color_t {
    pub parsedfields: libc::c_uint,
    pub illuminant: ushort,
    pub calibration: [[f32; 4usize]; 4usize],
    pub colormatrix: [[f32; 3usize]; 4usize],
    pub forwardmatrix: [[f32; 4usize]; 3usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of libraw_dng_color_t"][::core::mem::size_of::<libraw_dng_color_t>() - 168usize];
    ["Alignment of libraw_dng_color_t"][::core::mem::align_of::<libraw_dng_color_t>() - 4usize];
    ["Offset of field: libraw_dng_color_t::parsedfields"]
        [::core::mem::offset_of!(libraw_dng_color_t, parsedfields) - 0usize];
    ["Offset of field: libraw_dng_color_t::illuminant"]
        [::core::mem::offset_of!(libraw_dng_color_t, illuminant) - 4usize];
    ["Offset of field: libraw_dng_color_t::calibration"]
        [::core::mem::offset_of!(libraw_dng_color_t, calibration) - 8usize];
    ["Offset of field: libraw_dng_color_t::colormatrix"]
        [::core::mem::offset_of!(libraw_dng_color_t, colormatrix) - 72usize];
    ["Offset of field: libraw_dng_color_t::forwardmatrix"]
        [::core::mem::offset_of!(libraw_dng_color_t, forwardmatrix) - 120usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq)]
pub struct libraw_dng_levels_t {
    pub parsedfields: libc::c_uint,
    pub dng_cblack: [libc::c_uint; 4104usize],
    pub dng_black: libc::c_uint,
    pub dng_fcblack: [f32; 4104usize],
    pub dng_fblack: f32,
    pub dng_whitelevel: [libc::c_uint; 4usize],
    pub default_crop: [ushort; 4usize],
    pub user_crop: [f32; 4usize],
    pub preview_colorspace: libc::c_uint,
    pub analogbalance: [f32; 4usize],
    pub asshotneutral: [f32; 4usize],
    pub baseline_exposure: f32,
    pub LinearResponseLimit: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of libraw_dng_levels_t"][::core::mem::size_of::<libraw_dng_levels_t>() - 32928usize];
    ["Alignment of libraw_dng_levels_t"][::core::mem::align_of::<libraw_dng_levels_t>() - 4usize];
    ["Offset of field: libraw_dng_levels_t::parsedfields"]
        [::core::mem::offset_of!(libraw_dng_levels_t, parsedfields) - 0usize];
    ["Offset of field: libraw_dng_levels_t::dng_cblack"]
        [::core::mem::offset_of!(libraw_dng_levels_t, dng_cblack) - 4usize];
    ["Offset of field: libraw_dng_levels_t::dng_black"]
        [::core::mem::offset_of!(libraw_dng_levels_t, dng_black) - 16420usize];
    ["Offset of field: libraw_dng_levels_t::dng_fcblack"]
        [::core::mem::offset_of!(libraw_dng_levels_t, dng_fcblack) - 16424usize];
    ["Offset of field: libraw_dng_levels_t::dng_fblack"]
        [::core::mem::offset_of!(libraw_dng_levels_t, dng_fblack) - 32840usize];
    ["Offset of field: libraw_dng_levels_t::dng_whitelevel"]
        [::core::mem::offset_of!(libraw_dng_levels_t, dng_whitelevel) - 32844usize];
    ["Offset of field: libraw_dng_levels_t::default_crop"]
        [::core::mem::offset_of!(libraw_dng_levels_t, default_crop) - 32860usize];
    ["Offset of field: libraw_dng_levels_t::user_crop"]
        [::core::mem::offset_of!(libraw_dng_levels_t, user_crop) - 32868usize];
    ["Offset of field: libraw_dng_levels_t::preview_colorspace"]
        [::core::mem::offset_of!(libraw_dng_levels_t, preview_colorspace) - 32884usize];
    ["Offset of field: libraw_dng_levels_t::analogbalance"]
        [::core::mem::offset_of!(libraw_dng_levels_t, analogbalance) - 32888usize];
    ["Offset of field: libraw_dng_levels_t::asshotneutral"]
        [::core::mem::offset_of!(libraw_dng_levels_t, asshotneutral) - 32904usize];
    ["Offset of field: libraw_dng_levels_t::baseline_exposure"]
        [::core::mem::offset_of!(libraw_dng_levels_t, baseline_exposure) - 32920usize];
    ["Offset of field: libraw_dng_levels_t::LinearResponseLimit"]
        [::core::mem::offset_of!(libraw_dng_levels_t, LinearResponseLimit) - 32924usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq)]
pub struct libraw_P1_color_t {
    pub romm_cam: [f32; 9usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of libraw_P1_color_t"][::core::mem::size_of::<libraw_P1_color_t>() - 36usize];
    ["Alignment of libraw_P1_color_t"][::core::mem::align_of::<libraw_P1_color_t>() - 4usize];
    ["Offset of field: libraw_P1_color_t::romm_cam"]
        [::core::mem::offset_of!(libraw_P1_color_t, romm_cam) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq)]
pub struct libraw_canon_makernotes_t {
    pub ColorDataVer: libc::c_int,
    pub ColorDataSubVer: libc::c_int,
    pub SpecularWhiteLevel: libc::c_int,
    pub NormalWhiteLevel: libc::c_int,
    pub ChannelBlackLevel: [libc::c_int; 4usize],
    pub AverageBlackLevel: libc::c_int,
    pub multishot: [libc::c_uint; 4usize],
    pub MeteringMode: libc::c_short,
    pub SpotMeteringMode: libc::c_short,
    pub FlashMeteringMode: uchar,
    pub FlashExposureLock: libc::c_short,
    pub ExposureMode: libc::c_short,
    pub AESetting: libc::c_short,
    pub ImageStabilization: libc::c_short,
    pub FlashMode: libc::c_short,
    pub FlashActivity: libc::c_short,
    pub FlashBits: libc::c_short,
    pub ManualFlashOutput: libc::c_short,
    pub FlashOutput: libc::c_short,
    pub FlashGuideNumber: libc::c_short,
    pub ContinuousDrive: libc::c_short,
    pub SensorWidth: libc::c_short,
    pub SensorHeight: libc::c_short,
    pub AFMicroAdjMode: libc::c_int,
    pub AFMicroAdjValue: f32,
    pub MakernotesFlip: libc::c_short,
    pub RecordMode: libc::c_short,
    pub SRAWQuality: libc::c_short,
    pub wbi: libc::c_uint,
    pub RF_lensID: libc::c_short,
    pub AutoLightingOptimizer: libc::c_int,
    pub HighlightTonePriority: libc::c_int,
    pub Quality: libc::c_short,
    pub CanonLog: libc::c_int,
    pub DefaultCropAbsolute: libraw_area_t,
    pub RecommendedImageArea: libraw_area_t,
    pub LeftOpticalBlack: libraw_area_t,
    pub UpperOpticalBlack: libraw_area_t,
    pub ActiveArea: libraw_area_t,
    pub ISOgain: [libc::c_short; 2usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of libraw_canon_makernotes_t"]
        [::core::mem::size_of::<libraw_canon_makernotes_t>() - 168usize];
    ["Alignment of libraw_canon_makernotes_t"]
        [::core::mem::align_of::<libraw_canon_makernotes_t>() - 4usize];
    ["Offset of field: libraw_canon_makernotes_t::ColorDataVer"]
        [::core::mem::offset_of!(libraw_canon_makernotes_t, ColorDataVer) - 0usize];
    ["Offset of field: libraw_canon_makernotes_t::ColorDataSubVer"]
        [::core::mem::offset_of!(libraw_canon_makernotes_t, ColorDataSubVer) - 4usize];
    ["Offset of field: libraw_canon_makernotes_t::SpecularWhiteLevel"]
        [::core::mem::offset_of!(libraw_canon_makernotes_t, SpecularWhiteLevel) - 8usize];
    ["Offset of field: libraw_canon_makernotes_t::NormalWhiteLevel"]
        [::core::mem::offset_of!(libraw_canon_makernotes_t, NormalWhiteLevel) - 12usize];
    ["Offset of field: libraw_canon_makernotes_t::ChannelBlackLevel"]
        [::core::mem::offset_of!(libraw_canon_makernotes_t, ChannelBlackLevel) - 16usize];
    ["Offset of field: libraw_canon_makernotes_t::AverageBlackLevel"]
        [::core::mem::offset_of!(libraw_canon_makernotes_t, AverageBlackLevel) - 32usize];
    ["Offset of field: libraw_canon_makernotes_t::multishot"]
        [::core::mem::offset_of!(libraw_canon_makernotes_t, multishot) - 36usize];
    ["Offset of field: libraw_canon_makernotes_t::MeteringMode"]
        [::core::mem::offset_of!(libraw_canon_makernotes_t, MeteringMode) - 52usize];
    ["Offset of field: libraw_canon_makernotes_t::SpotMeteringMode"]
        [::core::mem::offset_of!(libraw_canon_makernotes_t, SpotMeteringMode) - 54usize];
    ["Offset of field: libraw_canon_makernotes_t::FlashMeteringMode"]
        [::core::mem::offset_of!(libraw_canon_makernotes_t, FlashMeteringMode) - 56usize];
    ["Offset of field: libraw_canon_makernotes_t::FlashExposureLock"]
        [::core::mem::offset_of!(libraw_canon_makernotes_t, FlashExposureLock) - 58usize];
    ["Offset of field: libraw_canon_makernotes_t::ExposureMode"]
        [::core::mem::offset_of!(libraw_canon_makernotes_t, ExposureMode) - 60usize];
    ["Offset of field: libraw_canon_makernotes_t::AESetting"]
        [::core::mem::offset_of!(libraw_canon_makernotes_t, AESetting) - 62usize];
    ["Offset of field: libraw_canon_makernotes_t::ImageStabilization"]
        [::core::mem::offset_of!(libraw_canon_makernotes_t, ImageStabilization) - 64usize];
    ["Offset of field: libraw_canon_makernotes_t::FlashMode"]
        [::core::mem::offset_of!(libraw_canon_makernotes_t, FlashMode) - 66usize];
    ["Offset of field: libraw_canon_makernotes_t::FlashActivity"]
        [::core::mem::offset_of!(libraw_canon_makernotes_t, FlashActivity) - 68usize];
    ["Offset of field: libraw_canon_makernotes_t::FlashBits"]
        [::core::mem::offset_of!(libraw_canon_makernotes_t, FlashBits) - 70usize];
    ["Offset of field: libraw_canon_makernotes_t::ManualFlashOutput"]
        [::core::mem::offset_of!(libraw_canon_makernotes_t, ManualFlashOutput) - 72usize];
    ["Offset of field: libraw_canon_makernotes_t::FlashOutput"]
        [::core::mem::offset_of!(libraw_canon_makernotes_t, FlashOutput) - 74usize];
    ["Offset of field: libraw_canon_makernotes_t::FlashGuideNumber"]
        [::core::mem::offset_of!(libraw_canon_makernotes_t, FlashGuideNumber) - 76usize];
    ["Offset of field: libraw_canon_makernotes_t::ContinuousDrive"]
        [::core::mem::offset_of!(libraw_canon_makernotes_t, ContinuousDrive) - 78usize];
    ["Offset of field: libraw_canon_makernotes_t::SensorWidth"]
        [::core::mem::offset_of!(libraw_canon_makernotes_t, SensorWidth) - 80usize];
    ["Offset of field: libraw_canon_makernotes_t::SensorHeight"]
        [::core::mem::offset_of!(libraw_canon_makernotes_t, SensorHeight) - 82usize];
    ["Offset of field: libraw_canon_makernotes_t::AFMicroAdjMode"]
        [::core::mem::offset_of!(libraw_canon_makernotes_t, AFMicroAdjMode) - 84usize];
    ["Offset of field: libraw_canon_makernotes_t::AFMicroAdjValue"]
        [::core::mem::offset_of!(libraw_canon_makernotes_t, AFMicroAdjValue) - 88usize];
    ["Offset of field: libraw_canon_makernotes_t::MakernotesFlip"]
        [::core::mem::offset_of!(libraw_canon_makernotes_t, MakernotesFlip) - 92usize];
    ["Offset of field: libraw_canon_makernotes_t::RecordMode"]
        [::core::mem::offset_of!(libraw_canon_makernotes_t, RecordMode) - 94usize];
    ["Offset of field: libraw_canon_makernotes_t::SRAWQuality"]
        [::core::mem::offset_of!(libraw_canon_makernotes_t, SRAWQuality) - 96usize];
    ["Offset of field: libraw_canon_makernotes_t::wbi"]
        [::core::mem::offset_of!(libraw_canon_makernotes_t, wbi) - 100usize];
    ["Offset of field: libraw_canon_makernotes_t::RF_lensID"]
        [::core::mem::offset_of!(libraw_canon_makernotes_t, RF_lensID) - 104usize];
    ["Offset of field: libraw_canon_makernotes_t::AutoLightingOptimizer"]
        [::core::mem::offset_of!(libraw_canon_makernotes_t, AutoLightingOptimizer) - 108usize];
    ["Offset of field: libraw_canon_makernotes_t::HighlightTonePriority"]
        [::core::mem::offset_of!(libraw_canon_makernotes_t, HighlightTonePriority) - 112usize];
    ["Offset of field: libraw_canon_makernotes_t::Quality"]
        [::core::mem::offset_of!(libraw_canon_makernotes_t, Quality) - 116usize];
    ["Offset of field: libraw_canon_makernotes_t::CanonLog"]
        [::core::mem::offset_of!(libraw_canon_makernotes_t, CanonLog) - 120usize];
    ["Offset of field: libraw_canon_makernotes_t::DefaultCropAbsolute"]
        [::core::mem::offset_of!(libraw_canon_makernotes_t, DefaultCropAbsolute) - 124usize];
    ["Offset of field: libraw_canon_makernotes_t::RecommendedImageArea"]
        [::core::mem::offset_of!(libraw_canon_makernotes_t, RecommendedImageArea) - 132usize];
    ["Offset of field: libraw_canon_makernotes_t::LeftOpticalBlack"]
        [::core::mem::offset_of!(libraw_canon_makernotes_t, LeftOpticalBlack) - 140usize];
    ["Offset of field: libraw_canon_makernotes_t::UpperOpticalBlack"]
        [::core::mem::offset_of!(libraw_canon_makernotes_t, UpperOpticalBlack) - 148usize];
    ["Offset of field: libraw_canon_makernotes_t::ActiveArea"]
        [::core::mem::offset_of!(libraw_canon_makernotes_t, ActiveArea) - 156usize];
    ["Offset of field: libraw_canon_makernotes_t::ISOgain"]
        [::core::mem::offset_of!(libraw_canon_makernotes_t, ISOgain) - 164usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq)]
pub struct libraw_hasselblad_makernotes_t {
    pub BaseISO: libc::c_int,
    pub Gain: f64,
    pub Sensor: [libc::c_char; 8usize],
    pub SensorUnit: [libc::c_char; 64usize],
    pub HostBody: [libc::c_char; 64usize],
    pub SensorCode: libc::c_int,
    pub SensorSubCode: libc::c_int,
    pub CoatingCode: libc::c_int,
    pub uncropped: libc::c_int,
    pub CaptureSequenceInitiator: [libc::c_char; 32usize],
    pub SensorUnitConnector: [libc::c_char; 64usize],
    pub format: libc::c_int,
    pub nIFD_CM: [libc::c_int; 2usize],
    pub RecommendedCrop: [libc::c_int; 2usize],
    pub mnColorMatrix: [[f64; 3usize]; 4usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of libraw_hasselblad_makernotes_t"]
        [::core::mem::size_of::<libraw_hasselblad_makernotes_t>() - 384usize];
    ["Alignment of libraw_hasselblad_makernotes_t"]
        [::core::mem::align_of::<libraw_hasselblad_makernotes_t>() - 8usize];
    ["Offset of field: libraw_hasselblad_makernotes_t::BaseISO"]
        [::core::mem::offset_of!(libraw_hasselblad_makernotes_t, BaseISO) - 0usize];
    ["Offset of field: libraw_hasselblad_makernotes_t::Gain"]
        [::core::mem::offset_of!(libraw_hasselblad_makernotes_t, Gain) - 8usize];
    ["Offset of field: libraw_hasselblad_makernotes_t::Sensor"]
        [::core::mem::offset_of!(libraw_hasselblad_makernotes_t, Sensor) - 16usize];
    ["Offset of field: libraw_hasselblad_makernotes_t::SensorUnit"]
        [::core::mem::offset_of!(libraw_hasselblad_makernotes_t, SensorUnit) - 24usize];
    ["Offset of field: libraw_hasselblad_makernotes_t::HostBody"]
        [::core::mem::offset_of!(libraw_hasselblad_makernotes_t, HostBody) - 88usize];
    ["Offset of field: libraw_hasselblad_makernotes_t::SensorCode"]
        [::core::mem::offset_of!(libraw_hasselblad_makernotes_t, SensorCode) - 152usize];
    ["Offset of field: libraw_hasselblad_makernotes_t::SensorSubCode"]
        [::core::mem::offset_of!(libraw_hasselblad_makernotes_t, SensorSubCode) - 156usize];
    ["Offset of field: libraw_hasselblad_makernotes_t::CoatingCode"]
        [::core::mem::offset_of!(libraw_hasselblad_makernotes_t, CoatingCode) - 160usize];
    ["Offset of field: libraw_hasselblad_makernotes_t::uncropped"]
        [::core::mem::offset_of!(libraw_hasselblad_makernotes_t, uncropped) - 164usize];
    ["Offset of field: libraw_hasselblad_makernotes_t::CaptureSequenceInitiator"][::core::mem::offset_of!(
        libraw_hasselblad_makernotes_t,
        CaptureSequenceInitiator
    ) - 168usize];
    ["Offset of field: libraw_hasselblad_makernotes_t::SensorUnitConnector"]
        [::core::mem::offset_of!(libraw_hasselblad_makernotes_t, SensorUnitConnector) - 200usize];
    ["Offset of field: libraw_hasselblad_makernotes_t::format"]
        [::core::mem::offset_of!(libraw_hasselblad_makernotes_t, format) - 264usize];
    ["Offset of field: libraw_hasselblad_makernotes_t::nIFD_CM"]
        [::core::mem::offset_of!(libraw_hasselblad_makernotes_t, nIFD_CM) - 268usize];
    ["Offset of field: libraw_hasselblad_makernotes_t::RecommendedCrop"]
        [::core::mem::offset_of!(libraw_hasselblad_makernotes_t, RecommendedCrop) - 276usize];
    ["Offset of field: libraw_hasselblad_makernotes_t::mnColorMatrix"]
        [::core::mem::offset_of!(libraw_hasselblad_makernotes_t, mnColorMatrix) - 288usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq)]
pub struct libraw_fuji_info_t {
    pub ExpoMidPointShift: f32,
    pub DynamicRange: ushort,
    pub FilmMode: ushort,
    pub DynamicRangeSetting: ushort,
    pub DevelopmentDynamicRange: ushort,
    pub AutoDynamicRange: ushort,
    pub DRangePriority: ushort,
    pub DRangePriorityAuto: ushort,
    pub DRangePriorityFixed: ushort,
    pub BrightnessCompensation: f32,
    pub FocusMode: ushort,
    pub AFMode: ushort,
    pub FocusPixel: [ushort; 2usize],
    pub PrioritySettings: ushort,
    pub FocusSettings: libc::c_uint,
    pub AF_C_Settings: libc::c_uint,
    pub FocusWarning: ushort,
    pub ImageStabilization: [ushort; 3usize],
    pub FlashMode: ushort,
    pub WB_Preset: ushort,
    pub ShutterType: ushort,
    pub ExrMode: ushort,
    pub Macro: ushort,
    pub Rating: libc::c_uint,
    pub CropMode: ushort,
    pub SerialSignature: [libc::c_char; 13usize],
    pub SensorID: [libc::c_char; 5usize],
    pub RAFVersion: [libc::c_char; 5usize],
    pub RAFDataGeneration: libc::c_int,
    pub RAFDataVersion: ushort,
    pub isTSNERDTS: libc::c_int,
    pub DriveMode: libc::c_short,
    pub BlackLevel: [ushort; 9usize],
    pub RAFData_ImageSizeTable: [libc::c_uint; 32usize],
    pub AutoBracketing: libc::c_int,
    pub SequenceNumber: libc::c_int,
    pub SeriesLength: libc::c_int,
    pub PixelShiftOffset: [f32; 2usize],
    pub ImageCount: libc::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of libraw_fuji_info_t"][::core::mem::size_of::<libraw_fuji_info_t>() - 280usize];
    ["Alignment of libraw_fuji_info_t"][::core::mem::align_of::<libraw_fuji_info_t>() - 4usize];
    ["Offset of field: libraw_fuji_info_t::ExpoMidPointShift"]
        [::core::mem::offset_of!(libraw_fuji_info_t, ExpoMidPointShift) - 0usize];
    ["Offset of field: libraw_fuji_info_t::DynamicRange"]
        [::core::mem::offset_of!(libraw_fuji_info_t, DynamicRange) - 4usize];
    ["Offset of field: libraw_fuji_info_t::FilmMode"]
        [::core::mem::offset_of!(libraw_fuji_info_t, FilmMode) - 6usize];
    ["Offset of field: libraw_fuji_info_t::DynamicRangeSetting"]
        [::core::mem::offset_of!(libraw_fuji_info_t, DynamicRangeSetting) - 8usize];
    ["Offset of field: libraw_fuji_info_t::DevelopmentDynamicRange"]
        [::core::mem::offset_of!(libraw_fuji_info_t, DevelopmentDynamicRange) - 10usize];
    ["Offset of field: libraw_fuji_info_t::AutoDynamicRange"]
        [::core::mem::offset_of!(libraw_fuji_info_t, AutoDynamicRange) - 12usize];
    ["Offset of field: libraw_fuji_info_t::DRangePriority"]
        [::core::mem::offset_of!(libraw_fuji_info_t, DRangePriority) - 14usize];
    ["Offset of field: libraw_fuji_info_t::DRangePriorityAuto"]
        [::core::mem::offset_of!(libraw_fuji_info_t, DRangePriorityAuto) - 16usize];
    ["Offset of field: libraw_fuji_info_t::DRangePriorityFixed"]
        [::core::mem::offset_of!(libraw_fuji_info_t, DRangePriorityFixed) - 18usize];
    ["Offset of field: libraw_fuji_info_t::BrightnessCompensation"]
        [::core::mem::offset_of!(libraw_fuji_info_t, BrightnessCompensation) - 20usize];
    ["Offset of field: libraw_fuji_info_t::FocusMode"]
        [::core::mem::offset_of!(libraw_fuji_info_t, FocusMode) - 24usize];
    ["Offset of field: libraw_fuji_info_t::AFMode"]
        [::core::mem::offset_of!(libraw_fuji_info_t, AFMode) - 26usize];
    ["Offset of field: libraw_fuji_info_t::FocusPixel"]
        [::core::mem::offset_of!(libraw_fuji_info_t, FocusPixel) - 28usize];
    ["Offset of field: libraw_fuji_info_t::PrioritySettings"]
        [::core::mem::offset_of!(libraw_fuji_info_t, PrioritySettings) - 32usize];
    ["Offset of field: libraw_fuji_info_t::FocusSettings"]
        [::core::mem::offset_of!(libraw_fuji_info_t, FocusSettings) - 36usize];
    ["Offset of field: libraw_fuji_info_t::AF_C_Settings"]
        [::core::mem::offset_of!(libraw_fuji_info_t, AF_C_Settings) - 40usize];
    ["Offset of field: libraw_fuji_info_t::FocusWarning"]
        [::core::mem::offset_of!(libraw_fuji_info_t, FocusWarning) - 44usize];
    ["Offset of field: libraw_fuji_info_t::ImageStabilization"]
        [::core::mem::offset_of!(libraw_fuji_info_t, ImageStabilization) - 46usize];
    ["Offset of field: libraw_fuji_info_t::FlashMode"]
        [::core::mem::offset_of!(libraw_fuji_info_t, FlashMode) - 52usize];
    ["Offset of field: libraw_fuji_info_t::WB_Preset"]
        [::core::mem::offset_of!(libraw_fuji_info_t, WB_Preset) - 54usize];
    ["Offset of field: libraw_fuji_info_t::ShutterType"]
        [::core::mem::offset_of!(libraw_fuji_info_t, ShutterType) - 56usize];
    ["Offset of field: libraw_fuji_info_t::ExrMode"]
        [::core::mem::offset_of!(libraw_fuji_info_t, ExrMode) - 58usize];
    ["Offset of field: libraw_fuji_info_t::Macro"]
        [::core::mem::offset_of!(libraw_fuji_info_t, Macro) - 60usize];
    ["Offset of field: libraw_fuji_info_t::Rating"]
        [::core::mem::offset_of!(libraw_fuji_info_t, Rating) - 64usize];
    ["Offset of field: libraw_fuji_info_t::CropMode"]
        [::core::mem::offset_of!(libraw_fuji_info_t, CropMode) - 68usize];
    ["Offset of field: libraw_fuji_info_t::SerialSignature"]
        [::core::mem::offset_of!(libraw_fuji_info_t, SerialSignature) - 70usize];
    ["Offset of field: libraw_fuji_info_t::SensorID"]
        [::core::mem::offset_of!(libraw_fuji_info_t, SensorID) - 83usize];
    ["Offset of field: libraw_fuji_info_t::RAFVersion"]
        [::core::mem::offset_of!(libraw_fuji_info_t, RAFVersion) - 88usize];
    ["Offset of field: libraw_fuji_info_t::RAFDataGeneration"]
        [::core::mem::offset_of!(libraw_fuji_info_t, RAFDataGeneration) - 96usize];
    ["Offset of field: libraw_fuji_info_t::RAFDataVersion"]
        [::core::mem::offset_of!(libraw_fuji_info_t, RAFDataVersion) - 100usize];
    ["Offset of field: libraw_fuji_info_t::isTSNERDTS"]
        [::core::mem::offset_of!(libraw_fuji_info_t, isTSNERDTS) - 104usize];
    ["Offset of field: libraw_fuji_info_t::DriveMode"]
        [::core::mem::offset_of!(libraw_fuji_info_t, DriveMode) - 108usize];
    ["Offset of field: libraw_fuji_info_t::BlackLevel"]
        [::core::mem::offset_of!(libraw_fuji_info_t, BlackLevel) - 110usize];
    ["Offset of field: libraw_fuji_info_t::RAFData_ImageSizeTable"]
        [::core::mem::offset_of!(libraw_fuji_info_t, RAFData_ImageSizeTable) - 128usize];
    ["Offset of field: libraw_fuji_info_t::AutoBracketing"]
        [::core::mem::offset_of!(libraw_fuji_info_t, AutoBracketing) - 256usize];
    ["Offset of field: libraw_fuji_info_t::SequenceNumber"]
        [::core::mem::offset_of!(libraw_fuji_info_t, SequenceNumber) - 260usize];
    ["Offset of field: libraw_fuji_info_t::SeriesLength"]
        [::core::mem::offset_of!(libraw_fuji_info_t, SeriesLength) - 264usize];
    ["Offset of field: libraw_fuji_info_t::PixelShiftOffset"]
        [::core::mem::offset_of!(libraw_fuji_info_t, PixelShiftOffset) - 268usize];
    ["Offset of field: libraw_fuji_info_t::ImageCount"]
        [::core::mem::offset_of!(libraw_fuji_info_t, ImageCount) - 276usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct libraw_sensor_highspeed_crop_t {
    pub cleft: ushort,
    pub ctop: ushort,
    pub cwidth: ushort,
    pub cheight: ushort,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of libraw_sensor_highspeed_crop_t"]
        [::core::mem::size_of::<libraw_sensor_highspeed_crop_t>() - 8usize];
    ["Alignment of libraw_sensor_highspeed_crop_t"]
        [::core::mem::align_of::<libraw_sensor_highspeed_crop_t>() - 2usize];
    ["Offset of field: libraw_sensor_highspeed_crop_t::cleft"]
        [::core::mem::offset_of!(libraw_sensor_highspeed_crop_t, cleft) - 0usize];
    ["Offset of field: libraw_sensor_highspeed_crop_t::ctop"]
        [::core::mem::offset_of!(libraw_sensor_highspeed_crop_t, ctop) - 2usize];
    ["Offset of field: libraw_sensor_highspeed_crop_t::cwidth"]
        [::core::mem::offset_of!(libraw_sensor_highspeed_crop_t, cwidth) - 4usize];
    ["Offset of field: libraw_sensor_highspeed_crop_t::cheight"]
        [::core::mem::offset_of!(libraw_sensor_highspeed_crop_t, cheight) - 6usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq)]
pub struct libraw_nikon_makernotes_t {
    pub ExposureBracketValue: f64,
    pub ActiveDLighting: ushort,
    pub ShootingMode: ushort,
    pub ImageStabilization: [uchar; 7usize],
    pub VibrationReduction: uchar,
    pub VRMode: uchar,
    pub FlashSetting: [libc::c_char; 13usize],
    pub FlashType: [libc::c_char; 20usize],
    pub FlashExposureCompensation: [uchar; 4usize],
    pub ExternalFlashExposureComp: [uchar; 4usize],
    pub FlashExposureBracketValue: [uchar; 4usize],
    pub FlashMode: uchar,
    pub FlashExposureCompensation2: libc::c_schar,
    pub FlashExposureCompensation3: libc::c_schar,
    pub FlashExposureCompensation4: libc::c_schar,
    pub FlashSource: uchar,
    pub FlashFirmware: [uchar; 2usize],
    pub ExternalFlashFlags: uchar,
    pub FlashControlCommanderMode: uchar,
    pub FlashOutputAndCompensation: uchar,
    pub FlashFocalLength: uchar,
    pub FlashGNDistance: uchar,
    pub FlashGroupControlMode: [uchar; 4usize],
    pub FlashGroupOutputAndCompensation: [uchar; 4usize],
    pub FlashColorFilter: uchar,
    pub NEFCompression: ushort,
    pub ExposureMode: libc::c_int,
    pub ExposureProgram: libc::c_int,
    pub nMEshots: libc::c_int,
    pub MEgainOn: libc::c_int,
    pub ME_WB: [f64; 4usize],
    pub AFFineTune: uchar,
    pub AFFineTuneIndex: uchar,
    pub AFFineTuneAdj: i8,
    pub LensDataVersion: libc::c_uint,
    pub FlashInfoVersion: libc::c_uint,
    pub ColorBalanceVersion: libc::c_uint,
    pub key: uchar,
    pub NEFBitDepth: [ushort; 4usize],
    pub HighSpeedCropFormat: ushort,
    pub SensorHighSpeedCrop: libraw_sensor_highspeed_crop_t,
    pub SensorWidth: ushort,
    pub SensorHeight: ushort,
    pub Active_D_Lighting: ushort,
    pub ShotInfoVersion: libc::c_uint,
    pub MakernotesFlip: libc::c_short,
    pub RollAngle: f64,
    pub PitchAngle: f64,
    pub YawAngle: f64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of libraw_nikon_makernotes_t"]
        [::core::mem::size_of::<libraw_nikon_makernotes_t>() - 224usize];
    ["Alignment of libraw_nikon_makernotes_t"]
        [::core::mem::align_of::<libraw_nikon_makernotes_t>() - 8usize];
    ["Offset of field: libraw_nikon_makernotes_t::ExposureBracketValue"]
        [::core::mem::offset_of!(libraw_nikon_makernotes_t, ExposureBracketValue) - 0usize];
    ["Offset of field: libraw_nikon_makernotes_t::ActiveDLighting"]
        [::core::mem::offset_of!(libraw_nikon_makernotes_t, ActiveDLighting) - 8usize];
    ["Offset of field: libraw_nikon_makernotes_t::ShootingMode"]
        [::core::mem::offset_of!(libraw_nikon_makernotes_t, ShootingMode) - 10usize];
    ["Offset of field: libraw_nikon_makernotes_t::ImageStabilization"]
        [::core::mem::offset_of!(libraw_nikon_makernotes_t, ImageStabilization) - 12usize];
    ["Offset of field: libraw_nikon_makernotes_t::VibrationReduction"]
        [::core::mem::offset_of!(libraw_nikon_makernotes_t, VibrationReduction) - 19usize];
    ["Offset of field: libraw_nikon_makernotes_t::VRMode"]
        [::core::mem::offset_of!(libraw_nikon_makernotes_t, VRMode) - 20usize];
    ["Offset of field: libraw_nikon_makernotes_t::FlashSetting"]
        [::core::mem::offset_of!(libraw_nikon_makernotes_t, FlashSetting) - 21usize];
    ["Offset of field: libraw_nikon_makernotes_t::FlashType"]
        [::core::mem::offset_of!(libraw_nikon_makernotes_t, FlashType) - 34usize];
    ["Offset of field: libraw_nikon_makernotes_t::FlashExposureCompensation"]
        [::core::mem::offset_of!(libraw_nikon_makernotes_t, FlashExposureCompensation) - 54usize];
    ["Offset of field: libraw_nikon_makernotes_t::ExternalFlashExposureComp"]
        [::core::mem::offset_of!(libraw_nikon_makernotes_t, ExternalFlashExposureComp) - 58usize];
    ["Offset of field: libraw_nikon_makernotes_t::FlashExposureBracketValue"]
        [::core::mem::offset_of!(libraw_nikon_makernotes_t, FlashExposureBracketValue) - 62usize];
    ["Offset of field: libraw_nikon_makernotes_t::FlashMode"]
        [::core::mem::offset_of!(libraw_nikon_makernotes_t, FlashMode) - 66usize];
    ["Offset of field: libraw_nikon_makernotes_t::FlashExposureCompensation2"]
        [::core::mem::offset_of!(libraw_nikon_makernotes_t, FlashExposureCompensation2) - 67usize];
    ["Offset of field: libraw_nikon_makernotes_t::FlashExposureCompensation3"]
        [::core::mem::offset_of!(libraw_nikon_makernotes_t, FlashExposureCompensation3) - 68usize];
    ["Offset of field: libraw_nikon_makernotes_t::FlashExposureCompensation4"]
        [::core::mem::offset_of!(libraw_nikon_makernotes_t, FlashExposureCompensation4) - 69usize];
    ["Offset of field: libraw_nikon_makernotes_t::FlashSource"]
        [::core::mem::offset_of!(libraw_nikon_makernotes_t, FlashSource) - 70usize];
    ["Offset of field: libraw_nikon_makernotes_t::FlashFirmware"]
        [::core::mem::offset_of!(libraw_nikon_makernotes_t, FlashFirmware) - 71usize];
    ["Offset of field: libraw_nikon_makernotes_t::ExternalFlashFlags"]
        [::core::mem::offset_of!(libraw_nikon_makernotes_t, ExternalFlashFlags) - 73usize];
    ["Offset of field: libraw_nikon_makernotes_t::FlashControlCommanderMode"]
        [::core::mem::offset_of!(libraw_nikon_makernotes_t, FlashControlCommanderMode) - 74usize];
    ["Offset of field: libraw_nikon_makernotes_t::FlashOutputAndCompensation"]
        [::core::mem::offset_of!(libraw_nikon_makernotes_t, FlashOutputAndCompensation) - 75usize];
    ["Offset of field: libraw_nikon_makernotes_t::FlashFocalLength"]
        [::core::mem::offset_of!(libraw_nikon_makernotes_t, FlashFocalLength) - 76usize];
    ["Offset of field: libraw_nikon_makernotes_t::FlashGNDistance"]
        [::core::mem::offset_of!(libraw_nikon_makernotes_t, FlashGNDistance) - 77usize];
    ["Offset of field: libraw_nikon_makernotes_t::FlashGroupControlMode"]
        [::core::mem::offset_of!(libraw_nikon_makernotes_t, FlashGroupControlMode) - 78usize];
    ["Offset of field: libraw_nikon_makernotes_t::FlashGroupOutputAndCompensation"][::core::mem::offset_of!(
        libraw_nikon_makernotes_t,
        FlashGroupOutputAndCompensation
    ) - 82usize];
    ["Offset of field: libraw_nikon_makernotes_t::FlashColorFilter"]
        [::core::mem::offset_of!(libraw_nikon_makernotes_t, FlashColorFilter) - 86usize];
    ["Offset of field: libraw_nikon_makernotes_t::NEFCompression"]
        [::core::mem::offset_of!(libraw_nikon_makernotes_t, NEFCompression) - 88usize];
    ["Offset of field: libraw_nikon_makernotes_t::ExposureMode"]
        [::core::mem::offset_of!(libraw_nikon_makernotes_t, ExposureMode) - 92usize];
    ["Offset of field: libraw_nikon_makernotes_t::ExposureProgram"]
        [::core::mem::offset_of!(libraw_nikon_makernotes_t, ExposureProgram) - 96usize];
    ["Offset of field: libraw_nikon_makernotes_t::nMEshots"]
        [::core::mem::offset_of!(libraw_nikon_makernotes_t, nMEshots) - 100usize];
    ["Offset of field: libraw_nikon_makernotes_t::MEgainOn"]
        [::core::mem::offset_of!(libraw_nikon_makernotes_t, MEgainOn) - 104usize];
    ["Offset of field: libraw_nikon_makernotes_t::ME_WB"]
        [::core::mem::offset_of!(libraw_nikon_makernotes_t, ME_WB) - 112usize];
    ["Offset of field: libraw_nikon_makernotes_t::AFFineTune"]
        [::core::mem::offset_of!(libraw_nikon_makernotes_t, AFFineTune) - 144usize];
    ["Offset of field: libraw_nikon_makernotes_t::AFFineTuneIndex"]
        [::core::mem::offset_of!(libraw_nikon_makernotes_t, AFFineTuneIndex) - 145usize];
    ["Offset of field: libraw_nikon_makernotes_t::AFFineTuneAdj"]
        [::core::mem::offset_of!(libraw_nikon_makernotes_t, AFFineTuneAdj) - 146usize];
    ["Offset of field: libraw_nikon_makernotes_t::LensDataVersion"]
        [::core::mem::offset_of!(libraw_nikon_makernotes_t, LensDataVersion) - 148usize];
    ["Offset of field: libraw_nikon_makernotes_t::FlashInfoVersion"]
        [::core::mem::offset_of!(libraw_nikon_makernotes_t, FlashInfoVersion) - 152usize];
    ["Offset of field: libraw_nikon_makernotes_t::ColorBalanceVersion"]
        [::core::mem::offset_of!(libraw_nikon_makernotes_t, ColorBalanceVersion) - 156usize];
    ["Offset of field: libraw_nikon_makernotes_t::key"]
        [::core::mem::offset_of!(libraw_nikon_makernotes_t, key) - 160usize];
    ["Offset of field: libraw_nikon_makernotes_t::NEFBitDepth"]
        [::core::mem::offset_of!(libraw_nikon_makernotes_t, NEFBitDepth) - 162usize];
    ["Offset of field: libraw_nikon_makernotes_t::HighSpeedCropFormat"]
        [::core::mem::offset_of!(libraw_nikon_makernotes_t, HighSpeedCropFormat) - 170usize];
    ["Offset of field: libraw_nikon_makernotes_t::SensorHighSpeedCrop"]
        [::core::mem::offset_of!(libraw_nikon_makernotes_t, SensorHighSpeedCrop) - 172usize];
    ["Offset of field: libraw_nikon_makernotes_t::SensorWidth"]
        [::core::mem::offset_of!(libraw_nikon_makernotes_t, SensorWidth) - 180usize];
    ["Offset of field: libraw_nikon_makernotes_t::SensorHeight"]
        [::core::mem::offset_of!(libraw_nikon_makernotes_t, SensorHeight) - 182usize];
    ["Offset of field: libraw_nikon_makernotes_t::Active_D_Lighting"]
        [::core::mem::offset_of!(libraw_nikon_makernotes_t, Active_D_Lighting) - 184usize];
    ["Offset of field: libraw_nikon_makernotes_t::ShotInfoVersion"]
        [::core::mem::offset_of!(libraw_nikon_makernotes_t, ShotInfoVersion) - 188usize];
    ["Offset of field: libraw_nikon_makernotes_t::MakernotesFlip"]
        [::core::mem::offset_of!(libraw_nikon_makernotes_t, MakernotesFlip) - 192usize];
    ["Offset of field: libraw_nikon_makernotes_t::RollAngle"]
        [::core::mem::offset_of!(libraw_nikon_makernotes_t, RollAngle) - 200usize];
    ["Offset of field: libraw_nikon_makernotes_t::PitchAngle"]
        [::core::mem::offset_of!(libraw_nikon_makernotes_t, PitchAngle) - 208usize];
    ["Offset of field: libraw_nikon_makernotes_t::YawAngle"]
        [::core::mem::offset_of!(libraw_nikon_makernotes_t, YawAngle) - 216usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq)]
pub struct libraw_olympus_makernotes_t {
    pub CameraType2: [libc::c_char; 6usize],
    pub ValidBits: ushort,
    pub SensorCalibration: [libc::c_int; 2usize],
    pub DriveMode: [ushort; 5usize],
    pub ColorSpace: ushort,
    pub FocusMode: [ushort; 2usize],
    pub AutoFocus: ushort,
    pub AFPoint: ushort,
    pub AFAreas: [libc::c_uint; 64usize],
    pub AFPointSelected: [f64; 5usize],
    pub AFResult: ushort,
    pub AFFineTune: uchar,
    pub AFFineTuneAdj: [libc::c_short; 3usize],
    pub SpecialMode: [libc::c_uint; 3usize],
    pub ZoomStepCount: ushort,
    pub FocusStepCount: ushort,
    pub FocusStepInfinity: ushort,
    pub FocusStepNear: ushort,
    pub FocusDistance: f64,
    pub AspectFrame: [ushort; 4usize],
    pub StackedImage: [libc::c_uint; 2usize],
    pub isLiveND: uchar,
    pub LiveNDfactor: libc::c_uint,
    pub Panorama_mode: ushort,
    pub Panorama_frameNum: ushort,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of libraw_olympus_makernotes_t"]
        [::core::mem::size_of::<libraw_olympus_makernotes_t>() - 408usize];
    ["Alignment of libraw_olympus_makernotes_t"]
        [::core::mem::align_of::<libraw_olympus_makernotes_t>() - 8usize];
    ["Offset of field: libraw_olympus_makernotes_t::CameraType2"]
        [::core::mem::offset_of!(libraw_olympus_makernotes_t, CameraType2) - 0usize];
    ["Offset of field: libraw_olympus_makernotes_t::ValidBits"]
        [::core::mem::offset_of!(libraw_olympus_makernotes_t, ValidBits) - 6usize];
    ["Offset of field: libraw_olympus_makernotes_t::SensorCalibration"]
        [::core::mem::offset_of!(libraw_olympus_makernotes_t, SensorCalibration) - 8usize];
    ["Offset of field: libraw_olympus_makernotes_t::DriveMode"]
        [::core::mem::offset_of!(libraw_olympus_makernotes_t, DriveMode) - 16usize];
    ["Offset of field: libraw_olympus_makernotes_t::ColorSpace"]
        [::core::mem::offset_of!(libraw_olympus_makernotes_t, ColorSpace) - 26usize];
    ["Offset of field: libraw_olympus_makernotes_t::FocusMode"]
        [::core::mem::offset_of!(libraw_olympus_makernotes_t, FocusMode) - 28usize];
    ["Offset of field: libraw_olympus_makernotes_t::AutoFocus"]
        [::core::mem::offset_of!(libraw_olympus_makernotes_t, AutoFocus) - 32usize];
    ["Offset of field: libraw_olympus_makernotes_t::AFPoint"]
        [::core::mem::offset_of!(libraw_olympus_makernotes_t, AFPoint) - 34usize];
    ["Offset of field: libraw_olympus_makernotes_t::AFAreas"]
        [::core::mem::offset_of!(libraw_olympus_makernotes_t, AFAreas) - 36usize];
    ["Offset of field: libraw_olympus_makernotes_t::AFPointSelected"]
        [::core::mem::offset_of!(libraw_olympus_makernotes_t, AFPointSelected) - 296usize];
    ["Offset of field: libraw_olympus_makernotes_t::AFResult"]
        [::core::mem::offset_of!(libraw_olympus_makernotes_t, AFResult) - 336usize];
    ["Offset of field: libraw_olympus_makernotes_t::AFFineTune"]
        [::core::mem::offset_of!(libraw_olympus_makernotes_t, AFFineTune) - 338usize];
    ["Offset of field: libraw_olympus_makernotes_t::AFFineTuneAdj"]
        [::core::mem::offset_of!(libraw_olympus_makernotes_t, AFFineTuneAdj) - 340usize];
    ["Offset of field: libraw_olympus_makernotes_t::SpecialMode"]
        [::core::mem::offset_of!(libraw_olympus_makernotes_t, SpecialMode) - 348usize];
    ["Offset of field: libraw_olympus_makernotes_t::ZoomStepCount"]
        [::core::mem::offset_of!(libraw_olympus_makernotes_t, ZoomStepCount) - 360usize];
    ["Offset of field: libraw_olympus_makernotes_t::FocusStepCount"]
        [::core::mem::offset_of!(libraw_olympus_makernotes_t, FocusStepCount) - 362usize];
    ["Offset of field: libraw_olympus_makernotes_t::FocusStepInfinity"]
        [::core::mem::offset_of!(libraw_olympus_makernotes_t, FocusStepInfinity) - 364usize];
    ["Offset of field: libraw_olympus_makernotes_t::FocusStepNear"]
        [::core::mem::offset_of!(libraw_olympus_makernotes_t, FocusStepNear) - 366usize];
    ["Offset of field: libraw_olympus_makernotes_t::FocusDistance"]
        [::core::mem::offset_of!(libraw_olympus_makernotes_t, FocusDistance) - 368usize];
    ["Offset of field: libraw_olympus_makernotes_t::AspectFrame"]
        [::core::mem::offset_of!(libraw_olympus_makernotes_t, AspectFrame) - 376usize];
    ["Offset of field: libraw_olympus_makernotes_t::StackedImage"]
        [::core::mem::offset_of!(libraw_olympus_makernotes_t, StackedImage) - 384usize];
    ["Offset of field: libraw_olympus_makernotes_t::isLiveND"]
        [::core::mem::offset_of!(libraw_olympus_makernotes_t, isLiveND) - 392usize];
    ["Offset of field: libraw_olympus_makernotes_t::LiveNDfactor"]
        [::core::mem::offset_of!(libraw_olympus_makernotes_t, LiveNDfactor) - 396usize];
    ["Offset of field: libraw_olympus_makernotes_t::Panorama_mode"]
        [::core::mem::offset_of!(libraw_olympus_makernotes_t, Panorama_mode) - 400usize];
    ["Offset of field: libraw_olympus_makernotes_t::Panorama_frameNum"]
        [::core::mem::offset_of!(libraw_olympus_makernotes_t, Panorama_frameNum) - 402usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq)]
pub struct libraw_panasonic_makernotes_t {
    pub Compression: ushort,
    pub BlackLevelDim: ushort,
    pub BlackLevel: [f32; 8usize],
    pub Multishot: libc::c_uint,
    pub gamma: f32,
    pub HighISOMultiplier: [libc::c_int; 3usize],
    pub FocusStepNear: libc::c_short,
    pub FocusStepCount: libc::c_short,
    pub ZoomPosition: libc::c_uint,
    pub LensManufacturer: libc::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of libraw_panasonic_makernotes_t"]
        [::core::mem::size_of::<libraw_panasonic_makernotes_t>() - 68usize];
    ["Alignment of libraw_panasonic_makernotes_t"]
        [::core::mem::align_of::<libraw_panasonic_makernotes_t>() - 4usize];
    ["Offset of field: libraw_panasonic_makernotes_t::Compression"]
        [::core::mem::offset_of!(libraw_panasonic_makernotes_t, Compression) - 0usize];
    ["Offset of field: libraw_panasonic_makernotes_t::BlackLevelDim"]
        [::core::mem::offset_of!(libraw_panasonic_makernotes_t, BlackLevelDim) - 2usize];
    ["Offset of field: libraw_panasonic_makernotes_t::BlackLevel"]
        [::core::mem::offset_of!(libraw_panasonic_makernotes_t, BlackLevel) - 4usize];
    ["Offset of field: libraw_panasonic_makernotes_t::Multishot"]
        [::core::mem::offset_of!(libraw_panasonic_makernotes_t, Multishot) - 36usize];
    ["Offset of field: libraw_panasonic_makernotes_t::gamma"]
        [::core::mem::offset_of!(libraw_panasonic_makernotes_t, gamma) - 40usize];
    ["Offset of field: libraw_panasonic_makernotes_t::HighISOMultiplier"]
        [::core::mem::offset_of!(libraw_panasonic_makernotes_t, HighISOMultiplier) - 44usize];
    ["Offset of field: libraw_panasonic_makernotes_t::FocusStepNear"]
        [::core::mem::offset_of!(libraw_panasonic_makernotes_t, FocusStepNear) - 56usize];
    ["Offset of field: libraw_panasonic_makernotes_t::FocusStepCount"]
        [::core::mem::offset_of!(libraw_panasonic_makernotes_t, FocusStepCount) - 58usize];
    ["Offset of field: libraw_panasonic_makernotes_t::ZoomPosition"]
        [::core::mem::offset_of!(libraw_panasonic_makernotes_t, ZoomPosition) - 60usize];
    ["Offset of field: libraw_panasonic_makernotes_t::LensManufacturer"]
        [::core::mem::offset_of!(libraw_panasonic_makernotes_t, LensManufacturer) - 64usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct libraw_pentax_makernotes_t {
    pub DriveMode: [uchar; 4usize],
    pub FocusMode: [ushort; 2usize],
    pub AFPointSelected: [ushort; 2usize],
    pub AFPointSelected_Area: ushort,
    pub AFPointsInFocus_version: libc::c_int,
    pub AFPointsInFocus: libc::c_uint,
    pub FocusPosition: ushort,
    pub AFAdjustment: libc::c_short,
    pub AFPointMode: uchar,
    pub MultiExposure: uchar,
    pub Quality: ushort,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of libraw_pentax_makernotes_t"]
        [::core::mem::size_of::<libraw_pentax_makernotes_t>() - 32usize];
    ["Alignment of libraw_pentax_makernotes_t"]
        [::core::mem::align_of::<libraw_pentax_makernotes_t>() - 4usize];
    ["Offset of field: libraw_pentax_makernotes_t::DriveMode"]
        [::core::mem::offset_of!(libraw_pentax_makernotes_t, DriveMode) - 0usize];
    ["Offset of field: libraw_pentax_makernotes_t::FocusMode"]
        [::core::mem::offset_of!(libraw_pentax_makernotes_t, FocusMode) - 4usize];
    ["Offset of field: libraw_pentax_makernotes_t::AFPointSelected"]
        [::core::mem::offset_of!(libraw_pentax_makernotes_t, AFPointSelected) - 8usize];
    ["Offset of field: libraw_pentax_makernotes_t::AFPointSelected_Area"]
        [::core::mem::offset_of!(libraw_pentax_makernotes_t, AFPointSelected_Area) - 12usize];
    ["Offset of field: libraw_pentax_makernotes_t::AFPointsInFocus_version"]
        [::core::mem::offset_of!(libraw_pentax_makernotes_t, AFPointsInFocus_version) - 16usize];
    ["Offset of field: libraw_pentax_makernotes_t::AFPointsInFocus"]
        [::core::mem::offset_of!(libraw_pentax_makernotes_t, AFPointsInFocus) - 20usize];
    ["Offset of field: libraw_pentax_makernotes_t::FocusPosition"]
        [::core::mem::offset_of!(libraw_pentax_makernotes_t, FocusPosition) - 24usize];
    ["Offset of field: libraw_pentax_makernotes_t::AFAdjustment"]
        [::core::mem::offset_of!(libraw_pentax_makernotes_t, AFAdjustment) - 26usize];
    ["Offset of field: libraw_pentax_makernotes_t::AFPointMode"]
        [::core::mem::offset_of!(libraw_pentax_makernotes_t, AFPointMode) - 28usize];
    ["Offset of field: libraw_pentax_makernotes_t::MultiExposure"]
        [::core::mem::offset_of!(libraw_pentax_makernotes_t, MultiExposure) - 29usize];
    ["Offset of field: libraw_pentax_makernotes_t::Quality"]
        [::core::mem::offset_of!(libraw_pentax_makernotes_t, Quality) - 30usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq)]
pub struct libraw_ricoh_makernotes_t {
    pub AFStatus: ushort,
    pub AFAreaXPosition: [libc::c_uint; 2usize],
    pub AFAreaYPosition: [libc::c_uint; 2usize],
    pub AFAreaMode: ushort,
    pub SensorWidth: libc::c_uint,
    pub SensorHeight: libc::c_uint,
    pub CroppedImageWidth: libc::c_uint,
    pub CroppedImageHeight: libc::c_uint,
    pub WideAdapter: ushort,
    pub CropMode: ushort,
    pub NDFilter: ushort,
    pub AutoBracketing: ushort,
    pub MacroMode: ushort,
    pub FlashMode: ushort,
    pub FlashExposureComp: f64,
    pub ManualFlashOutput: f64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of libraw_ricoh_makernotes_t"]
        [::core::mem::size_of::<libraw_ricoh_makernotes_t>() - 72usize];
    ["Alignment of libraw_ricoh_makernotes_t"]
        [::core::mem::align_of::<libraw_ricoh_makernotes_t>() - 8usize];
    ["Offset of field: libraw_ricoh_makernotes_t::AFStatus"]
        [::core::mem::offset_of!(libraw_ricoh_makernotes_t, AFStatus) - 0usize];
    ["Offset of field: libraw_ricoh_makernotes_t::AFAreaXPosition"]
        [::core::mem::offset_of!(libraw_ricoh_makernotes_t, AFAreaXPosition) - 4usize];
    ["Offset of field: libraw_ricoh_makernotes_t::AFAreaYPosition"]
        [::core::mem::offset_of!(libraw_ricoh_makernotes_t, AFAreaYPosition) - 12usize];
    ["Offset of field: libraw_ricoh_makernotes_t::AFAreaMode"]
        [::core::mem::offset_of!(libraw_ricoh_makernotes_t, AFAreaMode) - 20usize];
    ["Offset of field: libraw_ricoh_makernotes_t::SensorWidth"]
        [::core::mem::offset_of!(libraw_ricoh_makernotes_t, SensorWidth) - 24usize];
    ["Offset of field: libraw_ricoh_makernotes_t::SensorHeight"]
        [::core::mem::offset_of!(libraw_ricoh_makernotes_t, SensorHeight) - 28usize];
    ["Offset of field: libraw_ricoh_makernotes_t::CroppedImageWidth"]
        [::core::mem::offset_of!(libraw_ricoh_makernotes_t, CroppedImageWidth) - 32usize];
    ["Offset of field: libraw_ricoh_makernotes_t::CroppedImageHeight"]
        [::core::mem::offset_of!(libraw_ricoh_makernotes_t, CroppedImageHeight) - 36usize];
    ["Offset of field: libraw_ricoh_makernotes_t::WideAdapter"]
        [::core::mem::offset_of!(libraw_ricoh_makernotes_t, WideAdapter) - 40usize];
    ["Offset of field: libraw_ricoh_makernotes_t::CropMode"]
        [::core::mem::offset_of!(libraw_ricoh_makernotes_t, CropMode) - 42usize];
    ["Offset of field: libraw_ricoh_makernotes_t::NDFilter"]
        [::core::mem::offset_of!(libraw_ricoh_makernotes_t, NDFilter) - 44usize];
    ["Offset of field: libraw_ricoh_makernotes_t::AutoBracketing"]
        [::core::mem::offset_of!(libraw_ricoh_makernotes_t, AutoBracketing) - 46usize];
    ["Offset of field: libraw_ricoh_makernotes_t::MacroMode"]
        [::core::mem::offset_of!(libraw_ricoh_makernotes_t, MacroMode) - 48usize];
    ["Offset of field: libraw_ricoh_makernotes_t::FlashMode"]
        [::core::mem::offset_of!(libraw_ricoh_makernotes_t, FlashMode) - 50usize];
    ["Offset of field: libraw_ricoh_makernotes_t::FlashExposureComp"]
        [::core::mem::offset_of!(libraw_ricoh_makernotes_t, FlashExposureComp) - 56usize];
    ["Offset of field: libraw_ricoh_makernotes_t::ManualFlashOutput"]
        [::core::mem::offset_of!(libraw_ricoh_makernotes_t, ManualFlashOutput) - 64usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq)]
pub struct libraw_samsung_makernotes_t {
    pub ImageSizeFull: [libc::c_uint; 4usize],
    pub ImageSizeCrop: [libc::c_uint; 4usize],
    pub ColorSpace: [libc::c_int; 2usize],
    pub key: [libc::c_uint; 11usize],
    pub DigitalGain: f64,
    pub DeviceType: libc::c_int,
    pub LensFirmware: [libc::c_char; 32usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of libraw_samsung_makernotes_t"]
        [::core::mem::size_of::<libraw_samsung_makernotes_t>() - 136usize];
    ["Alignment of libraw_samsung_makernotes_t"]
        [::core::mem::align_of::<libraw_samsung_makernotes_t>() - 8usize];
    ["Offset of field: libraw_samsung_makernotes_t::ImageSizeFull"]
        [::core::mem::offset_of!(libraw_samsung_makernotes_t, ImageSizeFull) - 0usize];
    ["Offset of field: libraw_samsung_makernotes_t::ImageSizeCrop"]
        [::core::mem::offset_of!(libraw_samsung_makernotes_t, ImageSizeCrop) - 16usize];
    ["Offset of field: libraw_samsung_makernotes_t::ColorSpace"]
        [::core::mem::offset_of!(libraw_samsung_makernotes_t, ColorSpace) - 32usize];
    ["Offset of field: libraw_samsung_makernotes_t::key"]
        [::core::mem::offset_of!(libraw_samsung_makernotes_t, key) - 40usize];
    ["Offset of field: libraw_samsung_makernotes_t::DigitalGain"]
        [::core::mem::offset_of!(libraw_samsung_makernotes_t, DigitalGain) - 88usize];
    ["Offset of field: libraw_samsung_makernotes_t::DeviceType"]
        [::core::mem::offset_of!(libraw_samsung_makernotes_t, DeviceType) - 96usize];
    ["Offset of field: libraw_samsung_makernotes_t::LensFirmware"]
        [::core::mem::offset_of!(libraw_samsung_makernotes_t, LensFirmware) - 100usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq)]
pub struct libraw_kodak_makernotes_t {
    pub BlackLevelTop: ushort,
    pub BlackLevelBottom: ushort,
    pub offset_left: libc::c_short,
    pub offset_top: libc::c_short,
    pub clipBlack: ushort,
    pub clipWhite: ushort,
    pub romm_camDaylight: [[f32; 3usize]; 3usize],
    pub romm_camTungsten: [[f32; 3usize]; 3usize],
    pub romm_camFluorescent: [[f32; 3usize]; 3usize],
    pub romm_camFlash: [[f32; 3usize]; 3usize],
    pub romm_camCustom: [[f32; 3usize]; 3usize],
    pub romm_camAuto: [[f32; 3usize]; 3usize],
    pub val018percent: ushort,
    pub val100percent: ushort,
    pub val170percent: ushort,
    pub MakerNoteKodak8a: libc::c_short,
    pub ISOCalibrationGain: f32,
    pub AnalogISO: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of libraw_kodak_makernotes_t"]
        [::core::mem::size_of::<libraw_kodak_makernotes_t>() - 244usize];
    ["Alignment of libraw_kodak_makernotes_t"]
        [::core::mem::align_of::<libraw_kodak_makernotes_t>() - 4usize];
    ["Offset of field: libraw_kodak_makernotes_t::BlackLevelTop"]
        [::core::mem::offset_of!(libraw_kodak_makernotes_t, BlackLevelTop) - 0usize];
    ["Offset of field: libraw_kodak_makernotes_t::BlackLevelBottom"]
        [::core::mem::offset_of!(libraw_kodak_makernotes_t, BlackLevelBottom) - 2usize];
    ["Offset of field: libraw_kodak_makernotes_t::offset_left"]
        [::core::mem::offset_of!(libraw_kodak_makernotes_t, offset_left) - 4usize];
    ["Offset of field: libraw_kodak_makernotes_t::offset_top"]
        [::core::mem::offset_of!(libraw_kodak_makernotes_t, offset_top) - 6usize];
    ["Offset of field: libraw_kodak_makernotes_t::clipBlack"]
        [::core::mem::offset_of!(libraw_kodak_makernotes_t, clipBlack) - 8usize];
    ["Offset of field: libraw_kodak_makernotes_t::clipWhite"]
        [::core::mem::offset_of!(libraw_kodak_makernotes_t, clipWhite) - 10usize];
    ["Offset of field: libraw_kodak_makernotes_t::romm_camDaylight"]
        [::core::mem::offset_of!(libraw_kodak_makernotes_t, romm_camDaylight) - 12usize];
    ["Offset of field: libraw_kodak_makernotes_t::romm_camTungsten"]
        [::core::mem::offset_of!(libraw_kodak_makernotes_t, romm_camTungsten) - 48usize];
    ["Offset of field: libraw_kodak_makernotes_t::romm_camFluorescent"]
        [::core::mem::offset_of!(libraw_kodak_makernotes_t, romm_camFluorescent) - 84usize];
    ["Offset of field: libraw_kodak_makernotes_t::romm_camFlash"]
        [::core::mem::offset_of!(libraw_kodak_makernotes_t, romm_camFlash) - 120usize];
    ["Offset of field: libraw_kodak_makernotes_t::romm_camCustom"]
        [::core::mem::offset_of!(libraw_kodak_makernotes_t, romm_camCustom) - 156usize];
    ["Offset of field: libraw_kodak_makernotes_t::romm_camAuto"]
        [::core::mem::offset_of!(libraw_kodak_makernotes_t, romm_camAuto) - 192usize];
    ["Offset of field: libraw_kodak_makernotes_t::val018percent"]
        [::core::mem::offset_of!(libraw_kodak_makernotes_t, val018percent) - 228usize];
    ["Offset of field: libraw_kodak_makernotes_t::val100percent"]
        [::core::mem::offset_of!(libraw_kodak_makernotes_t, val100percent) - 230usize];
    ["Offset of field: libraw_kodak_makernotes_t::val170percent"]
        [::core::mem::offset_of!(libraw_kodak_makernotes_t, val170percent) - 232usize];
    ["Offset of field: libraw_kodak_makernotes_t::MakerNoteKodak8a"]
        [::core::mem::offset_of!(libraw_kodak_makernotes_t, MakerNoteKodak8a) - 234usize];
    ["Offset of field: libraw_kodak_makernotes_t::ISOCalibrationGain"]
        [::core::mem::offset_of!(libraw_kodak_makernotes_t, ISOCalibrationGain) - 236usize];
    ["Offset of field: libraw_kodak_makernotes_t::AnalogISO"]
        [::core::mem::offset_of!(libraw_kodak_makernotes_t, AnalogISO) - 240usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct libraw_p1_makernotes_t {
    pub Software: [libc::c_char; 64usize],
    pub SystemType: [libc::c_char; 64usize],
    pub FirmwareString: [libc::c_char; 256usize],
    pub SystemModel: [libc::c_char; 64usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of libraw_p1_makernotes_t"][::core::mem::size_of::<libraw_p1_makernotes_t>() - 448usize];
    ["Alignment of libraw_p1_makernotes_t"]
        [::core::mem::align_of::<libraw_p1_makernotes_t>() - 1usize];
    ["Offset of field: libraw_p1_makernotes_t::Software"]
        [::core::mem::offset_of!(libraw_p1_makernotes_t, Software) - 0usize];
    ["Offset of field: libraw_p1_makernotes_t::SystemType"]
        [::core::mem::offset_of!(libraw_p1_makernotes_t, SystemType) - 64usize];
    ["Offset of field: libraw_p1_makernotes_t::FirmwareString"]
        [::core::mem::offset_of!(libraw_p1_makernotes_t, FirmwareString) - 128usize];
    ["Offset of field: libraw_p1_makernotes_t::SystemModel"]
        [::core::mem::offset_of!(libraw_p1_makernotes_t, SystemModel) - 384usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq)]
pub struct libraw_sony_info_t {
    pub CameraType: ushort,
    pub Sony0x9400_version: uchar,
    pub Sony0x9400_ReleaseMode2: uchar,
    pub Sony0x9400_SequenceImageNumber: libc::c_uint,
    pub Sony0x9400_SequenceLength1: uchar,
    pub Sony0x9400_SequenceFileNumber: libc::c_uint,
    pub Sony0x9400_SequenceLength2: uchar,
    pub AFAreaModeSetting: u8,
    pub AFAreaMode: u16,
    pub FlexibleSpotPosition: [ushort; 2usize],
    pub AFPointSelected: u8,
    pub AFPointSelected_0x201e: u8,
    pub nAFPointsUsed: libc::c_short,
    pub AFPointsUsed: [u8; 10usize],
    pub AFTracking: u8,
    pub AFType: u8,
    pub FocusLocation: [ushort; 4usize],
    pub FocusPosition: ushort,
    pub AFMicroAdjValue: i8,
    pub AFMicroAdjOn: i8,
    pub AFMicroAdjRegisteredLenses: uchar,
    pub VariableLowPassFilter: ushort,
    pub LongExposureNoiseReduction: libc::c_uint,
    pub HighISONoiseReduction: ushort,
    pub HDR: [ushort; 2usize],
    pub group2010: ushort,
    pub group9050: ushort,
    pub real_iso_offset: ushort,
    pub MeteringMode_offset: ushort,
    pub ExposureProgram_offset: ushort,
    pub ReleaseMode2_offset: ushort,
    pub MinoltaCamID: libc::c_uint,
    pub firmware: f32,
    pub ImageCount3_offset: ushort,
    pub ImageCount3: libc::c_uint,
    pub ElectronicFrontCurtainShutter: libc::c_uint,
    pub MeteringMode2: ushort,
    pub SonyDateTime: [libc::c_char; 20usize],
    pub ShotNumberSincePowerUp: libc::c_uint,
    pub PixelShiftGroupPrefix: ushort,
    pub PixelShiftGroupID: libc::c_uint,
    pub nShotsInPixelShiftGroup: libc::c_char,
    pub numInPixelShiftGroup: libc::c_char,
    pub prd_ImageHeight: ushort,
    pub prd_ImageWidth: ushort,
    pub prd_Total_bps: ushort,
    pub prd_Active_bps: ushort,
    pub prd_StorageMethod: ushort,
    pub prd_BayerPattern: ushort,
    pub SonyRawFileType: ushort,
    pub RAWFileType: ushort,
    pub RawSizeType: ushort,
    pub Quality: libc::c_uint,
    pub FileFormat: ushort,
    pub MetaVersion: [libc::c_char; 16usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of libraw_sony_info_t"][::core::mem::size_of::<libraw_sony_info_t>() - 180usize];
    ["Alignment of libraw_sony_info_t"][::core::mem::align_of::<libraw_sony_info_t>() - 4usize];
    ["Offset of field: libraw_sony_info_t::CameraType"]
        [::core::mem::offset_of!(libraw_sony_info_t, CameraType) - 0usize];
    ["Offset of field: libraw_sony_info_t::Sony0x9400_version"]
        [::core::mem::offset_of!(libraw_sony_info_t, Sony0x9400_version) - 2usize];
    ["Offset of field: libraw_sony_info_t::Sony0x9400_ReleaseMode2"]
        [::core::mem::offset_of!(libraw_sony_info_t, Sony0x9400_ReleaseMode2) - 3usize];
    ["Offset of field: libraw_sony_info_t::Sony0x9400_SequenceImageNumber"]
        [::core::mem::offset_of!(libraw_sony_info_t, Sony0x9400_SequenceImageNumber) - 4usize];
    ["Offset of field: libraw_sony_info_t::Sony0x9400_SequenceLength1"]
        [::core::mem::offset_of!(libraw_sony_info_t, Sony0x9400_SequenceLength1) - 8usize];
    ["Offset of field: libraw_sony_info_t::Sony0x9400_SequenceFileNumber"]
        [::core::mem::offset_of!(libraw_sony_info_t, Sony0x9400_SequenceFileNumber) - 12usize];
    ["Offset of field: libraw_sony_info_t::Sony0x9400_SequenceLength2"]
        [::core::mem::offset_of!(libraw_sony_info_t, Sony0x9400_SequenceLength2) - 16usize];
    ["Offset of field: libraw_sony_info_t::AFAreaModeSetting"]
        [::core::mem::offset_of!(libraw_sony_info_t, AFAreaModeSetting) - 17usize];
    ["Offset of field: libraw_sony_info_t::AFAreaMode"]
        [::core::mem::offset_of!(libraw_sony_info_t, AFAreaMode) - 18usize];
    ["Offset of field: libraw_sony_info_t::FlexibleSpotPosition"]
        [::core::mem::offset_of!(libraw_sony_info_t, FlexibleSpotPosition) - 20usize];
    ["Offset of field: libraw_sony_info_t::AFPointSelected"]
        [::core::mem::offset_of!(libraw_sony_info_t, AFPointSelected) - 24usize];
    ["Offset of field: libraw_sony_info_t::AFPointSelected_0x201e"]
        [::core::mem::offset_of!(libraw_sony_info_t, AFPointSelected_0x201e) - 25usize];
    ["Offset of field: libraw_sony_info_t::nAFPointsUsed"]
        [::core::mem::offset_of!(libraw_sony_info_t, nAFPointsUsed) - 26usize];
    ["Offset of field: libraw_sony_info_t::AFPointsUsed"]
        [::core::mem::offset_of!(libraw_sony_info_t, AFPointsUsed) - 28usize];
    ["Offset of field: libraw_sony_info_t::AFTracking"]
        [::core::mem::offset_of!(libraw_sony_info_t, AFTracking) - 38usize];
    ["Offset of field: libraw_sony_info_t::AFType"]
        [::core::mem::offset_of!(libraw_sony_info_t, AFType) - 39usize];
    ["Offset of field: libraw_sony_info_t::FocusLocation"]
        [::core::mem::offset_of!(libraw_sony_info_t, FocusLocation) - 40usize];
    ["Offset of field: libraw_sony_info_t::FocusPosition"]
        [::core::mem::offset_of!(libraw_sony_info_t, FocusPosition) - 48usize];
    ["Offset of field: libraw_sony_info_t::AFMicroAdjValue"]
        [::core::mem::offset_of!(libraw_sony_info_t, AFMicroAdjValue) - 50usize];
    ["Offset of field: libraw_sony_info_t::AFMicroAdjOn"]
        [::core::mem::offset_of!(libraw_sony_info_t, AFMicroAdjOn) - 51usize];
    ["Offset of field: libraw_sony_info_t::AFMicroAdjRegisteredLenses"]
        [::core::mem::offset_of!(libraw_sony_info_t, AFMicroAdjRegisteredLenses) - 52usize];
    ["Offset of field: libraw_sony_info_t::VariableLowPassFilter"]
        [::core::mem::offset_of!(libraw_sony_info_t, VariableLowPassFilter) - 54usize];
    ["Offset of field: libraw_sony_info_t::LongExposureNoiseReduction"]
        [::core::mem::offset_of!(libraw_sony_info_t, LongExposureNoiseReduction) - 56usize];
    ["Offset of field: libraw_sony_info_t::HighISONoiseReduction"]
        [::core::mem::offset_of!(libraw_sony_info_t, HighISONoiseReduction) - 60usize];
    ["Offset of field: libraw_sony_info_t::HDR"]
        [::core::mem::offset_of!(libraw_sony_info_t, HDR) - 62usize];
    ["Offset of field: libraw_sony_info_t::group2010"]
        [::core::mem::offset_of!(libraw_sony_info_t, group2010) - 66usize];
    ["Offset of field: libraw_sony_info_t::group9050"]
        [::core::mem::offset_of!(libraw_sony_info_t, group9050) - 68usize];
    ["Offset of field: libraw_sony_info_t::real_iso_offset"]
        [::core::mem::offset_of!(libraw_sony_info_t, real_iso_offset) - 70usize];
    ["Offset of field: libraw_sony_info_t::MeteringMode_offset"]
        [::core::mem::offset_of!(libraw_sony_info_t, MeteringMode_offset) - 72usize];
    ["Offset of field: libraw_sony_info_t::ExposureProgram_offset"]
        [::core::mem::offset_of!(libraw_sony_info_t, ExposureProgram_offset) - 74usize];
    ["Offset of field: libraw_sony_info_t::ReleaseMode2_offset"]
        [::core::mem::offset_of!(libraw_sony_info_t, ReleaseMode2_offset) - 76usize];
    ["Offset of field: libraw_sony_info_t::MinoltaCamID"]
        [::core::mem::offset_of!(libraw_sony_info_t, MinoltaCamID) - 80usize];
    ["Offset of field: libraw_sony_info_t::firmware"]
        [::core::mem::offset_of!(libraw_sony_info_t, firmware) - 84usize];
    ["Offset of field: libraw_sony_info_t::ImageCount3_offset"]
        [::core::mem::offset_of!(libraw_sony_info_t, ImageCount3_offset) - 88usize];
    ["Offset of field: libraw_sony_info_t::ImageCount3"]
        [::core::mem::offset_of!(libraw_sony_info_t, ImageCount3) - 92usize];
    ["Offset of field: libraw_sony_info_t::ElectronicFrontCurtainShutter"]
        [::core::mem::offset_of!(libraw_sony_info_t, ElectronicFrontCurtainShutter) - 96usize];
    ["Offset of field: libraw_sony_info_t::MeteringMode2"]
        [::core::mem::offset_of!(libraw_sony_info_t, MeteringMode2) - 100usize];
    ["Offset of field: libraw_sony_info_t::SonyDateTime"]
        [::core::mem::offset_of!(libraw_sony_info_t, SonyDateTime) - 102usize];
    ["Offset of field: libraw_sony_info_t::ShotNumberSincePowerUp"]
        [::core::mem::offset_of!(libraw_sony_info_t, ShotNumberSincePowerUp) - 124usize];
    ["Offset of field: libraw_sony_info_t::PixelShiftGroupPrefix"]
        [::core::mem::offset_of!(libraw_sony_info_t, PixelShiftGroupPrefix) - 128usize];
    ["Offset of field: libraw_sony_info_t::PixelShiftGroupID"]
        [::core::mem::offset_of!(libraw_sony_info_t, PixelShiftGroupID) - 132usize];
    ["Offset of field: libraw_sony_info_t::nShotsInPixelShiftGroup"]
        [::core::mem::offset_of!(libraw_sony_info_t, nShotsInPixelShiftGroup) - 136usize];
    ["Offset of field: libraw_sony_info_t::numInPixelShiftGroup"]
        [::core::mem::offset_of!(libraw_sony_info_t, numInPixelShiftGroup) - 137usize];
    ["Offset of field: libraw_sony_info_t::prd_ImageHeight"]
        [::core::mem::offset_of!(libraw_sony_info_t, prd_ImageHeight) - 138usize];
    ["Offset of field: libraw_sony_info_t::prd_ImageWidth"]
        [::core::mem::offset_of!(libraw_sony_info_t, prd_ImageWidth) - 140usize];
    ["Offset of field: libraw_sony_info_t::prd_Total_bps"]
        [::core::mem::offset_of!(libraw_sony_info_t, prd_Total_bps) - 142usize];
    ["Offset of field: libraw_sony_info_t::prd_Active_bps"]
        [::core::mem::offset_of!(libraw_sony_info_t, prd_Active_bps) - 144usize];
    ["Offset of field: libraw_sony_info_t::prd_StorageMethod"]
        [::core::mem::offset_of!(libraw_sony_info_t, prd_StorageMethod) - 146usize];
    ["Offset of field: libraw_sony_info_t::prd_BayerPattern"]
        [::core::mem::offset_of!(libraw_sony_info_t, prd_BayerPattern) - 148usize];
    ["Offset of field: libraw_sony_info_t::SonyRawFileType"]
        [::core::mem::offset_of!(libraw_sony_info_t, SonyRawFileType) - 150usize];
    ["Offset of field: libraw_sony_info_t::RAWFileType"]
        [::core::mem::offset_of!(libraw_sony_info_t, RAWFileType) - 152usize];
    ["Offset of field: libraw_sony_info_t::RawSizeType"]
        [::core::mem::offset_of!(libraw_sony_info_t, RawSizeType) - 154usize];
    ["Offset of field: libraw_sony_info_t::Quality"]
        [::core::mem::offset_of!(libraw_sony_info_t, Quality) - 156usize];
    ["Offset of field: libraw_sony_info_t::FileFormat"]
        [::core::mem::offset_of!(libraw_sony_info_t, FileFormat) - 160usize];
    ["Offset of field: libraw_sony_info_t::MetaVersion"]
        [::core::mem::offset_of!(libraw_sony_info_t, MetaVersion) - 162usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq)]
pub struct libraw_colordata_t {
    pub curve: [ushort; 65536usize],
    pub cblack: [libc::c_uint; 4104usize],
    pub black: libc::c_uint,
    pub data_maximum: libc::c_uint,
    pub maximum: libc::c_uint,
    pub linear_max: [libc::c_long; 4usize],
    pub fmaximum: f32,
    pub fnorm: f32,
    pub white: [[ushort; 8usize]; 8usize],
    pub cam_mul: [f32; 4usize],
    pub pre_mul: [f32; 4usize],
    pub cmatrix: [[f32; 4usize]; 3usize],
    pub ccm: [[f32; 4usize]; 3usize],
    pub rgb_cam: [[f32; 4usize]; 3usize],
    pub cam_xyz: [[f32; 3usize]; 4usize],
    pub phase_one_data: ph1_t,
    pub flash_used: f32,
    pub canon_ev: f32,
    pub model2: [libc::c_char; 64usize],
    pub UniqueCameraModel: [libc::c_char; 64usize],
    pub LocalizedCameraModel: [libc::c_char; 64usize],
    pub ImageUniqueID: [libc::c_char; 64usize],
    pub RawDataUniqueID: [libc::c_char; 17usize],
    pub OriginalRawFileName: [libc::c_char; 64usize],
    pub profile: *mut libc::c_void,
    pub profile_length: libc::c_uint,
    pub black_stat: [libc::c_uint; 8usize],
    pub dng_color: [libraw_dng_color_t; 2usize],
    pub dng_levels: libraw_dng_levels_t,
    pub WB_Coeffs: [[libc::c_int; 4usize]; 256usize],
    pub WBCT_Coeffs: [[f32; 5usize]; 64usize],
    pub as_shot_wb_applied: libc::c_int,
    pub P1_color: [libraw_P1_color_t; 2usize],
    pub raw_bps: libc::c_uint,
    pub ExifColorSpace: libc::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of libraw_colordata_t"][::core::mem::size_of::<libraw_colordata_t>() - 187032usize];
    ["Alignment of libraw_colordata_t"][::core::mem::align_of::<libraw_colordata_t>() - 8usize];
    ["Offset of field: libraw_colordata_t::curve"]
        [::core::mem::offset_of!(libraw_colordata_t, curve) - 0usize];
    ["Offset of field: libraw_colordata_t::cblack"]
        [::core::mem::offset_of!(libraw_colordata_t, cblack) - 131072usize];
    ["Offset of field: libraw_colordata_t::black"]
        [::core::mem::offset_of!(libraw_colordata_t, black) - 147488usize];
    ["Offset of field: libraw_colordata_t::data_maximum"]
        [::core::mem::offset_of!(libraw_colordata_t, data_maximum) - 147492usize];
    ["Offset of field: libraw_colordata_t::maximum"]
        [::core::mem::offset_of!(libraw_colordata_t, maximum) - 147496usize];
    ["Offset of field: libraw_colordata_t::linear_max"]
        [::core::mem::offset_of!(libraw_colordata_t, linear_max) - 147500usize];
    ["Offset of field: libraw_colordata_t::fmaximum"]
        [::core::mem::offset_of!(libraw_colordata_t, fmaximum) - 147516usize];
    ["Offset of field: libraw_colordata_t::fnorm"]
        [::core::mem::offset_of!(libraw_colordata_t, fnorm) - 147520usize];
    ["Offset of field: libraw_colordata_t::white"]
        [::core::mem::offset_of!(libraw_colordata_t, white) - 147524usize];
    ["Offset of field: libraw_colordata_t::cam_mul"]
        [::core::mem::offset_of!(libraw_colordata_t, cam_mul) - 147652usize];
    ["Offset of field: libraw_colordata_t::pre_mul"]
        [::core::mem::offset_of!(libraw_colordata_t, pre_mul) - 147668usize];
    ["Offset of field: libraw_colordata_t::cmatrix"]
        [::core::mem::offset_of!(libraw_colordata_t, cmatrix) - 147684usize];
    ["Offset of field: libraw_colordata_t::ccm"]
        [::core::mem::offset_of!(libraw_colordata_t, ccm) - 147732usize];
    ["Offset of field: libraw_colordata_t::rgb_cam"]
        [::core::mem::offset_of!(libraw_colordata_t, rgb_cam) - 147780usize];
    ["Offset of field: libraw_colordata_t::cam_xyz"]
        [::core::mem::offset_of!(libraw_colordata_t, cam_xyz) - 147828usize];
    ["Offset of field: libraw_colordata_t::phase_one_data"]
        [::core::mem::offset_of!(libraw_colordata_t, phase_one_data) - 147876usize];
    ["Offset of field: libraw_colordata_t::flash_used"]
        [::core::mem::offset_of!(libraw_colordata_t, flash_used) - 147912usize];
    ["Offset of field: libraw_colordata_t::canon_ev"]
        [::core::mem::offset_of!(libraw_colordata_t, canon_ev) - 147916usize];
    ["Offset of field: libraw_colordata_t::model2"]
        [::core::mem::offset_of!(libraw_colordata_t, model2) - 147920usize];
    ["Offset of field: libraw_colordata_t::UniqueCameraModel"]
        [::core::mem::offset_of!(libraw_colordata_t, UniqueCameraModel) - 147984usize];
    ["Offset of field: libraw_colordata_t::LocalizedCameraModel"]
        [::core::mem::offset_of!(libraw_colordata_t, LocalizedCameraModel) - 148048usize];
    ["Offset of field: libraw_colordata_t::ImageUniqueID"]
        [::core::mem::offset_of!(libraw_colordata_t, ImageUniqueID) - 148112usize];
    ["Offset of field: libraw_colordata_t::RawDataUniqueID"]
        [::core::mem::offset_of!(libraw_colordata_t, RawDataUniqueID) - 148176usize];
    ["Offset of field: libraw_colordata_t::OriginalRawFileName"]
        [::core::mem::offset_of!(libraw_colordata_t, OriginalRawFileName) - 148193usize];
    ["Offset of field: libraw_colordata_t::profile"]
        [::core::mem::offset_of!(libraw_colordata_t, profile) - 148264usize];
    ["Offset of field: libraw_colordata_t::profile_length"]
        [::core::mem::offset_of!(libraw_colordata_t, profile_length) - 148272usize];
    ["Offset of field: libraw_colordata_t::black_stat"]
        [::core::mem::offset_of!(libraw_colordata_t, black_stat) - 148276usize];
    ["Offset of field: libraw_colordata_t::dng_color"]
        [::core::mem::offset_of!(libraw_colordata_t, dng_color) - 148308usize];
    ["Offset of field: libraw_colordata_t::dng_levels"]
        [::core::mem::offset_of!(libraw_colordata_t, dng_levels) - 148644usize];
    ["Offset of field: libraw_colordata_t::WB_Coeffs"]
        [::core::mem::offset_of!(libraw_colordata_t, WB_Coeffs) - 181572usize];
    ["Offset of field: libraw_colordata_t::WBCT_Coeffs"]
        [::core::mem::offset_of!(libraw_colordata_t, WBCT_Coeffs) - 185668usize];
    ["Offset of field: libraw_colordata_t::as_shot_wb_applied"]
        [::core::mem::offset_of!(libraw_colordata_t, as_shot_wb_applied) - 186948usize];
    ["Offset of field: libraw_colordata_t::P1_color"]
        [::core::mem::offset_of!(libraw_colordata_t, P1_color) - 186952usize];
    ["Offset of field: libraw_colordata_t::raw_bps"]
        [::core::mem::offset_of!(libraw_colordata_t, raw_bps) - 187024usize];
    ["Offset of field: libraw_colordata_t::ExifColorSpace"]
        [::core::mem::offset_of!(libraw_colordata_t, ExifColorSpace) - 187028usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct libraw_thumbnail_t {
    pub tformat: LibRaw_thumbnail_formats,
    pub twidth: ushort,
    pub theight: ushort,
    pub tlength: libc::c_uint,
    pub tcolors: libc::c_int,
    pub thumb: *mut libc::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of libraw_thumbnail_t"][::core::mem::size_of::<libraw_thumbnail_t>() - 24usize];
    ["Alignment of libraw_thumbnail_t"][::core::mem::align_of::<libraw_thumbnail_t>() - 8usize];
    ["Offset of field: libraw_thumbnail_t::tformat"]
        [::core::mem::offset_of!(libraw_thumbnail_t, tformat) - 0usize];
    ["Offset of field: libraw_thumbnail_t::twidth"]
        [::core::mem::offset_of!(libraw_thumbnail_t, twidth) - 4usize];
    ["Offset of field: libraw_thumbnail_t::theight"]
        [::core::mem::offset_of!(libraw_thumbnail_t, theight) - 6usize];
    ["Offset of field: libraw_thumbnail_t::tlength"]
        [::core::mem::offset_of!(libraw_thumbnail_t, tlength) - 8usize];
    ["Offset of field: libraw_thumbnail_t::tcolors"]
        [::core::mem::offset_of!(libraw_thumbnail_t, tcolors) - 12usize];
    ["Offset of field: libraw_thumbnail_t::thumb"]
        [::core::mem::offset_of!(libraw_thumbnail_t, thumb) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct libraw_thumbnail_item_t {
    pub tformat: LibRaw_internal_thumbnail_formats,
    pub twidth: ushort,
    pub theight: ushort,
    pub tflip: ushort,
    pub tlength: libc::c_uint,
    pub tmisc: libc::c_uint,
    pub toffset: INT64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of libraw_thumbnail_item_t"]
        [::core::mem::size_of::<libraw_thumbnail_item_t>() - 32usize];
    ["Alignment of libraw_thumbnail_item_t"]
        [::core::mem::align_of::<libraw_thumbnail_item_t>() - 8usize];
    ["Offset of field: libraw_thumbnail_item_t::tformat"]
        [::core::mem::offset_of!(libraw_thumbnail_item_t, tformat) - 0usize];
    ["Offset of field: libraw_thumbnail_item_t::twidth"]
        [::core::mem::offset_of!(libraw_thumbnail_item_t, twidth) - 4usize];
    ["Offset of field: libraw_thumbnail_item_t::theight"]
        [::core::mem::offset_of!(libraw_thumbnail_item_t, theight) - 6usize];
    ["Offset of field: libraw_thumbnail_item_t::tflip"]
        [::core::mem::offset_of!(libraw_thumbnail_item_t, tflip) - 8usize];
    ["Offset of field: libraw_thumbnail_item_t::tlength"]
        [::core::mem::offset_of!(libraw_thumbnail_item_t, tlength) - 12usize];
    ["Offset of field: libraw_thumbnail_item_t::tmisc"]
        [::core::mem::offset_of!(libraw_thumbnail_item_t, tmisc) - 16usize];
    ["Offset of field: libraw_thumbnail_item_t::toffset"]
        [::core::mem::offset_of!(libraw_thumbnail_item_t, toffset) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct libraw_thumbnail_list_t {
    pub thumbcount: libc::c_int,
    pub thumblist: [libraw_thumbnail_item_t; 8usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of libraw_thumbnail_list_t"]
        [::core::mem::size_of::<libraw_thumbnail_list_t>() - 264usize];
    ["Alignment of libraw_thumbnail_list_t"]
        [::core::mem::align_of::<libraw_thumbnail_list_t>() - 8usize];
    ["Offset of field: libraw_thumbnail_list_t::thumbcount"]
        [::core::mem::offset_of!(libraw_thumbnail_list_t, thumbcount) - 0usize];
    ["Offset of field: libraw_thumbnail_list_t::thumblist"]
        [::core::mem::offset_of!(libraw_thumbnail_list_t, thumblist) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq)]
pub struct libraw_gps_info_t {
    pub latitude: [f32; 3usize],
    pub longitude: [f32; 3usize],
    pub gpstimestamp: [f32; 3usize],
    pub altitude: f32,
    pub altref: libc::c_char,
    pub latref: libc::c_char,
    pub longref: libc::c_char,
    pub gpsstatus: libc::c_char,
    pub gpsparsed: libc::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of libraw_gps_info_t"][::core::mem::size_of::<libraw_gps_info_t>() - 48usize];
    ["Alignment of libraw_gps_info_t"][::core::mem::align_of::<libraw_gps_info_t>() - 4usize];
    ["Offset of field: libraw_gps_info_t::latitude"]
        [::core::mem::offset_of!(libraw_gps_info_t, latitude) - 0usize];
    ["Offset of field: libraw_gps_info_t::longitude"]
        [::core::mem::offset_of!(libraw_gps_info_t, longitude) - 12usize];
    ["Offset of field: libraw_gps_info_t::gpstimestamp"]
        [::core::mem::offset_of!(libraw_gps_info_t, gpstimestamp) - 24usize];
    ["Offset of field: libraw_gps_info_t::altitude"]
        [::core::mem::offset_of!(libraw_gps_info_t, altitude) - 36usize];
    ["Offset of field: libraw_gps_info_t::altref"]
        [::core::mem::offset_of!(libraw_gps_info_t, altref) - 40usize];
    ["Offset of field: libraw_gps_info_t::latref"]
        [::core::mem::offset_of!(libraw_gps_info_t, latref) - 41usize];
    ["Offset of field: libraw_gps_info_t::longref"]
        [::core::mem::offset_of!(libraw_gps_info_t, longref) - 42usize];
    ["Offset of field: libraw_gps_info_t::gpsstatus"]
        [::core::mem::offset_of!(libraw_gps_info_t, gpsstatus) - 43usize];
    ["Offset of field: libraw_gps_info_t::gpsparsed"]
        [::core::mem::offset_of!(libraw_gps_info_t, gpsparsed) - 44usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq)]
pub struct libraw_imgother_t {
    pub iso_speed: f32,
    pub shutter: f32,
    pub aperture: f32,
    pub focal_len: f32,
    pub timestamp: time_t,
    pub shot_order: libc::c_uint,
    pub gpsdata: [libc::c_uint; 32usize],
    pub parsed_gps: libraw_gps_info_t,
    pub desc: [libc::c_char; 512usize],
    pub artist: [libc::c_char; 64usize],
    pub analogbalance: [f32; 4usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of libraw_imgother_t"][::core::mem::size_of::<libraw_imgother_t>() - 800usize];
    ["Alignment of libraw_imgother_t"][::core::mem::align_of::<libraw_imgother_t>() - 8usize];
    ["Offset of field: libraw_imgother_t::iso_speed"]
        [::core::mem::offset_of!(libraw_imgother_t, iso_speed) - 0usize];
    ["Offset of field: libraw_imgother_t::shutter"]
        [::core::mem::offset_of!(libraw_imgother_t, shutter) - 4usize];
    ["Offset of field: libraw_imgother_t::aperture"]
        [::core::mem::offset_of!(libraw_imgother_t, aperture) - 8usize];
    ["Offset of field: libraw_imgother_t::focal_len"]
        [::core::mem::offset_of!(libraw_imgother_t, focal_len) - 12usize];
    ["Offset of field: libraw_imgother_t::timestamp"]
        [::core::mem::offset_of!(libraw_imgother_t, timestamp) - 16usize];
    ["Offset of field: libraw_imgother_t::shot_order"]
        [::core::mem::offset_of!(libraw_imgother_t, shot_order) - 24usize];
    ["Offset of field: libraw_imgother_t::gpsdata"]
        [::core::mem::offset_of!(libraw_imgother_t, gpsdata) - 28usize];
    ["Offset of field: libraw_imgother_t::parsed_gps"]
        [::core::mem::offset_of!(libraw_imgother_t, parsed_gps) - 156usize];
    ["Offset of field: libraw_imgother_t::desc"]
        [::core::mem::offset_of!(libraw_imgother_t, desc) - 204usize];
    ["Offset of field: libraw_imgother_t::artist"]
        [::core::mem::offset_of!(libraw_imgother_t, artist) - 716usize];
    ["Offset of field: libraw_imgother_t::analogbalance"]
        [::core::mem::offset_of!(libraw_imgother_t, analogbalance) - 780usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct libraw_afinfo_item_t {
    pub AFInfoData_tag: libc::c_uint,
    pub AFInfoData_order: libc::c_short,
    pub AFInfoData_version: libc::c_uint,
    pub AFInfoData_length: libc::c_uint,
    pub AFInfoData: *mut uchar,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of libraw_afinfo_item_t"][::core::mem::size_of::<libraw_afinfo_item_t>() - 24usize];
    ["Alignment of libraw_afinfo_item_t"][::core::mem::align_of::<libraw_afinfo_item_t>() - 8usize];
    ["Offset of field: libraw_afinfo_item_t::AFInfoData_tag"]
        [::core::mem::offset_of!(libraw_afinfo_item_t, AFInfoData_tag) - 0usize];
    ["Offset of field: libraw_afinfo_item_t::AFInfoData_order"]
        [::core::mem::offset_of!(libraw_afinfo_item_t, AFInfoData_order) - 4usize];
    ["Offset of field: libraw_afinfo_item_t::AFInfoData_version"]
        [::core::mem::offset_of!(libraw_afinfo_item_t, AFInfoData_version) - 8usize];
    ["Offset of field: libraw_afinfo_item_t::AFInfoData_length"]
        [::core::mem::offset_of!(libraw_afinfo_item_t, AFInfoData_length) - 12usize];
    ["Offset of field: libraw_afinfo_item_t::AFInfoData"]
        [::core::mem::offset_of!(libraw_afinfo_item_t, AFInfoData) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq)]
pub struct libraw_metadata_common_t {
    pub FlashEC: f32,
    pub FlashGN: f32,
    pub CameraTemperature: f32,
    pub SensorTemperature: f32,
    pub SensorTemperature2: f32,
    pub LensTemperature: f32,
    pub AmbientTemperature: f32,
    pub BatteryTemperature: f32,
    pub exifAmbientTemperature: f32,
    pub exifHumidity: f32,
    pub exifPressure: f32,
    pub exifWaterDepth: f32,
    pub exifAcceleration: f32,
    pub exifCameraElevationAngle: f32,
    pub real_ISO: f32,
    pub exifExposureIndex: f32,
    pub ColorSpace: ushort,
    pub firmware: [libc::c_char; 128usize],
    pub ExposureCalibrationShift: f32,
    pub afdata: [libraw_afinfo_item_t; 4usize],
    pub afcount: libc::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of libraw_metadata_common_t"]
        [::core::mem::size_of::<libraw_metadata_common_t>() - 304usize];
    ["Alignment of libraw_metadata_common_t"]
        [::core::mem::align_of::<libraw_metadata_common_t>() - 8usize];
    ["Offset of field: libraw_metadata_common_t::FlashEC"]
        [::core::mem::offset_of!(libraw_metadata_common_t, FlashEC) - 0usize];
    ["Offset of field: libraw_metadata_common_t::FlashGN"]
        [::core::mem::offset_of!(libraw_metadata_common_t, FlashGN) - 4usize];
    ["Offset of field: libraw_metadata_common_t::CameraTemperature"]
        [::core::mem::offset_of!(libraw_metadata_common_t, CameraTemperature) - 8usize];
    ["Offset of field: libraw_metadata_common_t::SensorTemperature"]
        [::core::mem::offset_of!(libraw_metadata_common_t, SensorTemperature) - 12usize];
    ["Offset of field: libraw_metadata_common_t::SensorTemperature2"]
        [::core::mem::offset_of!(libraw_metadata_common_t, SensorTemperature2) - 16usize];
    ["Offset of field: libraw_metadata_common_t::LensTemperature"]
        [::core::mem::offset_of!(libraw_metadata_common_t, LensTemperature) - 20usize];
    ["Offset of field: libraw_metadata_common_t::AmbientTemperature"]
        [::core::mem::offset_of!(libraw_metadata_common_t, AmbientTemperature) - 24usize];
    ["Offset of field: libraw_metadata_common_t::BatteryTemperature"]
        [::core::mem::offset_of!(libraw_metadata_common_t, BatteryTemperature) - 28usize];
    ["Offset of field: libraw_metadata_common_t::exifAmbientTemperature"]
        [::core::mem::offset_of!(libraw_metadata_common_t, exifAmbientTemperature) - 32usize];
    ["Offset of field: libraw_metadata_common_t::exifHumidity"]
        [::core::mem::offset_of!(libraw_metadata_common_t, exifHumidity) - 36usize];
    ["Offset of field: libraw_metadata_common_t::exifPressure"]
        [::core::mem::offset_of!(libraw_metadata_common_t, exifPressure) - 40usize];
    ["Offset of field: libraw_metadata_common_t::exifWaterDepth"]
        [::core::mem::offset_of!(libraw_metadata_common_t, exifWaterDepth) - 44usize];
    ["Offset of field: libraw_metadata_common_t::exifAcceleration"]
        [::core::mem::offset_of!(libraw_metadata_common_t, exifAcceleration) - 48usize];
    ["Offset of field: libraw_metadata_common_t::exifCameraElevationAngle"]
        [::core::mem::offset_of!(libraw_metadata_common_t, exifCameraElevationAngle) - 52usize];
    ["Offset of field: libraw_metadata_common_t::real_ISO"]
        [::core::mem::offset_of!(libraw_metadata_common_t, real_ISO) - 56usize];
    ["Offset of field: libraw_metadata_common_t::exifExposureIndex"]
        [::core::mem::offset_of!(libraw_metadata_common_t, exifExposureIndex) - 60usize];
    ["Offset of field: libraw_metadata_common_t::ColorSpace"]
        [::core::mem::offset_of!(libraw_metadata_common_t, ColorSpace) - 64usize];
    ["Offset of field: libraw_metadata_common_t::firmware"]
        [::core::mem::offset_of!(libraw_metadata_common_t, firmware) - 66usize];
    ["Offset of field: libraw_metadata_common_t::ExposureCalibrationShift"]
        [::core::mem::offset_of!(libraw_metadata_common_t, ExposureCalibrationShift) - 196usize];
    ["Offset of field: libraw_metadata_common_t::afdata"]
        [::core::mem::offset_of!(libraw_metadata_common_t, afdata) - 200usize];
    ["Offset of field: libraw_metadata_common_t::afcount"]
        [::core::mem::offset_of!(libraw_metadata_common_t, afcount) - 296usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq)]
pub struct libraw_output_params_t {
    pub greybox: [libc::c_uint; 4usize],
    pub cropbox: [libc::c_uint; 4usize],
    pub aber: [f64; 4usize],
    pub gamm: [f64; 6usize],
    pub user_mul: [f32; 4usize],
    pub bright: f32,
    pub threshold: f32,
    pub half_size: libc::c_int,
    pub four_color_rgb: libc::c_int,
    pub highlight: libc::c_int,
    pub use_auto_wb: libc::c_int,
    pub use_camera_wb: libc::c_int,
    pub use_camera_matrix: libc::c_int,
    pub output_color: libc::c_int,
    pub output_profile: *mut libc::c_char,
    pub camera_profile: *mut libc::c_char,
    pub bad_pixels: *mut libc::c_char,
    pub dark_frame: *mut libc::c_char,
    pub output_bps: libc::c_int,
    pub output_tiff: libc::c_int,
    pub output_flags: libc::c_int,
    pub user_flip: libc::c_int,
    pub user_qual: libc::c_int,
    pub user_black: libc::c_int,
    pub user_cblack: [libc::c_int; 4usize],
    pub user_sat: libc::c_int,
    pub med_passes: libc::c_int,
    pub auto_bright_thr: f32,
    pub adjust_maximum_thr: f32,
    pub no_auto_bright: libc::c_int,
    pub use_fuji_rotate: libc::c_int,
    pub green_matching: libc::c_int,
    pub dcb_iterations: libc::c_int,
    pub dcb_enhance_fl: libc::c_int,
    pub fbdd_noiserd: libc::c_int,
    pub exp_correc: libc::c_int,
    pub exp_shift: f32,
    pub exp_preser: f32,
    pub no_auto_scale: libc::c_int,
    pub no_interpolation: libc::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of libraw_output_params_t"][::core::mem::size_of::<libraw_output_params_t>() - 304usize];
    ["Alignment of libraw_output_params_t"]
        [::core::mem::align_of::<libraw_output_params_t>() - 8usize];
    ["Offset of field: libraw_output_params_t::greybox"]
        [::core::mem::offset_of!(libraw_output_params_t, greybox) - 0usize];
    ["Offset of field: libraw_output_params_t::cropbox"]
        [::core::mem::offset_of!(libraw_output_params_t, cropbox) - 16usize];
    ["Offset of field: libraw_output_params_t::aber"]
        [::core::mem::offset_of!(libraw_output_params_t, aber) - 32usize];
    ["Offset of field: libraw_output_params_t::gamm"]
        [::core::mem::offset_of!(libraw_output_params_t, gamm) - 64usize];
    ["Offset of field: libraw_output_params_t::user_mul"]
        [::core::mem::offset_of!(libraw_output_params_t, user_mul) - 112usize];
    ["Offset of field: libraw_output_params_t::bright"]
        [::core::mem::offset_of!(libraw_output_params_t, bright) - 128usize];
    ["Offset of field: libraw_output_params_t::threshold"]
        [::core::mem::offset_of!(libraw_output_params_t, threshold) - 132usize];
    ["Offset of field: libraw_output_params_t::half_size"]
        [::core::mem::offset_of!(libraw_output_params_t, half_size) - 136usize];
    ["Offset of field: libraw_output_params_t::four_color_rgb"]
        [::core::mem::offset_of!(libraw_output_params_t, four_color_rgb) - 140usize];
    ["Offset of field: libraw_output_params_t::highlight"]
        [::core::mem::offset_of!(libraw_output_params_t, highlight) - 144usize];
    ["Offset of field: libraw_output_params_t::use_auto_wb"]
        [::core::mem::offset_of!(libraw_output_params_t, use_auto_wb) - 148usize];
    ["Offset of field: libraw_output_params_t::use_camera_wb"]
        [::core::mem::offset_of!(libraw_output_params_t, use_camera_wb) - 152usize];
    ["Offset of field: libraw_output_params_t::use_camera_matrix"]
        [::core::mem::offset_of!(libraw_output_params_t, use_camera_matrix) - 156usize];
    ["Offset of field: libraw_output_params_t::output_color"]
        [::core::mem::offset_of!(libraw_output_params_t, output_color) - 160usize];
    ["Offset of field: libraw_output_params_t::output_profile"]
        [::core::mem::offset_of!(libraw_output_params_t, output_profile) - 168usize];
    ["Offset of field: libraw_output_params_t::camera_profile"]
        [::core::mem::offset_of!(libraw_output_params_t, camera_profile) - 176usize];
    ["Offset of field: libraw_output_params_t::bad_pixels"]
        [::core::mem::offset_of!(libraw_output_params_t, bad_pixels) - 184usize];
    ["Offset of field: libraw_output_params_t::dark_frame"]
        [::core::mem::offset_of!(libraw_output_params_t, dark_frame) - 192usize];
    ["Offset of field: libraw_output_params_t::output_bps"]
        [::core::mem::offset_of!(libraw_output_params_t, output_bps) - 200usize];
    ["Offset of field: libraw_output_params_t::output_tiff"]
        [::core::mem::offset_of!(libraw_output_params_t, output_tiff) - 204usize];
    ["Offset of field: libraw_output_params_t::output_flags"]
        [::core::mem::offset_of!(libraw_output_params_t, output_flags) - 208usize];
    ["Offset of field: libraw_output_params_t::user_flip"]
        [::core::mem::offset_of!(libraw_output_params_t, user_flip) - 212usize];
    ["Offset of field: libraw_output_params_t::user_qual"]
        [::core::mem::offset_of!(libraw_output_params_t, user_qual) - 216usize];
    ["Offset of field: libraw_output_params_t::user_black"]
        [::core::mem::offset_of!(libraw_output_params_t, user_black) - 220usize];
    ["Offset of field: libraw_output_params_t::user_cblack"]
        [::core::mem::offset_of!(libraw_output_params_t, user_cblack) - 224usize];
    ["Offset of field: libraw_output_params_t::user_sat"]
        [::core::mem::offset_of!(libraw_output_params_t, user_sat) - 240usize];
    ["Offset of field: libraw_output_params_t::med_passes"]
        [::core::mem::offset_of!(libraw_output_params_t, med_passes) - 244usize];
    ["Offset of field: libraw_output_params_t::auto_bright_thr"]
        [::core::mem::offset_of!(libraw_output_params_t, auto_bright_thr) - 248usize];
    ["Offset of field: libraw_output_params_t::adjust_maximum_thr"]
        [::core::mem::offset_of!(libraw_output_params_t, adjust_maximum_thr) - 252usize];
    ["Offset of field: libraw_output_params_t::no_auto_bright"]
        [::core::mem::offset_of!(libraw_output_params_t, no_auto_bright) - 256usize];
    ["Offset of field: libraw_output_params_t::use_fuji_rotate"]
        [::core::mem::offset_of!(libraw_output_params_t, use_fuji_rotate) - 260usize];
    ["Offset of field: libraw_output_params_t::green_matching"]
        [::core::mem::offset_of!(libraw_output_params_t, green_matching) - 264usize];
    ["Offset of field: libraw_output_params_t::dcb_iterations"]
        [::core::mem::offset_of!(libraw_output_params_t, dcb_iterations) - 268usize];
    ["Offset of field: libraw_output_params_t::dcb_enhance_fl"]
        [::core::mem::offset_of!(libraw_output_params_t, dcb_enhance_fl) - 272usize];
    ["Offset of field: libraw_output_params_t::fbdd_noiserd"]
        [::core::mem::offset_of!(libraw_output_params_t, fbdd_noiserd) - 276usize];
    ["Offset of field: libraw_output_params_t::exp_correc"]
        [::core::mem::offset_of!(libraw_output_params_t, exp_correc) - 280usize];
    ["Offset of field: libraw_output_params_t::exp_shift"]
        [::core::mem::offset_of!(libraw_output_params_t, exp_shift) - 284usize];
    ["Offset of field: libraw_output_params_t::exp_preser"]
        [::core::mem::offset_of!(libraw_output_params_t, exp_preser) - 288usize];
    ["Offset of field: libraw_output_params_t::no_auto_scale"]
        [::core::mem::offset_of!(libraw_output_params_t, no_auto_scale) - 292usize];
    ["Offset of field: libraw_output_params_t::no_interpolation"]
        [::core::mem::offset_of!(libraw_output_params_t, no_interpolation) - 296usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq)]
pub struct libraw_raw_unpack_params_t {
    pub use_rawspeed: libc::c_int,
    pub use_dngsdk: libc::c_int,
    pub options: libc::c_uint,
    pub shot_select: libc::c_uint,
    pub specials: libc::c_uint,
    pub max_raw_memory_mb: libc::c_uint,
    pub sony_arw2_posterization_thr: libc::c_int,
    pub coolscan_nef_gamma: f32,
    pub p4shot_order: [libc::c_char; 5usize],
    pub custom_camera_strings: *mut *mut libc::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of libraw_raw_unpack_params_t"]
        [::core::mem::size_of::<libraw_raw_unpack_params_t>() - 48usize];
    ["Alignment of libraw_raw_unpack_params_t"]
        [::core::mem::align_of::<libraw_raw_unpack_params_t>() - 8usize];
    ["Offset of field: libraw_raw_unpack_params_t::use_rawspeed"]
        [::core::mem::offset_of!(libraw_raw_unpack_params_t, use_rawspeed) - 0usize];
    ["Offset of field: libraw_raw_unpack_params_t::use_dngsdk"]
        [::core::mem::offset_of!(libraw_raw_unpack_params_t, use_dngsdk) - 4usize];
    ["Offset of field: libraw_raw_unpack_params_t::options"]
        [::core::mem::offset_of!(libraw_raw_unpack_params_t, options) - 8usize];
    ["Offset of field: libraw_raw_unpack_params_t::shot_select"]
        [::core::mem::offset_of!(libraw_raw_unpack_params_t, shot_select) - 12usize];
    ["Offset of field: libraw_raw_unpack_params_t::specials"]
        [::core::mem::offset_of!(libraw_raw_unpack_params_t, specials) - 16usize];
    ["Offset of field: libraw_raw_unpack_params_t::max_raw_memory_mb"]
        [::core::mem::offset_of!(libraw_raw_unpack_params_t, max_raw_memory_mb) - 20usize];
    ["Offset of field: libraw_raw_unpack_params_t::sony_arw2_posterization_thr"][::core::mem::offset_of!(
        libraw_raw_unpack_params_t,
        sony_arw2_posterization_thr
    ) - 24usize];
    ["Offset of field: libraw_raw_unpack_params_t::coolscan_nef_gamma"]
        [::core::mem::offset_of!(libraw_raw_unpack_params_t, coolscan_nef_gamma) - 28usize];
    ["Offset of field: libraw_raw_unpack_params_t::p4shot_order"]
        [::core::mem::offset_of!(libraw_raw_unpack_params_t, p4shot_order) - 32usize];
    ["Offset of field: libraw_raw_unpack_params_t::custom_camera_strings"]
        [::core::mem::offset_of!(libraw_raw_unpack_params_t, custom_camera_strings) - 40usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq)]
pub struct libraw_rawdata_t {
    pub raw_alloc: *mut libc::c_void,
    pub raw_image: *mut ushort,
    pub color4_image: *mut [ushort; 4usize],
    pub color3_image: *mut [ushort; 3usize],
    pub float_image: *mut f32,
    pub float3_image: *mut [f32; 3usize],
    pub float4_image: *mut [f32; 4usize],
    pub ph1_cblack: *mut [libc::c_short; 2usize],
    pub ph1_rblack: *mut [libc::c_short; 2usize],
    pub iparams: libraw_iparams_t,
    pub sizes: libraw_image_sizes_t,
    pub ioparams: libraw_internal_output_params_t,
    pub color: libraw_colordata_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of libraw_rawdata_t"][::core::mem::size_of::<libraw_rawdata_t>() - 187744usize];
    ["Alignment of libraw_rawdata_t"][::core::mem::align_of::<libraw_rawdata_t>() - 8usize];
    ["Offset of field: libraw_rawdata_t::raw_alloc"]
        [::core::mem::offset_of!(libraw_rawdata_t, raw_alloc) - 0usize];
    ["Offset of field: libraw_rawdata_t::raw_image"]
        [::core::mem::offset_of!(libraw_rawdata_t, raw_image) - 8usize];
    ["Offset of field: libraw_rawdata_t::color4_image"]
        [::core::mem::offset_of!(libraw_rawdata_t, color4_image) - 16usize];
    ["Offset of field: libraw_rawdata_t::color3_image"]
        [::core::mem::offset_of!(libraw_rawdata_t, color3_image) - 24usize];
    ["Offset of field: libraw_rawdata_t::float_image"]
        [::core::mem::offset_of!(libraw_rawdata_t, float_image) - 32usize];
    ["Offset of field: libraw_rawdata_t::float3_image"]
        [::core::mem::offset_of!(libraw_rawdata_t, float3_image) - 40usize];
    ["Offset of field: libraw_rawdata_t::float4_image"]
        [::core::mem::offset_of!(libraw_rawdata_t, float4_image) - 48usize];
    ["Offset of field: libraw_rawdata_t::ph1_cblack"]
        [::core::mem::offset_of!(libraw_rawdata_t, ph1_cblack) - 56usize];
    ["Offset of field: libraw_rawdata_t::ph1_rblack"]
        [::core::mem::offset_of!(libraw_rawdata_t, ph1_rblack) - 64usize];
    ["Offset of field: libraw_rawdata_t::iparams"]
        [::core::mem::offset_of!(libraw_rawdata_t, iparams) - 72usize];
    ["Offset of field: libraw_rawdata_t::sizes"]
        [::core::mem::offset_of!(libraw_rawdata_t, sizes) - 512usize];
    ["Offset of field: libraw_rawdata_t::ioparams"]
        [::core::mem::offset_of!(libraw_rawdata_t, ioparams) - 696usize];
    ["Offset of field: libraw_rawdata_t::color"]
        [::core::mem::offset_of!(libraw_rawdata_t, color) - 712usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq)]
pub struct libraw_makernotes_lens_t {
    pub LensID: libc::c_ulonglong,
    pub Lens: [libc::c_char; 128usize],
    pub LensFormat: ushort,
    pub LensMount: ushort,
    pub CamID: libc::c_ulonglong,
    pub CameraFormat: ushort,
    pub CameraMount: ushort,
    pub body: [libc::c_char; 64usize],
    pub FocalType: libc::c_short,
    pub LensFeatures_pre: [libc::c_char; 16usize],
    pub LensFeatures_suf: [libc::c_char; 16usize],
    pub MinFocal: f32,
    pub MaxFocal: f32,
    pub MaxAp4MinFocal: f32,
    pub MaxAp4MaxFocal: f32,
    pub MinAp4MinFocal: f32,
    pub MinAp4MaxFocal: f32,
    pub MaxAp: f32,
    pub MinAp: f32,
    pub CurFocal: f32,
    pub CurAp: f32,
    pub MaxAp4CurFocal: f32,
    pub MinAp4CurFocal: f32,
    pub MinFocusDistance: f32,
    pub FocusRangeIndex: f32,
    pub LensFStops: f32,
    pub TeleconverterID: libc::c_ulonglong,
    pub Teleconverter: [libc::c_char; 128usize],
    pub AdapterID: libc::c_ulonglong,
    pub Adapter: [libc::c_char; 128usize],
    pub AttachmentID: libc::c_ulonglong,
    pub Attachment: [libc::c_char; 128usize],
    pub FocalUnits: ushort,
    pub FocalLengthIn35mmFormat: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of libraw_makernotes_lens_t"]
        [::core::mem::size_of::<libraw_makernotes_lens_t>() - 736usize];
    ["Alignment of libraw_makernotes_lens_t"]
        [::core::mem::align_of::<libraw_makernotes_lens_t>() - 8usize];
    ["Offset of field: libraw_makernotes_lens_t::LensID"]
        [::core::mem::offset_of!(libraw_makernotes_lens_t, LensID) - 0usize];
    ["Offset of field: libraw_makernotes_lens_t::Lens"]
        [::core::mem::offset_of!(libraw_makernotes_lens_t, Lens) - 8usize];
    ["Offset of field: libraw_makernotes_lens_t::LensFormat"]
        [::core::mem::offset_of!(libraw_makernotes_lens_t, LensFormat) - 136usize];
    ["Offset of field: libraw_makernotes_lens_t::LensMount"]
        [::core::mem::offset_of!(libraw_makernotes_lens_t, LensMount) - 138usize];
    ["Offset of field: libraw_makernotes_lens_t::CamID"]
        [::core::mem::offset_of!(libraw_makernotes_lens_t, CamID) - 144usize];
    ["Offset of field: libraw_makernotes_lens_t::CameraFormat"]
        [::core::mem::offset_of!(libraw_makernotes_lens_t, CameraFormat) - 152usize];
    ["Offset of field: libraw_makernotes_lens_t::CameraMount"]
        [::core::mem::offset_of!(libraw_makernotes_lens_t, CameraMount) - 154usize];
    ["Offset of field: libraw_makernotes_lens_t::body"]
        [::core::mem::offset_of!(libraw_makernotes_lens_t, body) - 156usize];
    ["Offset of field: libraw_makernotes_lens_t::FocalType"]
        [::core::mem::offset_of!(libraw_makernotes_lens_t, FocalType) - 220usize];
    ["Offset of field: libraw_makernotes_lens_t::LensFeatures_pre"]
        [::core::mem::offset_of!(libraw_makernotes_lens_t, LensFeatures_pre) - 222usize];
    ["Offset of field: libraw_makernotes_lens_t::LensFeatures_suf"]
        [::core::mem::offset_of!(libraw_makernotes_lens_t, LensFeatures_suf) - 238usize];
    ["Offset of field: libraw_makernotes_lens_t::MinFocal"]
        [::core::mem::offset_of!(libraw_makernotes_lens_t, MinFocal) - 256usize];
    ["Offset of field: libraw_makernotes_lens_t::MaxFocal"]
        [::core::mem::offset_of!(libraw_makernotes_lens_t, MaxFocal) - 260usize];
    ["Offset of field: libraw_makernotes_lens_t::MaxAp4MinFocal"]
        [::core::mem::offset_of!(libraw_makernotes_lens_t, MaxAp4MinFocal) - 264usize];
    ["Offset of field: libraw_makernotes_lens_t::MaxAp4MaxFocal"]
        [::core::mem::offset_of!(libraw_makernotes_lens_t, MaxAp4MaxFocal) - 268usize];
    ["Offset of field: libraw_makernotes_lens_t::MinAp4MinFocal"]
        [::core::mem::offset_of!(libraw_makernotes_lens_t, MinAp4MinFocal) - 272usize];
    ["Offset of field: libraw_makernotes_lens_t::MinAp4MaxFocal"]
        [::core::mem::offset_of!(libraw_makernotes_lens_t, MinAp4MaxFocal) - 276usize];
    ["Offset of field: libraw_makernotes_lens_t::MaxAp"]
        [::core::mem::offset_of!(libraw_makernotes_lens_t, MaxAp) - 280usize];
    ["Offset of field: libraw_makernotes_lens_t::MinAp"]
        [::core::mem::offset_of!(libraw_makernotes_lens_t, MinAp) - 284usize];
    ["Offset of field: libraw_makernotes_lens_t::CurFocal"]
        [::core::mem::offset_of!(libraw_makernotes_lens_t, CurFocal) - 288usize];
    ["Offset of field: libraw_makernotes_lens_t::CurAp"]
        [::core::mem::offset_of!(libraw_makernotes_lens_t, CurAp) - 292usize];
    ["Offset of field: libraw_makernotes_lens_t::MaxAp4CurFocal"]
        [::core::mem::offset_of!(libraw_makernotes_lens_t, MaxAp4CurFocal) - 296usize];
    ["Offset of field: libraw_makernotes_lens_t::MinAp4CurFocal"]
        [::core::mem::offset_of!(libraw_makernotes_lens_t, MinAp4CurFocal) - 300usize];
    ["Offset of field: libraw_makernotes_lens_t::MinFocusDistance"]
        [::core::mem::offset_of!(libraw_makernotes_lens_t, MinFocusDistance) - 304usize];
    ["Offset of field: libraw_makernotes_lens_t::FocusRangeIndex"]
        [::core::mem::offset_of!(libraw_makernotes_lens_t, FocusRangeIndex) - 308usize];
    ["Offset of field: libraw_makernotes_lens_t::LensFStops"]
        [::core::mem::offset_of!(libraw_makernotes_lens_t, LensFStops) - 312usize];
    ["Offset of field: libraw_makernotes_lens_t::TeleconverterID"]
        [::core::mem::offset_of!(libraw_makernotes_lens_t, TeleconverterID) - 320usize];
    ["Offset of field: libraw_makernotes_lens_t::Teleconverter"]
        [::core::mem::offset_of!(libraw_makernotes_lens_t, Teleconverter) - 328usize];
    ["Offset of field: libraw_makernotes_lens_t::AdapterID"]
        [::core::mem::offset_of!(libraw_makernotes_lens_t, AdapterID) - 456usize];
    ["Offset of field: libraw_makernotes_lens_t::Adapter"]
        [::core::mem::offset_of!(libraw_makernotes_lens_t, Adapter) - 464usize];
    ["Offset of field: libraw_makernotes_lens_t::AttachmentID"]
        [::core::mem::offset_of!(libraw_makernotes_lens_t, AttachmentID) - 592usize];
    ["Offset of field: libraw_makernotes_lens_t::Attachment"]
        [::core::mem::offset_of!(libraw_makernotes_lens_t, Attachment) - 600usize];
    ["Offset of field: libraw_makernotes_lens_t::FocalUnits"]
        [::core::mem::offset_of!(libraw_makernotes_lens_t, FocalUnits) - 728usize];
    ["Offset of field: libraw_makernotes_lens_t::FocalLengthIn35mmFormat"]
        [::core::mem::offset_of!(libraw_makernotes_lens_t, FocalLengthIn35mmFormat) - 732usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq)]
pub struct libraw_nikonlens_t {
    pub EffectiveMaxAp: f32,
    pub LensIDNumber: uchar,
    pub LensFStops: uchar,
    pub MCUVersion: uchar,
    pub LensType: uchar,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of libraw_nikonlens_t"][::core::mem::size_of::<libraw_nikonlens_t>() - 8usize];
    ["Alignment of libraw_nikonlens_t"][::core::mem::align_of::<libraw_nikonlens_t>() - 4usize];
    ["Offset of field: libraw_nikonlens_t::EffectiveMaxAp"]
        [::core::mem::offset_of!(libraw_nikonlens_t, EffectiveMaxAp) - 0usize];
    ["Offset of field: libraw_nikonlens_t::LensIDNumber"]
        [::core::mem::offset_of!(libraw_nikonlens_t, LensIDNumber) - 4usize];
    ["Offset of field: libraw_nikonlens_t::LensFStops"]
        [::core::mem::offset_of!(libraw_nikonlens_t, LensFStops) - 5usize];
    ["Offset of field: libraw_nikonlens_t::MCUVersion"]
        [::core::mem::offset_of!(libraw_nikonlens_t, MCUVersion) - 6usize];
    ["Offset of field: libraw_nikonlens_t::LensType"]
        [::core::mem::offset_of!(libraw_nikonlens_t, LensType) - 7usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq)]
pub struct libraw_dnglens_t {
    pub MinFocal: f32,
    pub MaxFocal: f32,
    pub MaxAp4MinFocal: f32,
    pub MaxAp4MaxFocal: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of libraw_dnglens_t"][::core::mem::size_of::<libraw_dnglens_t>() - 16usize];
    ["Alignment of libraw_dnglens_t"][::core::mem::align_of::<libraw_dnglens_t>() - 4usize];
    ["Offset of field: libraw_dnglens_t::MinFocal"]
        [::core::mem::offset_of!(libraw_dnglens_t, MinFocal) - 0usize];
    ["Offset of field: libraw_dnglens_t::MaxFocal"]
        [::core::mem::offset_of!(libraw_dnglens_t, MaxFocal) - 4usize];
    ["Offset of field: libraw_dnglens_t::MaxAp4MinFocal"]
        [::core::mem::offset_of!(libraw_dnglens_t, MaxAp4MinFocal) - 8usize];
    ["Offset of field: libraw_dnglens_t::MaxAp4MaxFocal"]
        [::core::mem::offset_of!(libraw_dnglens_t, MaxAp4MaxFocal) - 12usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq)]
pub struct libraw_lensinfo_t {
    pub MinFocal: f32,
    pub MaxFocal: f32,
    pub MaxAp4MinFocal: f32,
    pub MaxAp4MaxFocal: f32,
    pub EXIF_MaxAp: f32,
    pub LensMake: [libc::c_char; 128usize],
    pub Lens: [libc::c_char; 128usize],
    pub LensSerial: [libc::c_char; 128usize],
    pub InternalLensSerial: [libc::c_char; 128usize],
    pub FocalLengthIn35mmFormat: ushort,
    pub nikon: libraw_nikonlens_t,
    pub dng: libraw_dnglens_t,
    pub makernotes: libraw_makernotes_lens_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of libraw_lensinfo_t"][::core::mem::size_of::<libraw_lensinfo_t>() - 1296usize];
    ["Alignment of libraw_lensinfo_t"][::core::mem::align_of::<libraw_lensinfo_t>() - 8usize];
    ["Offset of field: libraw_lensinfo_t::MinFocal"]
        [::core::mem::offset_of!(libraw_lensinfo_t, MinFocal) - 0usize];
    ["Offset of field: libraw_lensinfo_t::MaxFocal"]
        [::core::mem::offset_of!(libraw_lensinfo_t, MaxFocal) - 4usize];
    ["Offset of field: libraw_lensinfo_t::MaxAp4MinFocal"]
        [::core::mem::offset_of!(libraw_lensinfo_t, MaxAp4MinFocal) - 8usize];
    ["Offset of field: libraw_lensinfo_t::MaxAp4MaxFocal"]
        [::core::mem::offset_of!(libraw_lensinfo_t, MaxAp4MaxFocal) - 12usize];
    ["Offset of field: libraw_lensinfo_t::EXIF_MaxAp"]
        [::core::mem::offset_of!(libraw_lensinfo_t, EXIF_MaxAp) - 16usize];
    ["Offset of field: libraw_lensinfo_t::LensMake"]
        [::core::mem::offset_of!(libraw_lensinfo_t, LensMake) - 20usize];
    ["Offset of field: libraw_lensinfo_t::Lens"]
        [::core::mem::offset_of!(libraw_lensinfo_t, Lens) - 148usize];
    ["Offset of field: libraw_lensinfo_t::LensSerial"]
        [::core::mem::offset_of!(libraw_lensinfo_t, LensSerial) - 276usize];
    ["Offset of field: libraw_lensinfo_t::InternalLensSerial"]
        [::core::mem::offset_of!(libraw_lensinfo_t, InternalLensSerial) - 404usize];
    ["Offset of field: libraw_lensinfo_t::FocalLengthIn35mmFormat"]
        [::core::mem::offset_of!(libraw_lensinfo_t, FocalLengthIn35mmFormat) - 532usize];
    ["Offset of field: libraw_lensinfo_t::nikon"]
        [::core::mem::offset_of!(libraw_lensinfo_t, nikon) - 536usize];
    ["Offset of field: libraw_lensinfo_t::dng"]
        [::core::mem::offset_of!(libraw_lensinfo_t, dng) - 544usize];
    ["Offset of field: libraw_lensinfo_t::makernotes"]
        [::core::mem::offset_of!(libraw_lensinfo_t, makernotes) - 560usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq)]
pub struct libraw_makernotes_t {
    pub canon: libraw_canon_makernotes_t,
    pub nikon: libraw_nikon_makernotes_t,
    pub hasselblad: libraw_hasselblad_makernotes_t,
    pub fuji: libraw_fuji_info_t,
    pub olympus: libraw_olympus_makernotes_t,
    pub sony: libraw_sony_info_t,
    pub kodak: libraw_kodak_makernotes_t,
    pub panasonic: libraw_panasonic_makernotes_t,
    pub pentax: libraw_pentax_makernotes_t,
    pub phaseone: libraw_p1_makernotes_t,
    pub ricoh: libraw_ricoh_makernotes_t,
    pub samsung: libraw_samsung_makernotes_t,
    pub common: libraw_metadata_common_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of libraw_makernotes_t"][::core::mem::size_of::<libraw_makernotes_t>() - 2952usize];
    ["Alignment of libraw_makernotes_t"][::core::mem::align_of::<libraw_makernotes_t>() - 8usize];
    ["Offset of field: libraw_makernotes_t::canon"]
        [::core::mem::offset_of!(libraw_makernotes_t, canon) - 0usize];
    ["Offset of field: libraw_makernotes_t::nikon"]
        [::core::mem::offset_of!(libraw_makernotes_t, nikon) - 168usize];
    ["Offset of field: libraw_makernotes_t::hasselblad"]
        [::core::mem::offset_of!(libraw_makernotes_t, hasselblad) - 392usize];
    ["Offset of field: libraw_makernotes_t::fuji"]
        [::core::mem::offset_of!(libraw_makernotes_t, fuji) - 776usize];
    ["Offset of field: libraw_makernotes_t::olympus"]
        [::core::mem::offset_of!(libraw_makernotes_t, olympus) - 1056usize];
    ["Offset of field: libraw_makernotes_t::sony"]
        [::core::mem::offset_of!(libraw_makernotes_t, sony) - 1464usize];
    ["Offset of field: libraw_makernotes_t::kodak"]
        [::core::mem::offset_of!(libraw_makernotes_t, kodak) - 1644usize];
    ["Offset of field: libraw_makernotes_t::panasonic"]
        [::core::mem::offset_of!(libraw_makernotes_t, panasonic) - 1888usize];
    ["Offset of field: libraw_makernotes_t::pentax"]
        [::core::mem::offset_of!(libraw_makernotes_t, pentax) - 1956usize];
    ["Offset of field: libraw_makernotes_t::phaseone"]
        [::core::mem::offset_of!(libraw_makernotes_t, phaseone) - 1988usize];
    ["Offset of field: libraw_makernotes_t::ricoh"]
        [::core::mem::offset_of!(libraw_makernotes_t, ricoh) - 2440usize];
    ["Offset of field: libraw_makernotes_t::samsung"]
        [::core::mem::offset_of!(libraw_makernotes_t, samsung) - 2512usize];
    ["Offset of field: libraw_makernotes_t::common"]
        [::core::mem::offset_of!(libraw_makernotes_t, common) - 2648usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct libraw_shootinginfo_t {
    pub DriveMode: libc::c_short,
    pub FocusMode: libc::c_short,
    pub MeteringMode: libc::c_short,
    pub AFPoint: libc::c_short,
    pub ExposureMode: libc::c_short,
    pub ExposureProgram: libc::c_short,
    pub ImageStabilization: libc::c_short,
    pub BodySerial: [libc::c_char; 64usize],
    pub InternalBodySerial: [libc::c_char; 64usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of libraw_shootinginfo_t"][::core::mem::size_of::<libraw_shootinginfo_t>() - 142usize];
    ["Alignment of libraw_shootinginfo_t"]
        [::core::mem::align_of::<libraw_shootinginfo_t>() - 2usize];
    ["Offset of field: libraw_shootinginfo_t::DriveMode"]
        [::core::mem::offset_of!(libraw_shootinginfo_t, DriveMode) - 0usize];
    ["Offset of field: libraw_shootinginfo_t::FocusMode"]
        [::core::mem::offset_of!(libraw_shootinginfo_t, FocusMode) - 2usize];
    ["Offset of field: libraw_shootinginfo_t::MeteringMode"]
        [::core::mem::offset_of!(libraw_shootinginfo_t, MeteringMode) - 4usize];
    ["Offset of field: libraw_shootinginfo_t::AFPoint"]
        [::core::mem::offset_of!(libraw_shootinginfo_t, AFPoint) - 6usize];
    ["Offset of field: libraw_shootinginfo_t::ExposureMode"]
        [::core::mem::offset_of!(libraw_shootinginfo_t, ExposureMode) - 8usize];
    ["Offset of field: libraw_shootinginfo_t::ExposureProgram"]
        [::core::mem::offset_of!(libraw_shootinginfo_t, ExposureProgram) - 10usize];
    ["Offset of field: libraw_shootinginfo_t::ImageStabilization"]
        [::core::mem::offset_of!(libraw_shootinginfo_t, ImageStabilization) - 12usize];
    ["Offset of field: libraw_shootinginfo_t::BodySerial"]
        [::core::mem::offset_of!(libraw_shootinginfo_t, BodySerial) - 14usize];
    ["Offset of field: libraw_shootinginfo_t::InternalBodySerial"]
        [::core::mem::offset_of!(libraw_shootinginfo_t, InternalBodySerial) - 78usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct libraw_custom_camera_t {
    pub fsize: libc::c_uint,
    pub rw: ushort,
    pub rh: ushort,
    pub lm: uchar,
    pub tm: uchar,
    pub rm: uchar,
    pub bm: uchar,
    pub lf: ushort,
    pub cf: uchar,
    pub max: uchar,
    pub flags: uchar,
    pub t_make: [libc::c_char; 10usize],
    pub t_model: [libc::c_char; 20usize],
    pub offset: ushort,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of libraw_custom_camera_t"][::core::mem::size_of::<libraw_custom_camera_t>() - 52usize];
    ["Alignment of libraw_custom_camera_t"]
        [::core::mem::align_of::<libraw_custom_camera_t>() - 4usize];
    ["Offset of field: libraw_custom_camera_t::fsize"]
        [::core::mem::offset_of!(libraw_custom_camera_t, fsize) - 0usize];
    ["Offset of field: libraw_custom_camera_t::rw"]
        [::core::mem::offset_of!(libraw_custom_camera_t, rw) - 4usize];
    ["Offset of field: libraw_custom_camera_t::rh"]
        [::core::mem::offset_of!(libraw_custom_camera_t, rh) - 6usize];
    ["Offset of field: libraw_custom_camera_t::lm"]
        [::core::mem::offset_of!(libraw_custom_camera_t, lm) - 8usize];
    ["Offset of field: libraw_custom_camera_t::tm"]
        [::core::mem::offset_of!(libraw_custom_camera_t, tm) - 9usize];
    ["Offset of field: libraw_custom_camera_t::rm"]
        [::core::mem::offset_of!(libraw_custom_camera_t, rm) - 10usize];
    ["Offset of field: libraw_custom_camera_t::bm"]
        [::core::mem::offset_of!(libraw_custom_camera_t, bm) - 11usize];
    ["Offset of field: libraw_custom_camera_t::lf"]
        [::core::mem::offset_of!(libraw_custom_camera_t, lf) - 12usize];
    ["Offset of field: libraw_custom_camera_t::cf"]
        [::core::mem::offset_of!(libraw_custom_camera_t, cf) - 14usize];
    ["Offset of field: libraw_custom_camera_t::max"]
        [::core::mem::offset_of!(libraw_custom_camera_t, max) - 15usize];
    ["Offset of field: libraw_custom_camera_t::flags"]
        [::core::mem::offset_of!(libraw_custom_camera_t, flags) - 16usize];
    ["Offset of field: libraw_custom_camera_t::t_make"]
        [::core::mem::offset_of!(libraw_custom_camera_t, t_make) - 17usize];
    ["Offset of field: libraw_custom_camera_t::t_model"]
        [::core::mem::offset_of!(libraw_custom_camera_t, t_model) - 27usize];
    ["Offset of field: libraw_custom_camera_t::offset"]
        [::core::mem::offset_of!(libraw_custom_camera_t, offset) - 48usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq)]
pub struct libraw_data_t {
    pub image: *mut [ushort; 4usize],
    pub sizes: libraw_image_sizes_t,
    pub idata: libraw_iparams_t,
    pub lens: libraw_lensinfo_t,
    pub makernotes: libraw_makernotes_t,
    pub shootinginfo: libraw_shootinginfo_t,
    pub params: libraw_output_params_t,
    pub rawparams: libraw_raw_unpack_params_t,
    pub progress_flags: libc::c_uint,
    pub process_warnings: libc::c_uint,
    pub color: libraw_colordata_t,
    pub other: libraw_imgother_t,
    pub thumbnail: libraw_thumbnail_t,
    pub thumbs_list: libraw_thumbnail_list_t,
    pub rawdata: libraw_rawdata_t,
    pub parent_class: *mut libc::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of libraw_data_t"][::core::mem::size_of::<libraw_data_t>() - 381256usize];
    ["Alignment of libraw_data_t"][::core::mem::align_of::<libraw_data_t>() - 8usize];
    ["Offset of field: libraw_data_t::image"]
        [::core::mem::offset_of!(libraw_data_t, image) - 0usize];
    ["Offset of field: libraw_data_t::sizes"]
        [::core::mem::offset_of!(libraw_data_t, sizes) - 8usize];
    ["Offset of field: libraw_data_t::idata"]
        [::core::mem::offset_of!(libraw_data_t, idata) - 192usize];
    ["Offset of field: libraw_data_t::lens"]
        [::core::mem::offset_of!(libraw_data_t, lens) - 632usize];
    ["Offset of field: libraw_data_t::makernotes"]
        [::core::mem::offset_of!(libraw_data_t, makernotes) - 1928usize];
    ["Offset of field: libraw_data_t::shootinginfo"]
        [::core::mem::offset_of!(libraw_data_t, shootinginfo) - 4880usize];
    ["Offset of field: libraw_data_t::params"]
        [::core::mem::offset_of!(libraw_data_t, params) - 5024usize];
    ["Offset of field: libraw_data_t::rawparams"]
        [::core::mem::offset_of!(libraw_data_t, rawparams) - 5328usize];
    ["Offset of field: libraw_data_t::progress_flags"]
        [::core::mem::offset_of!(libraw_data_t, progress_flags) - 5376usize];
    ["Offset of field: libraw_data_t::process_warnings"]
        [::core::mem::offset_of!(libraw_data_t, process_warnings) - 5380usize];
    ["Offset of field: libraw_data_t::color"]
        [::core::mem::offset_of!(libraw_data_t, color) - 5384usize];
    ["Offset of field: libraw_data_t::other"]
        [::core::mem::offset_of!(libraw_data_t, other) - 192416usize];
    ["Offset of field: libraw_data_t::thumbnail"]
        [::core::mem::offset_of!(libraw_data_t, thumbnail) - 193216usize];
    ["Offset of field: libraw_data_t::thumbs_list"]
        [::core::mem::offset_of!(libraw_data_t, thumbs_list) - 193240usize];
    ["Offset of field: libraw_data_t::rawdata"]
        [::core::mem::offset_of!(libraw_data_t, rawdata) - 193504usize];
    ["Offset of field: libraw_data_t::parent_class"]
        [::core::mem::offset_of!(libraw_data_t, parent_class) - 381248usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct fuji_q_table {
    pub q_table: *mut i8,
    pub raw_bits: libc::c_int,
    pub total_values: libc::c_int,
    pub max_grad: libc::c_int,
    pub q_grad_mult: libc::c_int,
    pub q_base: libc::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fuji_q_table"][::core::mem::size_of::<fuji_q_table>() - 32usize];
    ["Alignment of fuji_q_table"][::core::mem::align_of::<fuji_q_table>() - 8usize];
    ["Offset of field: fuji_q_table::q_table"]
        [::core::mem::offset_of!(fuji_q_table, q_table) - 0usize];
    ["Offset of field: fuji_q_table::raw_bits"]
        [::core::mem::offset_of!(fuji_q_table, raw_bits) - 8usize];
    ["Offset of field: fuji_q_table::total_values"]
        [::core::mem::offset_of!(fuji_q_table, total_values) - 12usize];
    ["Offset of field: fuji_q_table::max_grad"]
        [::core::mem::offset_of!(fuji_q_table, max_grad) - 16usize];
    ["Offset of field: fuji_q_table::q_grad_mult"]
        [::core::mem::offset_of!(fuji_q_table, q_grad_mult) - 20usize];
    ["Offset of field: fuji_q_table::q_base"]
        [::core::mem::offset_of!(fuji_q_table, q_base) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct fuji_compressed_params {
    pub qt: [fuji_q_table; 4usize],
    pub buf: *mut libc::c_void,
    pub max_bits: libc::c_int,
    pub min_value: libc::c_int,
    pub max_value: libc::c_int,
    pub line_width: ushort,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fuji_compressed_params"][::core::mem::size_of::<fuji_compressed_params>() - 152usize];
    ["Alignment of fuji_compressed_params"]
        [::core::mem::align_of::<fuji_compressed_params>() - 8usize];
    ["Offset of field: fuji_compressed_params::qt"]
        [::core::mem::offset_of!(fuji_compressed_params, qt) - 0usize];
    ["Offset of field: fuji_compressed_params::buf"]
        [::core::mem::offset_of!(fuji_compressed_params, buf) - 128usize];
    ["Offset of field: fuji_compressed_params::max_bits"]
        [::core::mem::offset_of!(fuji_compressed_params, max_bits) - 136usize];
    ["Offset of field: fuji_compressed_params::min_value"]
        [::core::mem::offset_of!(fuji_compressed_params, min_value) - 140usize];
    ["Offset of field: fuji_compressed_params::max_value"]
        [::core::mem::offset_of!(fuji_compressed_params, max_value) - 144usize];
    ["Offset of field: fuji_compressed_params::line_width"]
        [::core::mem::offset_of!(fuji_compressed_params, line_width) - 148usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct internal_data_t {
    pub input: *mut LibRaw_abstract_datastream,
    pub output: *mut FILE,
    pub input_internal: libc::c_int,
    pub meta_data: *mut libc::c_char,
    pub profile_offset: INT64,
    pub toffset: INT64,
    pub pana_black: [libc::c_uint; 4usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of internal_data_t"][::core::mem::size_of::<internal_data_t>() - 64usize];
    ["Alignment of internal_data_t"][::core::mem::align_of::<internal_data_t>() - 8usize];
    ["Offset of field: internal_data_t::input"]
        [::core::mem::offset_of!(internal_data_t, input) - 0usize];
    ["Offset of field: internal_data_t::output"]
        [::core::mem::offset_of!(internal_data_t, output) - 8usize];
    ["Offset of field: internal_data_t::input_internal"]
        [::core::mem::offset_of!(internal_data_t, input_internal) - 16usize];
    ["Offset of field: internal_data_t::meta_data"]
        [::core::mem::offset_of!(internal_data_t, meta_data) - 24usize];
    ["Offset of field: internal_data_t::profile_offset"]
        [::core::mem::offset_of!(internal_data_t, profile_offset) - 32usize];
    ["Offset of field: internal_data_t::toffset"]
        [::core::mem::offset_of!(internal_data_t, toffset) - 40usize];
    ["Offset of field: internal_data_t::pana_black"]
        [::core::mem::offset_of!(internal_data_t, pana_black) - 48usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct output_data_t {
    pub histogram: *mut [libc::c_int; 8192usize],
    pub oprof: *mut libc::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of output_data_t"][::core::mem::size_of::<output_data_t>() - 16usize];
    ["Alignment of output_data_t"][::core::mem::align_of::<output_data_t>() - 8usize];
    ["Offset of field: output_data_t::histogram"]
        [::core::mem::offset_of!(output_data_t, histogram) - 0usize];
    ["Offset of field: output_data_t::oprof"]
        [::core::mem::offset_of!(output_data_t, oprof) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct identify_data_t {
    pub olympus_exif_cfa: libc::c_uint,
    pub unique_id: libc::c_ulonglong,
    pub OlyID: libc::c_ulonglong,
    pub tiff_nifds: libc::c_uint,
    pub tiff_flip: libc::c_int,
    pub metadata_blocks: libc::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of identify_data_t"][::core::mem::size_of::<identify_data_t>() - 40usize];
    ["Alignment of identify_data_t"][::core::mem::align_of::<identify_data_t>() - 8usize];
    ["Offset of field: identify_data_t::olympus_exif_cfa"]
        [::core::mem::offset_of!(identify_data_t, olympus_exif_cfa) - 0usize];
    ["Offset of field: identify_data_t::unique_id"]
        [::core::mem::offset_of!(identify_data_t, unique_id) - 8usize];
    ["Offset of field: identify_data_t::OlyID"]
        [::core::mem::offset_of!(identify_data_t, OlyID) - 16usize];
    ["Offset of field: identify_data_t::tiff_nifds"]
        [::core::mem::offset_of!(identify_data_t, tiff_nifds) - 24usize];
    ["Offset of field: identify_data_t::tiff_flip"]
        [::core::mem::offset_of!(identify_data_t, tiff_flip) - 28usize];
    ["Offset of field: identify_data_t::metadata_blocks"]
        [::core::mem::offset_of!(identify_data_t, metadata_blocks) - 32usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct crx_sample_to_chunk_t {
    pub first: u32,
    pub count: u32,
    pub id: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of crx_sample_to_chunk_t"][::core::mem::size_of::<crx_sample_to_chunk_t>() - 12usize];
    ["Alignment of crx_sample_to_chunk_t"]
        [::core::mem::align_of::<crx_sample_to_chunk_t>() - 4usize];
    ["Offset of field: crx_sample_to_chunk_t::first"]
        [::core::mem::offset_of!(crx_sample_to_chunk_t, first) - 0usize];
    ["Offset of field: crx_sample_to_chunk_t::count"]
        [::core::mem::offset_of!(crx_sample_to_chunk_t, count) - 4usize];
    ["Offset of field: crx_sample_to_chunk_t::id"]
        [::core::mem::offset_of!(crx_sample_to_chunk_t, id) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct crx_data_header_t {
    pub version: i32,
    pub f_width: i32,
    pub f_height: i32,
    pub tileWidth: i32,
    pub tileHeight: i32,
    pub nBits: i32,
    pub nPlanes: i32,
    pub cfaLayout: i32,
    pub encType: i32,
    pub imageLevels: i32,
    pub hasTileCols: i32,
    pub hasTileRows: i32,
    pub mdatHdrSize: i32,
    pub medianBits: i32,
    pub MediaSize: u32,
    pub MediaOffset: INT64,
    pub MediaType: u32,
    pub stsc_data: *mut crx_sample_to_chunk_t,
    pub stsc_count: u32,
    pub sample_count: u32,
    pub sample_size: u32,
    pub sample_sizes: *mut i32,
    pub chunk_count: u32,
    pub chunk_offsets: *mut INT64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of crx_data_header_t"][::core::mem::size_of::<crx_data_header_t>() - 128usize];
    ["Alignment of crx_data_header_t"][::core::mem::align_of::<crx_data_header_t>() - 8usize];
    ["Offset of field: crx_data_header_t::version"]
        [::core::mem::offset_of!(crx_data_header_t, version) - 0usize];
    ["Offset of field: crx_data_header_t::f_width"]
        [::core::mem::offset_of!(crx_data_header_t, f_width) - 4usize];
    ["Offset of field: crx_data_header_t::f_height"]
        [::core::mem::offset_of!(crx_data_header_t, f_height) - 8usize];
    ["Offset of field: crx_data_header_t::tileWidth"]
        [::core::mem::offset_of!(crx_data_header_t, tileWidth) - 12usize];
    ["Offset of field: crx_data_header_t::tileHeight"]
        [::core::mem::offset_of!(crx_data_header_t, tileHeight) - 16usize];
    ["Offset of field: crx_data_header_t::nBits"]
        [::core::mem::offset_of!(crx_data_header_t, nBits) - 20usize];
    ["Offset of field: crx_data_header_t::nPlanes"]
        [::core::mem::offset_of!(crx_data_header_t, nPlanes) - 24usize];
    ["Offset of field: crx_data_header_t::cfaLayout"]
        [::core::mem::offset_of!(crx_data_header_t, cfaLayout) - 28usize];
    ["Offset of field: crx_data_header_t::encType"]
        [::core::mem::offset_of!(crx_data_header_t, encType) - 32usize];
    ["Offset of field: crx_data_header_t::imageLevels"]
        [::core::mem::offset_of!(crx_data_header_t, imageLevels) - 36usize];
    ["Offset of field: crx_data_header_t::hasTileCols"]
        [::core::mem::offset_of!(crx_data_header_t, hasTileCols) - 40usize];
    ["Offset of field: crx_data_header_t::hasTileRows"]
        [::core::mem::offset_of!(crx_data_header_t, hasTileRows) - 44usize];
    ["Offset of field: crx_data_header_t::mdatHdrSize"]
        [::core::mem::offset_of!(crx_data_header_t, mdatHdrSize) - 48usize];
    ["Offset of field: crx_data_header_t::medianBits"]
        [::core::mem::offset_of!(crx_data_header_t, medianBits) - 52usize];
    ["Offset of field: crx_data_header_t::MediaSize"]
        [::core::mem::offset_of!(crx_data_header_t, MediaSize) - 56usize];
    ["Offset of field: crx_data_header_t::MediaOffset"]
        [::core::mem::offset_of!(crx_data_header_t, MediaOffset) - 64usize];
    ["Offset of field: crx_data_header_t::MediaType"]
        [::core::mem::offset_of!(crx_data_header_t, MediaType) - 72usize];
    ["Offset of field: crx_data_header_t::stsc_data"]
        [::core::mem::offset_of!(crx_data_header_t, stsc_data) - 80usize];
    ["Offset of field: crx_data_header_t::stsc_count"]
        [::core::mem::offset_of!(crx_data_header_t, stsc_count) - 88usize];
    ["Offset of field: crx_data_header_t::sample_count"]
        [::core::mem::offset_of!(crx_data_header_t, sample_count) - 92usize];
    ["Offset of field: crx_data_header_t::sample_size"]
        [::core::mem::offset_of!(crx_data_header_t, sample_size) - 96usize];
    ["Offset of field: crx_data_header_t::sample_sizes"]
        [::core::mem::offset_of!(crx_data_header_t, sample_sizes) - 104usize];
    ["Offset of field: crx_data_header_t::chunk_count"]
        [::core::mem::offset_of!(crx_data_header_t, chunk_count) - 112usize];
    ["Offset of field: crx_data_header_t::chunk_offsets"]
        [::core::mem::offset_of!(crx_data_header_t, chunk_offsets) - 120usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct unpacker_data_t {
    pub order: libc::c_short,
    pub sraw_mul: [ushort; 4usize],
    pub cr2_slice: [ushort; 3usize],
    pub kodak_cbpp: libc::c_uint,
    pub strip_offset: INT64,
    pub data_offset: INT64,
    pub meta_offset: INT64,
    pub exif_offset: INT64,
    pub exif_subdir_offset: INT64,
    pub ifd0_offset: INT64,
    pub data_size: libc::c_uint,
    pub meta_length: libc::c_uint,
    pub cr3_exif_length: libc::c_uint,
    pub cr3_ifd0_length: libc::c_uint,
    pub thumb_misc: libc::c_uint,
    pub thumb_format: LibRaw_internal_thumbnail_formats,
    pub fuji_layout: libc::c_uint,
    pub tiff_samples: libc::c_uint,
    pub tiff_bps: libc::c_uint,
    pub tiff_compress: libc::c_uint,
    pub tiff_sampleformat: libc::c_uint,
    pub zero_after_ff: libc::c_uint,
    pub tile_width: libc::c_uint,
    pub tile_length: libc::c_uint,
    pub load_flags: libc::c_uint,
    pub data_error: libc::c_uint,
    pub hasselblad_parser_flag: libc::c_int,
    pub posRAFData: libc::c_longlong,
    pub lenRAFData: libc::c_uint,
    pub fuji_total_lines: libc::c_int,
    pub fuji_total_blocks: libc::c_int,
    pub fuji_block_width: libc::c_int,
    pub fuji_bits: libc::c_int,
    pub fuji_raw_type: libc::c_int,
    pub fuji_lossless: libc::c_int,
    pub pana_encoding: libc::c_int,
    pub pana_bpp: libc::c_int,
    pub crx_header: [crx_data_header_t; 16usize],
    pub crx_track_selected: libc::c_int,
    pub crx_track_count: libc::c_int,
    pub CR3_CTMDtag: libc::c_short,
    pub CR3_Version: libc::c_short,
    pub CM_found: libc::c_int,
    pub is_NikonTransfer: libc::c_uint,
    pub is_Olympus: libc::c_uint,
    pub OlympusDNG_SubDirOffsetValid: libc::c_int,
    pub is_Sony: libc::c_uint,
    pub is_pana_raw: libc::c_uint,
    pub is_PentaxRicohMakernotes: libc::c_uint,
    pub dng_frames: [libc::c_uint; 20usize],
    pub raw_stride: libc::c_ushort,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of unpacker_data_t"][::core::mem::size_of::<unpacker_data_t>() - 2368usize];
    ["Alignment of unpacker_data_t"][::core::mem::align_of::<unpacker_data_t>() - 8usize];
    ["Offset of field: unpacker_data_t::order"]
        [::core::mem::offset_of!(unpacker_data_t, order) - 0usize];
    ["Offset of field: unpacker_data_t::sraw_mul"]
        [::core::mem::offset_of!(unpacker_data_t, sraw_mul) - 2usize];
    ["Offset of field: unpacker_data_t::cr2_slice"]
        [::core::mem::offset_of!(unpacker_data_t, cr2_slice) - 10usize];
    ["Offset of field: unpacker_data_t::kodak_cbpp"]
        [::core::mem::offset_of!(unpacker_data_t, kodak_cbpp) - 16usize];
    ["Offset of field: unpacker_data_t::strip_offset"]
        [::core::mem::offset_of!(unpacker_data_t, strip_offset) - 24usize];
    ["Offset of field: unpacker_data_t::data_offset"]
        [::core::mem::offset_of!(unpacker_data_t, data_offset) - 32usize];
    ["Offset of field: unpacker_data_t::meta_offset"]
        [::core::mem::offset_of!(unpacker_data_t, meta_offset) - 40usize];
    ["Offset of field: unpacker_data_t::exif_offset"]
        [::core::mem::offset_of!(unpacker_data_t, exif_offset) - 48usize];
    ["Offset of field: unpacker_data_t::exif_subdir_offset"]
        [::core::mem::offset_of!(unpacker_data_t, exif_subdir_offset) - 56usize];
    ["Offset of field: unpacker_data_t::ifd0_offset"]
        [::core::mem::offset_of!(unpacker_data_t, ifd0_offset) - 64usize];
    ["Offset of field: unpacker_data_t::data_size"]
        [::core::mem::offset_of!(unpacker_data_t, data_size) - 72usize];
    ["Offset of field: unpacker_data_t::meta_length"]
        [::core::mem::offset_of!(unpacker_data_t, meta_length) - 76usize];
    ["Offset of field: unpacker_data_t::cr3_exif_length"]
        [::core::mem::offset_of!(unpacker_data_t, cr3_exif_length) - 80usize];
    ["Offset of field: unpacker_data_t::cr3_ifd0_length"]
        [::core::mem::offset_of!(unpacker_data_t, cr3_ifd0_length) - 84usize];
    ["Offset of field: unpacker_data_t::thumb_misc"]
        [::core::mem::offset_of!(unpacker_data_t, thumb_misc) - 88usize];
    ["Offset of field: unpacker_data_t::thumb_format"]
        [::core::mem::offset_of!(unpacker_data_t, thumb_format) - 92usize];
    ["Offset of field: unpacker_data_t::fuji_layout"]
        [::core::mem::offset_of!(unpacker_data_t, fuji_layout) - 96usize];
    ["Offset of field: unpacker_data_t::tiff_samples"]
        [::core::mem::offset_of!(unpacker_data_t, tiff_samples) - 100usize];
    ["Offset of field: unpacker_data_t::tiff_bps"]
        [::core::mem::offset_of!(unpacker_data_t, tiff_bps) - 104usize];
    ["Offset of field: unpacker_data_t::tiff_compress"]
        [::core::mem::offset_of!(unpacker_data_t, tiff_compress) - 108usize];
    ["Offset of field: unpacker_data_t::tiff_sampleformat"]
        [::core::mem::offset_of!(unpacker_data_t, tiff_sampleformat) - 112usize];
    ["Offset of field: unpacker_data_t::zero_after_ff"]
        [::core::mem::offset_of!(unpacker_data_t, zero_after_ff) - 116usize];
    ["Offset of field: unpacker_data_t::tile_width"]
        [::core::mem::offset_of!(unpacker_data_t, tile_width) - 120usize];
    ["Offset of field: unpacker_data_t::tile_length"]
        [::core::mem::offset_of!(unpacker_data_t, tile_length) - 124usize];
    ["Offset of field: unpacker_data_t::load_flags"]
        [::core::mem::offset_of!(unpacker_data_t, load_flags) - 128usize];
    ["Offset of field: unpacker_data_t::data_error"]
        [::core::mem::offset_of!(unpacker_data_t, data_error) - 132usize];
    ["Offset of field: unpacker_data_t::hasselblad_parser_flag"]
        [::core::mem::offset_of!(unpacker_data_t, hasselblad_parser_flag) - 136usize];
    ["Offset of field: unpacker_data_t::posRAFData"]
        [::core::mem::offset_of!(unpacker_data_t, posRAFData) - 144usize];
    ["Offset of field: unpacker_data_t::lenRAFData"]
        [::core::mem::offset_of!(unpacker_data_t, lenRAFData) - 152usize];
    ["Offset of field: unpacker_data_t::fuji_total_lines"]
        [::core::mem::offset_of!(unpacker_data_t, fuji_total_lines) - 156usize];
    ["Offset of field: unpacker_data_t::fuji_total_blocks"]
        [::core::mem::offset_of!(unpacker_data_t, fuji_total_blocks) - 160usize];
    ["Offset of field: unpacker_data_t::fuji_block_width"]
        [::core::mem::offset_of!(unpacker_data_t, fuji_block_width) - 164usize];
    ["Offset of field: unpacker_data_t::fuji_bits"]
        [::core::mem::offset_of!(unpacker_data_t, fuji_bits) - 168usize];
    ["Offset of field: unpacker_data_t::fuji_raw_type"]
        [::core::mem::offset_of!(unpacker_data_t, fuji_raw_type) - 172usize];
    ["Offset of field: unpacker_data_t::fuji_lossless"]
        [::core::mem::offset_of!(unpacker_data_t, fuji_lossless) - 176usize];
    ["Offset of field: unpacker_data_t::pana_encoding"]
        [::core::mem::offset_of!(unpacker_data_t, pana_encoding) - 180usize];
    ["Offset of field: unpacker_data_t::pana_bpp"]
        [::core::mem::offset_of!(unpacker_data_t, pana_bpp) - 184usize];
    ["Offset of field: unpacker_data_t::crx_header"]
        [::core::mem::offset_of!(unpacker_data_t, crx_header) - 192usize];
    ["Offset of field: unpacker_data_t::crx_track_selected"]
        [::core::mem::offset_of!(unpacker_data_t, crx_track_selected) - 2240usize];
    ["Offset of field: unpacker_data_t::crx_track_count"]
        [::core::mem::offset_of!(unpacker_data_t, crx_track_count) - 2244usize];
    ["Offset of field: unpacker_data_t::CR3_CTMDtag"]
        [::core::mem::offset_of!(unpacker_data_t, CR3_CTMDtag) - 2248usize];
    ["Offset of field: unpacker_data_t::CR3_Version"]
        [::core::mem::offset_of!(unpacker_data_t, CR3_Version) - 2250usize];
    ["Offset of field: unpacker_data_t::CM_found"]
        [::core::mem::offset_of!(unpacker_data_t, CM_found) - 2252usize];
    ["Offset of field: unpacker_data_t::is_NikonTransfer"]
        [::core::mem::offset_of!(unpacker_data_t, is_NikonTransfer) - 2256usize];
    ["Offset of field: unpacker_data_t::is_Olympus"]
        [::core::mem::offset_of!(unpacker_data_t, is_Olympus) - 2260usize];
    ["Offset of field: unpacker_data_t::OlympusDNG_SubDirOffsetValid"]
        [::core::mem::offset_of!(unpacker_data_t, OlympusDNG_SubDirOffsetValid) - 2264usize];
    ["Offset of field: unpacker_data_t::is_Sony"]
        [::core::mem::offset_of!(unpacker_data_t, is_Sony) - 2268usize];
    ["Offset of field: unpacker_data_t::is_pana_raw"]
        [::core::mem::offset_of!(unpacker_data_t, is_pana_raw) - 2272usize];
    ["Offset of field: unpacker_data_t::is_PentaxRicohMakernotes"]
        [::core::mem::offset_of!(unpacker_data_t, is_PentaxRicohMakernotes) - 2276usize];
    ["Offset of field: unpacker_data_t::dng_frames"]
        [::core::mem::offset_of!(unpacker_data_t, dng_frames) - 2280usize];
    ["Offset of field: unpacker_data_t::raw_stride"]
        [::core::mem::offset_of!(unpacker_data_t, raw_stride) - 2360usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct libraw_internal_data_t {
    pub internal_data: internal_data_t,
    pub internal_output_params: libraw_internal_output_params_t,
    pub output_data: output_data_t,
    pub identify_data: identify_data_t,
    pub unpacker_data: unpacker_data_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of libraw_internal_data_t"]
        [::core::mem::size_of::<libraw_internal_data_t>() - 2504usize];
    ["Alignment of libraw_internal_data_t"]
        [::core::mem::align_of::<libraw_internal_data_t>() - 8usize];
    ["Offset of field: libraw_internal_data_t::internal_data"]
        [::core::mem::offset_of!(libraw_internal_data_t, internal_data) - 0usize];
    ["Offset of field: libraw_internal_data_t::internal_output_params"]
        [::core::mem::offset_of!(libraw_internal_data_t, internal_output_params) - 64usize];
    ["Offset of field: libraw_internal_data_t::output_data"]
        [::core::mem::offset_of!(libraw_internal_data_t, output_data) - 80usize];
    ["Offset of field: libraw_internal_data_t::identify_data"]
        [::core::mem::offset_of!(libraw_internal_data_t, identify_data) - 96usize];
    ["Offset of field: libraw_internal_data_t::unpacker_data"]
        [::core::mem::offset_of!(libraw_internal_data_t, unpacker_data) - 136usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct decode {
    pub branch: [*mut decode; 2usize],
    pub leaf: libc::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of decode"][::core::mem::size_of::<decode>() - 24usize];
    ["Alignment of decode"][::core::mem::align_of::<decode>() - 8usize];
    ["Offset of field: decode::branch"][::core::mem::offset_of!(decode, branch) - 0usize];
    ["Offset of field: decode::leaf"][::core::mem::offset_of!(decode, leaf) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq)]
pub struct tiff_ifd_t {
    pub t_width: libc::c_int,
    pub t_height: libc::c_int,
    pub bps: libc::c_int,
    pub comp: libc::c_int,
    pub phint: libc::c_int,
    pub offset: libc::c_int,
    pub t_flip: libc::c_int,
    pub samples: libc::c_int,
    pub bytes: libc::c_int,
    pub extrasamples: libc::c_int,
    pub t_tile_width: libc::c_int,
    pub t_tile_length: libc::c_int,
    pub sample_format: libc::c_int,
    pub predictor: libc::c_int,
    pub rows_per_strip: libc::c_int,
    pub strip_offsets: *mut libc::c_int,
    pub strip_offsets_count: libc::c_int,
    pub strip_byte_counts: *mut libc::c_int,
    pub strip_byte_counts_count: libc::c_int,
    pub t_filters: libc::c_uint,
    pub t_vwidth: libc::c_int,
    pub t_vheight: libc::c_int,
    pub t_lm: libc::c_int,
    pub t_tm: libc::c_int,
    pub t_fuji_width: libc::c_int,
    pub t_shutter: f32,
    pub opcode2_offset: INT64,
    pub lineartable_offset: INT64,
    pub lineartable_len: libc::c_int,
    pub dng_color: [libraw_dng_color_t; 2usize],
    pub dng_levels: libraw_dng_levels_t,
    pub newsubfiletype: libc::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of tiff_ifd_t"][::core::mem::size_of::<tiff_ifd_t>() - 33408usize];
    ["Alignment of tiff_ifd_t"][::core::mem::align_of::<tiff_ifd_t>() - 8usize];
    ["Offset of field: tiff_ifd_t::t_width"][::core::mem::offset_of!(tiff_ifd_t, t_width) - 0usize];
    ["Offset of field: tiff_ifd_t::t_height"]
        [::core::mem::offset_of!(tiff_ifd_t, t_height) - 4usize];
    ["Offset of field: tiff_ifd_t::bps"][::core::mem::offset_of!(tiff_ifd_t, bps) - 8usize];
    ["Offset of field: tiff_ifd_t::comp"][::core::mem::offset_of!(tiff_ifd_t, comp) - 12usize];
    ["Offset of field: tiff_ifd_t::phint"][::core::mem::offset_of!(tiff_ifd_t, phint) - 16usize];
    ["Offset of field: tiff_ifd_t::offset"][::core::mem::offset_of!(tiff_ifd_t, offset) - 20usize];
    ["Offset of field: tiff_ifd_t::t_flip"][::core::mem::offset_of!(tiff_ifd_t, t_flip) - 24usize];
    ["Offset of field: tiff_ifd_t::samples"]
        [::core::mem::offset_of!(tiff_ifd_t, samples) - 28usize];
    ["Offset of field: tiff_ifd_t::bytes"][::core::mem::offset_of!(tiff_ifd_t, bytes) - 32usize];
    ["Offset of field: tiff_ifd_t::extrasamples"]
        [::core::mem::offset_of!(tiff_ifd_t, extrasamples) - 36usize];
    ["Offset of field: tiff_ifd_t::t_tile_width"]
        [::core::mem::offset_of!(tiff_ifd_t, t_tile_width) - 40usize];
    ["Offset of field: tiff_ifd_t::t_tile_length"]
        [::core::mem::offset_of!(tiff_ifd_t, t_tile_length) - 44usize];
    ["Offset of field: tiff_ifd_t::sample_format"]
        [::core::mem::offset_of!(tiff_ifd_t, sample_format) - 48usize];
    ["Offset of field: tiff_ifd_t::predictor"]
        [::core::mem::offset_of!(tiff_ifd_t, predictor) - 52usize];
    ["Offset of field: tiff_ifd_t::rows_per_strip"]
        [::core::mem::offset_of!(tiff_ifd_t, rows_per_strip) - 56usize];
    ["Offset of field: tiff_ifd_t::strip_offsets"]
        [::core::mem::offset_of!(tiff_ifd_t, strip_offsets) - 64usize];
    ["Offset of field: tiff_ifd_t::strip_offsets_count"]
        [::core::mem::offset_of!(tiff_ifd_t, strip_offsets_count) - 72usize];
    ["Offset of field: tiff_ifd_t::strip_byte_counts"]
        [::core::mem::offset_of!(tiff_ifd_t, strip_byte_counts) - 80usize];
    ["Offset of field: tiff_ifd_t::strip_byte_counts_count"]
        [::core::mem::offset_of!(tiff_ifd_t, strip_byte_counts_count) - 88usize];
    ["Offset of field: tiff_ifd_t::t_filters"]
        [::core::mem::offset_of!(tiff_ifd_t, t_filters) - 92usize];
    ["Offset of field: tiff_ifd_t::t_vwidth"]
        [::core::mem::offset_of!(tiff_ifd_t, t_vwidth) - 96usize];
    ["Offset of field: tiff_ifd_t::t_vheight"]
        [::core::mem::offset_of!(tiff_ifd_t, t_vheight) - 100usize];
    ["Offset of field: tiff_ifd_t::t_lm"][::core::mem::offset_of!(tiff_ifd_t, t_lm) - 104usize];
    ["Offset of field: tiff_ifd_t::t_tm"][::core::mem::offset_of!(tiff_ifd_t, t_tm) - 108usize];
    ["Offset of field: tiff_ifd_t::t_fuji_width"]
        [::core::mem::offset_of!(tiff_ifd_t, t_fuji_width) - 112usize];
    ["Offset of field: tiff_ifd_t::t_shutter"]
        [::core::mem::offset_of!(tiff_ifd_t, t_shutter) - 116usize];
    ["Offset of field: tiff_ifd_t::opcode2_offset"]
        [::core::mem::offset_of!(tiff_ifd_t, opcode2_offset) - 120usize];
    ["Offset of field: tiff_ifd_t::lineartable_offset"]
        [::core::mem::offset_of!(tiff_ifd_t, lineartable_offset) - 128usize];
    ["Offset of field: tiff_ifd_t::lineartable_len"]
        [::core::mem::offset_of!(tiff_ifd_t, lineartable_len) - 136usize];
    ["Offset of field: tiff_ifd_t::dng_color"]
        [::core::mem::offset_of!(tiff_ifd_t, dng_color) - 140usize];
    ["Offset of field: tiff_ifd_t::dng_levels"]
        [::core::mem::offset_of!(tiff_ifd_t, dng_levels) - 476usize];
    ["Offset of field: tiff_ifd_t::newsubfiletype"]
        [::core::mem::offset_of!(tiff_ifd_t, newsubfiletype) - 33404usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct jhead {
    pub algo: libc::c_int,
    pub bits: libc::c_int,
    pub high: libc::c_int,
    pub wide: libc::c_int,
    pub clrs: libc::c_int,
    pub sraw: libc::c_int,
    pub psv: libc::c_int,
    pub restart: libc::c_int,
    pub vpred: [libc::c_int; 6usize],
    pub quant: [ushort; 64usize],
    pub idct: [ushort; 64usize],
    pub huff: [*mut ushort; 20usize],
    pub free: [*mut ushort; 20usize],
    pub row: *mut ushort,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of jhead"][::core::mem::size_of::<jhead>() - 640usize];
    ["Alignment of jhead"][::core::mem::align_of::<jhead>() - 8usize];
    ["Offset of field: jhead::algo"][::core::mem::offset_of!(jhead, algo) - 0usize];
    ["Offset of field: jhead::bits"][::core::mem::offset_of!(jhead, bits) - 4usize];
    ["Offset of field: jhead::high"][::core::mem::offset_of!(jhead, high) - 8usize];
    ["Offset of field: jhead::wide"][::core::mem::offset_of!(jhead, wide) - 12usize];
    ["Offset of field: jhead::clrs"][::core::mem::offset_of!(jhead, clrs) - 16usize];
    ["Offset of field: jhead::sraw"][::core::mem::offset_of!(jhead, sraw) - 20usize];
    ["Offset of field: jhead::psv"][::core::mem::offset_of!(jhead, psv) - 24usize];
    ["Offset of field: jhead::restart"][::core::mem::offset_of!(jhead, restart) - 28usize];
    ["Offset of field: jhead::vpred"][::core::mem::offset_of!(jhead, vpred) - 32usize];
    ["Offset of field: jhead::quant"][::core::mem::offset_of!(jhead, quant) - 56usize];
    ["Offset of field: jhead::idct"][::core::mem::offset_of!(jhead, idct) - 184usize];
    ["Offset of field: jhead::huff"][::core::mem::offset_of!(jhead, huff) - 312usize];
    ["Offset of field: jhead::free"][::core::mem::offset_of!(jhead, free) - 472usize];
    ["Offset of field: jhead::row"][::core::mem::offset_of!(jhead, row) - 632usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct libraw_tiff_tag {
    pub tag: ushort,
    pub type_: ushort,
    pub count: libc::c_int,
    pub val: libraw_tiff_tag__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union libraw_tiff_tag__bindgen_ty_1 {
    pub c: [libc::c_char; 4usize],
    pub s: [libc::c_short; 2usize],
    pub i: libc::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of libraw_tiff_tag__bindgen_ty_1"]
        [::core::mem::size_of::<libraw_tiff_tag__bindgen_ty_1>() - 4usize];
    ["Alignment of libraw_tiff_tag__bindgen_ty_1"]
        [::core::mem::align_of::<libraw_tiff_tag__bindgen_ty_1>() - 4usize];
    ["Offset of field: libraw_tiff_tag__bindgen_ty_1::c"]
        [::core::mem::offset_of!(libraw_tiff_tag__bindgen_ty_1, c) - 0usize];
    ["Offset of field: libraw_tiff_tag__bindgen_ty_1::s"]
        [::core::mem::offset_of!(libraw_tiff_tag__bindgen_ty_1, s) - 0usize];
    ["Offset of field: libraw_tiff_tag__bindgen_ty_1::i"]
        [::core::mem::offset_of!(libraw_tiff_tag__bindgen_ty_1, i) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of libraw_tiff_tag"][::core::mem::size_of::<libraw_tiff_tag>() - 12usize];
    ["Alignment of libraw_tiff_tag"][::core::mem::align_of::<libraw_tiff_tag>() - 4usize];
    ["Offset of field: libraw_tiff_tag::tag"]
        [::core::mem::offset_of!(libraw_tiff_tag, tag) - 0usize];
    ["Offset of field: libraw_tiff_tag::type_"]
        [::core::mem::offset_of!(libraw_tiff_tag, type_) - 2usize];
    ["Offset of field: libraw_tiff_tag::count"]
        [::core::mem::offset_of!(libraw_tiff_tag, count) - 4usize];
    ["Offset of field: libraw_tiff_tag::val"]
        [::core::mem::offset_of!(libraw_tiff_tag, val) - 8usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct tiff_hdr {
    pub t_order: ushort,
    pub magic: ushort,
    pub ifd: libc::c_int,
    pub pad: ushort,
    pub ntag: ushort,
    pub tag: [libraw_tiff_tag; 23usize],
    pub nextifd: libc::c_int,
    pub pad2: ushort,
    pub nexif: ushort,
    pub exif: [libraw_tiff_tag; 4usize],
    pub pad3: ushort,
    pub ngps: ushort,
    pub gpst: [libraw_tiff_tag; 10usize],
    pub bps: [libc::c_short; 4usize],
    pub rat: [libc::c_int; 10usize],
    pub gps: [libc::c_uint; 26usize],
    pub t_desc: [libc::c_char; 512usize],
    pub t_make: [libc::c_char; 64usize],
    pub t_model: [libc::c_char; 64usize],
    pub soft: [libc::c_char; 32usize],
    pub date: [libc::c_char; 20usize],
    pub t_artist: [libc::c_char; 64usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of tiff_hdr"][::core::mem::size_of::<tiff_hdr>() - 1376usize];
    ["Alignment of tiff_hdr"][::core::mem::align_of::<tiff_hdr>() - 4usize];
    ["Offset of field: tiff_hdr::t_order"][::core::mem::offset_of!(tiff_hdr, t_order) - 0usize];
    ["Offset of field: tiff_hdr::magic"][::core::mem::offset_of!(tiff_hdr, magic) - 2usize];
    ["Offset of field: tiff_hdr::ifd"][::core::mem::offset_of!(tiff_hdr, ifd) - 4usize];
    ["Offset of field: tiff_hdr::pad"][::core::mem::offset_of!(tiff_hdr, pad) - 8usize];
    ["Offset of field: tiff_hdr::ntag"][::core::mem::offset_of!(tiff_hdr, ntag) - 10usize];
    ["Offset of field: tiff_hdr::tag"][::core::mem::offset_of!(tiff_hdr, tag) - 12usize];
    ["Offset of field: tiff_hdr::nextifd"][::core::mem::offset_of!(tiff_hdr, nextifd) - 288usize];
    ["Offset of field: tiff_hdr::pad2"][::core::mem::offset_of!(tiff_hdr, pad2) - 292usize];
    ["Offset of field: tiff_hdr::nexif"][::core::mem::offset_of!(tiff_hdr, nexif) - 294usize];
    ["Offset of field: tiff_hdr::exif"][::core::mem::offset_of!(tiff_hdr, exif) - 296usize];
    ["Offset of field: tiff_hdr::pad3"][::core::mem::offset_of!(tiff_hdr, pad3) - 344usize];
    ["Offset of field: tiff_hdr::ngps"][::core::mem::offset_of!(tiff_hdr, ngps) - 346usize];
    ["Offset of field: tiff_hdr::gpst"][::core::mem::offset_of!(tiff_hdr, gpst) - 348usize];
    ["Offset of field: tiff_hdr::bps"][::core::mem::offset_of!(tiff_hdr, bps) - 468usize];
    ["Offset of field: tiff_hdr::rat"][::core::mem::offset_of!(tiff_hdr, rat) - 476usize];
    ["Offset of field: tiff_hdr::gps"][::core::mem::offset_of!(tiff_hdr, gps) - 516usize];
    ["Offset of field: tiff_hdr::t_desc"][::core::mem::offset_of!(tiff_hdr, t_desc) - 620usize];
    ["Offset of field: tiff_hdr::t_make"][::core::mem::offset_of!(tiff_hdr, t_make) - 1132usize];
    ["Offset of field: tiff_hdr::t_model"][::core::mem::offset_of!(tiff_hdr, t_model) - 1196usize];
    ["Offset of field: tiff_hdr::soft"][::core::mem::offset_of!(tiff_hdr, soft) - 1260usize];
    ["Offset of field: tiff_hdr::date"][::core::mem::offset_of!(tiff_hdr, date) - 1292usize];
    ["Offset of field: tiff_hdr::t_artist"]
        [::core::mem::offset_of!(tiff_hdr, t_artist) - 1312usize];
};
unsafe extern "C" {
    pub fn libraw_strerror(errorcode: libc::c_int) -> *const libc::c_char;
}
unsafe extern "C" {
    pub fn libraw_strprogress(arg1: LibRaw_progress) -> *const libc::c_char;
}
unsafe extern "C" {
    pub fn libraw_init(flags: libc::c_uint) -> *mut libraw_data_t;
}
unsafe extern "C" {
    pub fn libraw_open_file(arg1: *mut libraw_data_t, arg2: *const libc::c_char) -> libc::c_int;
}
unsafe extern "C" {
    pub fn libraw_open_wfile(arg1: *mut libraw_data_t, arg2: *const wchar_t) -> libc::c_int;
}
unsafe extern "C" {
    pub fn libraw_open_buffer(
        arg1: *mut libraw_data_t,
        buffer: *const libc::c_void,
        size: usize,
    ) -> libc::c_int;
}
unsafe extern "C" {
    pub fn libraw_open_bayer(
        lr: *mut libraw_data_t,
        data: *mut libc::c_uchar,
        datalen: libc::c_uint,
        _raw_width: ushort,
